[
  {
    "title": "Supreme Court Clarifies Key Insolvency Issues In Bhushan Power & Steel",
    "description": "<p>The Supreme Court's ruling in *Kalyani Transco v. Bhushan Power & Steel Ltd. & Ors.* addresses several critical issues arising from the Corporate Insolvency Resolution Process (CIRP) of Bhushan Power and Steel Limited (BPSL) under the Insolvency and Bankruptcy Code, 2016 (IBC). The case stemmed from challenges to the resolution plan submitted by JSW Steel, the Successful Resolution Applicant (SRA), and approved by the Committee of Creditors (CoC) and the National Company Law Tribunal (NCLT).</p>\n\n<p>The Supreme Court's judgment reinforces the sanctity of resolution plans and the importance of creditor decision-making within the IBC framework. The court addressed issues such as the locus standi of promoters, the continuation of the CoC after plan approval, the permissibility of extending plan implementation timelines, and the treatment of profits (EBITDA) earned by the corporate debtor during CIRP. It also clarified the extinguishment of pre-CIRP claims upon resolution plan approval.</p>\n\n<p>Key rulings include the acceptance of promoters as \"persons aggrieved\" with caveats regarding obstructive behavior, the clarification that the CoC remains active until plan implementation or liquidation, and the rejection of clauses allowing indefinite extension of implementation. The court also ruled that EBITDA earned during CIRP remains with the corporate debtor unless the resolution plan specifies otherwise, and reaffirmed that pre-CIRP claims are extinguished upon plan approval under Section 31 of the IBC. The judgment underscores the paramount importance of the commercial wisdom of the CoC and protects resolution applicants from penalties for delays caused by external factors.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/supreme-court-ruling-in-bhushan-power-insolvency-case.jpg"
  },
  {
    "title": "Public Land Auction Set Aside by Supreme Court Due to Statutory Non-Compliance",
    "description": "<p>In Delhi Development Authority v. Corporation Bank & Ors., the Supreme Court of India invalidated the Debts Recovery Tribunal (DRT)'s auction of Delhi Development Authority (DDA) land. The Court held that the sale violated statutory safeguards and breached lease conditions, emphasizing that public land requires strict legal adherence for mortgage or transfer, making non-compliant auctions invalid.</p>\n\n<p>The ruling balanced protecting public property and ensuring fairness by protecting the bona fide auction purchaser through restitution with interest. This underscored the accountability of banks and state authorities while safeguarding innocent third parties in property and recovery proceedings.</p>\n\n<p>The case originated from a DDA plot allotted to Sarita Vihar Club in 2001 for a sports facility, subject to conditions, including that it could not be mortgaged without the Lieutenant Governor of Delhi's written consent. The club mortgaged the property to Corporation Bank without this consent, leading to recovery proceedings by the bank when the club defaulted. The DDA objected to the subsequent auction by the DRT due to non-compliance with the lease conditions and statutory requirements.</p>\n\n<p>The Supreme Court's decision has significant implications for property law and banking, reinforcing that statutory safeguards for leasehold land are non-negotiable and banks must conduct due diligence when providing loans. The ruling also clarifies that res judicata does not shield repeated violations. This is poised to influence banking prudence and recovery proceedings, ensuring the statutory rights of public authorities are upheld.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/sc-quashes-drt-auction-of-dda-land-for-non-compliance.jpg"
  },
  {
    "title": "Supreme Court Guidelines on Expeditious Disposal & Compounding under Section 138 NI Act: Sanjabij Tari v. Kishore S. Borcar",
    "description": "<p>On September 25, 2025, the Supreme Court of India issued a notable judgment in Sanjabij Tari v. Kishore S. Borcar (2025 INSC 1158), providing critical clarifications regarding cheque dishonour prosecutions under Section 138 of the Negotiable Instruments Act, 1881 (NI Act). The decision addresses both substantive legal issues, such as the presumption of liability and the enforceability of cash loans, and prescribes systemic reforms intended to alleviate the significant backlog of cheque bounce litigation in trial courts.</p>\n\n<p>The judgment clarifies recurring issues related to Section 138 of the NI Act, which criminalizes the dishonour of cheques issued for debt or liability discharge. It reinforces that once cheque execution is admitted, Sections 118(a) and 139 of the NI Act establish presumptions favoring the complainant, indicating the cheque was issued against a legally enforceable debt.</p>\n\n<p>Recognizing the extensive backlog of Section 138 cases, the Court implemented practical reforms aimed at expediting disposal and reducing pendency. These reforms include guidelines to limit revisional interference and promote compounding of offences.</p>\n\n<p>The Supreme Court's ruling in Sanjabij Tari v. Kishore S. Borcar is a significant development in cheque dishonour jurisprudence. It provides clarity on substantive law related to presumptions and debt enforceability while also introducing procedural reforms to address case backlogs. This combination of doctrinal clarity and systemic innovation is a crucial step toward improving the efficiency and credibility of cheque bounce litigation within the Indian judicial system.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/sc-issues-guidelines-on-cheque-bounce-cash-loan-cases.jpg"
  },
  {
    "title": "RBI Digitizes Voluntary Surrender of NBFC/HFC Licenses",
    "description": "<p>The Reserve Bank of India (RBI) has announced that Non-Banking Financial Companies (NBFCs) and Housing Finance Companies (HFCs) must now use the PRAVAAH portal to apply for the cancellation of their Certificate of Registration (COR). This update, announced on September 23, 2025, moves the process from email and hard-copy submissions to a centralized online platform.</p>\n\n<p>PRAVAAH, launched in May 2024, serves as a single-window system for various RBI approvals. The surrender-of-license module has been integrated into the portal, allowing applicants to upload the required PDF application form and supporting documents. The portal provides automated acknowledgment and routes the application to the relevant regional supervisory office.</p>\n\n<p>Despite the digitization of the application process, the RBI emphasizes that submitting the application does not immediately terminate the license. NBFCs and HFCs remain subject to all applicable regulations and reporting requirements until the RBI formally issues a cancellation letter, a process that may take several months. These institutions must continue to adhere to all guidelines issued by the RBI, NHB, or other relevant authorities and submit all required regulatory and supervisory returns during this interim period.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/rbi-digitalises-nbfc-hfc-licence-surrender-via-pravaah.jpg"
  },
  {
    "title": "SEBI (Custodian) (Amendment) Regulations, 2025: Raising Standards for Custodians of Securities",
    "description": "<p>The Securities and Exchange Board of India (SEBI) notified the Securities and Exchange Board of India (Custodian) (Amendment) Regulations, 2025 (“Amendment Regulations”) on September 18, 2025. These amendments significantly revise the SEBI (Custodian of Securities) Regulations, 1996 (“Principal Regulations”), enhancing financial thresholds, governance obligations, and compliance responsibilities for custodians to reinforce systemic stability, strengthen investor protection, and align with international standards.</p>\n\n<p>The amendments raise the minimum net worth requirement from ₹50 crore to ₹75 crore, with a three-year transition period for existing custodians. Custodians must maintain this net worth independently of other capital adequacy requirements. The scope of permissible activities is broadened, excluding banking companies and their affiliates. A new regulation mandates robust risk management frameworks, cybersecurity protocols, and business continuity plans.</p>\n\n<p>The code of conduct has been expanded to include 26 obligations. Custodians must comply with SEBI, RBI, and depository rules, avoid unfair competition, and provide effective grievance redressal mechanisms. They must also implement strong internal controls against fraud and misconduct, ensure the fitness of directors and key personnel, and empower independent compliance officers.</p>\n\n<p>These amendments increase compliance and capitalisation costs for custodians but also create opportunities for diversification. Investors benefit from enhanced transparency, strengthened grievance mechanisms, and reduced systemic risks. SEBI gains a more effective oversight framework, harmonising domestic norms with global standards, and enhancing investor confidence in Indian capital markets. These amendments represent a substantive reform of India’s custodian regime, strengthening the resilience and accountability of market infrastructure while safeguarding investor interests.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/sebi-tightens-custodian-rules-with-2025-amendments.jpg"
  },
  {
    "title": "Delhi High Court on Currency Accessibility: Relief for Visually Impaired Persons",
    "description": "<p>The Delhi High Court addressed petitions concerning the difficulties visually impaired individuals face in identifying Indian currency notes, particularly the ₹50 denomination introduced post-demonetization. The court emphasized that accessibility is a constitutional and statutory mandate under the Rights of Persons with Disabilities Act, 2016 (RPwD Act), requiring the State to ensure equal access to financial infrastructure.</p>\n\n<p>The petitions arose after the 2016 demonetization, as the reduced size variations in the new Mahatma Gandhi (New) Series notes made tactile identification challenging. The court formed a High-Powered Committee, led by Prof. M. Balakrishnan of IIT Delhi, to investigate and provide recommendations. The Committee highlighted the inadequacy of existing tactile features and proposed increased size variations, improved color contrasts, and durable materials. It also acknowledged the limitations of the MANI App and stressed the importance of accessibility in the Digital Rupee.</p>\n\n<p>The Reserve Bank of India (RBI) responded that the current confusion was due to the concurrent circulation of old and new notes and argued that redesigning notes is a complex and costly process. The RBI also emphasized existing accessibility features and ongoing improvements to the MANI App, as well as plans to ensure Digital Rupee accessibility. The court acknowledged the hardships faced by visually impaired individuals and RBI's concerns, directing that accessibility recommendations be incorporated into the next series of banknotes and mandating banks to submit bi-annual progress reports on digital accessibility compliance. The judgment underscores that while policy discretion rests with the RBI and the government, it is constrained by the constitutional obligation of accessibility. The author concludes that the ruling represents judicial pragmatism, balancing economic feasibility with constitutional rights and establishing a pathway for a more inclusive financial future.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/delhi-hc-on-currency-relief-for-visually-impaired.jpg"
  },
  {
    "title": "Rajasthan High Court Affirms Pension as a Right, Not Charity, for Widow",
    "description": "<p>The Rajasthan High Court recently ruled in favor of a widow, Smt. Mishri Devi, entitling her to family pension and death gratuity despite her late husband's \"temporary\" employment status. The court emphasized that pension is a statutory right, not a government concession, and that temporary service exceeding one year, following due selection, warrants pensionary benefits equivalent to permanent service.</p>\n\n<p>The case arose after authorities denied Smt. Devi family pension following her husband's death in 1990, claiming his appointment as a Lower Division Clerk (LDC) was \"purely temporary,\" even though he was selected through a regular process. Despite the state offering Smt. Devi compassionate appointment, implying her husband was a substantive employee, her pension claim was rejected.</p>\n\n<p>The High Court overturned the decision, asserting that the \"temporary appointment\" designation could not supersede Rule 268A of the Rajasthan Service Rules, 1951. It directed authorities to release family pension, death gratuity, and arrears with 9% interest, even though the claim was filed 24 years after her husband's passing. This ruling reinforces the principle of social justice within service law, ensuring the dignity of government employees and their families, and highlighting the state's responsibility to uphold social security benefits promptly.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/rajasthan-hc-widow-entitled-to-pension-despite-delay.jpg"
  },
  {
    "title": "FSSAI Orders Nationwide “Special Festive Drive” for Food Safety",
    "description": "<p>The Food Safety and Standards Authority of India (FSSAI) has initiated a nationwide enforcement drive targeting the safety of sweets, savouries, and dairy products during the peak festive season of September-October. This initiative, outlined in a \"MOST URGENT\" circular, instructs all States and Union Territories to conduct intensive surveillance and enforcement activities.</p>\n\n<p>The timing of this drive is crucial, as demand for these food items increases significantly (40-60%) during festivals like Navaratri, Durga Puja, Dussehra, Karva Chauth, and Diwali. This surge in demand can create opportunities for adulteration due to the price difference between genuine and substandard ingredients.</p>\n\n<p>The FSSAI has outlined specific actions, including: micro-targeting high-risk areas such as sweet shop clusters, railway stations, and tourist hubs, equipped with rapid-test and laboratory sampling kits; deploying \"Food-Safety-on-Wheels\" mobile labs for on-the-spot testing and consumer awareness; and digitizing all inspection data (GPS location, photos, test results) into the FoSCoS portal or FoSCoRIS app for transparency and accountability. Data must be complete by November 15th to allow FSSAI to release a public scorecard before the wedding season.</p>\n\n<p>Ultimately, the FSSAI aims to ensure consumer well-being and confidence in the safety and quality of food products during the festive season, preventing issues related to adulterated sweets and dairy products.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/fssai-launches-festive-drive-for-safe-sweets-milk.jpg"
  },
  {
    "title": "Tribunal Deems Procedural Lapses Curable, Admits Insolvency Plea Against Corporate Debtor",
    "description": "<p>The National Company Law Tribunal (NCLT), Mumbai Bench-II, admitted an insolvency petition filed by Pegasus Assets Reconstruction Pvt. Ltd. against Dee Plone Polyester Pvt. Ltd. under Section 7 of the Insolvency and Bankruptcy Code, 2016 (IBC), concerning a default exceeding ₹37 crore. The ruling underscores the tribunal's stance that demonstrable debt and default should take precedence over procedural irregularities.</p>\n\n<p>The case originated from loan facilities sanctioned by Dombivli Nagari Sahakari Bank Ltd. (DNS Bank) to Dee Plone Polyester Pvt. Ltd., secured by hypothecation and mortgage deeds. After the Corporate Debtor defaulted, DNS Bank classified the loan as an NPA and subsequently assigned the debt to Pegasus Assets Reconstruction Pvt. Ltd. As of October 16, 2023, the default amounted to ₹37.35 crore, which the Corporate Debtor acknowledged in audited financial statements and email correspondence.</p>\n\n<p>The NCLT concluded that procedural objections concerning stamping, registration, and authorization lapses were curable and did not invalidate the insolvency petition. It emphasized that acknowledgment of debt extends the limitation period and that the core focus under Section 7 of the IBC remains establishing the existence of financial debt and default. The tribunal dismissed allegations of malicious intent and reinforced the role of Asset Reconstruction Companies (ARCs) in pursuing CIRP against defaulting borrowers. The decision reinforces the principle that the IBC is intended as a timely resolution mechanism focused on debt and default rather than being derailed by technical objections.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/nclt-admits-insolvency-plea-curable-lapses-clarified.jpg"
  },
  {
    "title": "BIS Issues Fresh Rules for Digital TV Receivers – 26 Oct 2025 Deadline Looms",
    "description": "<p>The Bureau of Indian Standards (BIS) has issued a circular effective 18 September 2025, mandating compliance with IS 18112:2025 \"Digital Television Receiver for Satellite Broadcast Transmission Specification (First Revision)\" for all plasma, LCD, and LED televisions sold in India. This is in addition to the existing safety standard IS 616:2017 / IEC 60065:2014, enforced under the Compulsory Registration Scheme (CRS). The deadline for compliance is 26 October 2025.</p>\n\n<p>The new regulation requires all television sets, both new and existing models, to incorporate a digital satellite receiver compliant with IS 18112 while continuing to meet the safety requirements of IS 616. A single R-number will now cover both standards, replacing separate satellite-only certifications. While labs can accept IS 18112:2022 test data until 30 December 2025, manufacturers must provide a notarized declaration committing to upgrade to the 2025 version.</p>\n\n<p>Existing safety-only licensees have until 25 September 2025 to submit inclusion requests with updated test reports. Those with models already containing evaluated satellite tuners can use an online module referencing the original IS 616 report. Non-compliant models will be removed from licenses after 26 October 2025, potentially leading to registration cancellation. Manufacturers using the 2022 standard have until 30 December 2025 to declare their transition to the 2025 version to avoid regulatory action. New applications are encouraged to directly pursue IS 18112:2025.</p>\n\n<p>After 26 October 2025, BIS will no longer grant new or expanded licenses without satellite receiver compliance. The standard mark has been simplified to include both \"IS 616 / IEC 60065\" and \"IS 18112\" with the common R-number. Customs officials, legal-metrology authorities, and e-commerce platforms have been alerted to the conjoined mark, with shipments bearing only the old IS 616 label potentially facing detention, fines, or re-export. IS 18112:2025 includes updated definitions, allows IS / IEC 62368-1 as an alternative safety standard, removes the power-consumption clause, adds testing guidance, and specifies a mute-to-unmute button on remote controls.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/bis-tightens-rules-for-digital-tv-sets-ahead-of-oct-2025.jpg"
  },
  {
    "title": "\"Typo\" No Excuse: SC Quashes Complaint After Demand Notice Claims Double the Bounced Cheque",
    "description": "<p>The Supreme Court of India in Kaveri Plastics v. Mahdoom Bawa Bahrudeen Noorul ruled that a statutory demand notice seeking an amount that differs from the dishonored cheque's value is invalid, thus rendering a subsequent criminal complaint under Section 138 of the Negotiable Instruments Act, 1881, non-maintainable. The court emphasized a strict and technical interpretation of the law.</p>\n\n<p>The case arose from a dishonored cheque for Rs. 1,00,00,000/- issued by Kaveri Plastics to Mahdoom Bawa Bahrudeen Noorul. The subsequent demand notices incorrectly demanded Rs. 2,00,00,000/-, leading to the respondent's petition to quash the criminal complaint, which was ultimately upheld by the High Court. The Supreme Court addressed whether a demand notice survives when the amount claimed differs numerically from the dishonored cheque, even if the discrepancy is claimed to be inadvertent.</p>\n\n<p>The Supreme Court upheld the High Court's decision, asserting the necessity of a precise demand for \"the said amount of money\" as stipulated in Proviso (b) to Section 138. While a notice may include additional claims, the demand for the cheque amount must be accurate. The court found that demanding an inflated amount invalidated the notice and the associated complaint. The ruling reaffirms that meticulous adherence to the law is required for criminal prosecutions related to cheque dishonor, placing the onus on the complainant to ensure the demand notice is accurate, thereby providing the drawer with a clear and honest opportunity to settle the debt.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/sc-wrong-amount-in-demand-notice-invalidates-complaint.jpg"
  },
  {
    "title": "Supreme Court on Medical Negligence: NCDRC Cannot Create a New Case Beyond Pleadings",
    "description": "<p>The Supreme Court of India, in Deep Nursing Home and Another v. Manmeet Singh Mattewal and Others, clarified that adjudicatory forums cannot exceed the pleadings of the parties and invent a new case. The ruling emphasizes judicial discipline and clarifies the scope of liability in medical negligence cases. The court overturned the findings of the State Consumer Disputes Redressal Commission (SCDRC) and the National Consumer Disputes Redressal Commission (NCDRC), which had held doctors and a nursing home liable.</p>\n\n<p>The case originated from the death of Charanpreet Kaur and her newborn child during delivery at Deep Nursing Home. The complainant, Manmeet Singh Mattewal, alleged negligence in post-delivery care due to inadequate equipment and delayed blood arrangement, seeking substantial compensation. The SCDRC found Deep Nursing Home and Dr. Kanwarjit Kochhar negligent in post-delivery management and awarded compensation.</p>\n\n<p>On appeal, the NCDRC shifted the liability entirely to Dr. Kochhar, finding him negligent in antenatal management for not prescribing certain tests, despite acknowledging no negligence in delivery or post-delivery care. The Supreme Court found that the NCDRC overstepped its jurisdiction by creating a new case of antenatal negligence, which was not part of the original complaint. The Court cited previous rulings, emphasizing that decisions must be based on pleaded grounds and parties cannot be taken by surprise.</p>\n\n<p>Ultimately, the Supreme Court allowed the appeal, dismissing the complaint and directing Manmeet Singh Mattewal to refund ₹10,00,000/- received during the litigation, to be paid to New India Assurance Company and the doctors involved. The judgment underscores the importance of adhering to pleadings and expert medical opinions in consumer cases.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/sc-ncdrc-cannot-go-beyond-pleadings-in-med-negligence.jpg"
  },
  {
    "title": "Gauhati High Court Upholds Right to Free Books and Uniforms under the RTE Act",
    "description": "<p>The Gauhati High Court, in Master Rehan Barai & Anr. v. State of Assam & Ors., reaffirmed the Right of Children to Free and Compulsory Education Act, 2009 (RTE Act), directing that children admitted under Section 12(1)(c) are entitled to free textbooks and uniforms, in addition to free admission. This ruling stemmed from a case where children were denied regular classes due to their parents' inability to pay for these materials, despite being admitted under the RTE Act.</p>\n\n<p>The school authorities agreed to provide the books and uniforms, with the understanding that the State Government would reimburse the costs under Section 12(2) of the RTE Act. The Court referenced precedents, including the Supreme Court's ruling in Society for Unaided Private Schools of Rajasthan v. Union of India, which upheld the validity of Section 12(1)(c) and emphasized the State's duty to ensure universal elementary education.</p>\n\n<p>Justice Kaushik Goswami directed the school to provide the necessary materials and further ordered that remedial classes be arranged to help the children catch up with their peers, given the classes they had missed. This decision reinforces the substantive nature of the right to education, ensuring that children are equipped with the tools necessary for meaningful participation. The judgment underscores the importance of accountability for private schools operating under the RTE mandate and the State's role in timely reimbursement and strict compliance monitoring to ensure genuinely free and accessible education for all children.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/gauhati-hc-free-books-uniforms-under-rte-a-right.jpg"
  },
  {
    "title": "Inter-operable Regulatory Sandbox (IoRS): A New Era of Cross-Sectoral FinTech Innovation",
    "description": "<p>India has launched the Inter-operable Regulatory Sandbox (IoRS) to foster innovation in the financial sector. This unified framework allows innovators to test hybrid financial products and services that span multiple regulatory domains through a single-window environment, streamlining compliance and accelerating innovation. This eliminates the need for separate engagements with individual regulators.</p>\n\n<p>The IoRS was conceived by the Inter-Regulatory Technical Group on FinTech (IRTG on FinTech) and the Financial Stability and Development Council. It represents a collaborative effort between financial sector regulators and key government stakeholders. The initiative establishes a framework involving a Principal Regulator (PR) and Associate Regulators (ARs), based on the dominant feature of the product being tested. Applications are submitted through the RBI FinTech Department for preliminary review.</p>\n\n<p>The IoRS is open to a broad range of participants, including financial institutions, FinTech companies, and startups. Foreign FinTechs entering India and Indian FinTechs with global ambitions can also participate. Applications are accepted on-tap, and following successful testing, entities must obtain necessary approvals before commercial launch. The IoRS signifies a paradigm shift by providing a coordinated regulatory oversight, thereby setting the stage for the next phase of India’s FinTech growth, aligning with global best practices.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/india-launches-iors-cross-sector-fintech-sandbox.jpg"
  },
  {
    "title": "Pending Section 37 Appeal Without Stay Does Not Justify Deferring Execution: Supreme Court Order in Chakardhari Sureka v. Prem Lata Sureka",
    "description": "<p>The Supreme Court of India, in a recent order in Chakardhari Sureka v. Prem Lata Sureka, addressed the executability of an arbitral award when a Section 37 appeal is pending but no stay order has been issued. The court clarified that the mere pendency of a Section 37 appeal does not justify an executing court in adjourning execution proceedings after a Section 34 application has been dismissed and no stay on the award has been granted.</p>\n\n<p>The case arose after an arbitral award was granted to Chakardhari Sureka. Prem Lata Sureka's objection under Section 34 was rejected by the Delhi High Court. Subsequently, a Section 37 appeal was filed, but no interim stay order was passed against the award. The Execution Court then adjourned the hearing on the grounds that the appeal was pending, prompting the appeal to the Supreme Court.</p>\n\n<p>The Supreme Court acknowledged the disagreement between parties regarding the award's resistance during execution, but emphasized that the absence of an interim stay order allows the execution court to proceed. While the Execution Court can examine objections to executability, it cannot defer the execution solely because a Section 37 appeal is pending without a stay.</p>\n\n<p>The Supreme Court disposed of the appeal, clarifying that the Execution Court is free to proceed with the execution of the award, subject to any future interim order passed in the Section 37 appeal. Any objections to executability should be addressed in accordance with the law, providing both parties with an opportunity to be heard. The order reaffirms that dismissal of a Section 34 application without a stay in the Section 37 proceeding renders the award enforceable, and the executing court cannot delay execution based solely on the pending appeal.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/sc-no-stay-in-sec-37-appeal-execution-can-proceed.jpg"
  },
  {
    "title": "Rule 33 as a Regulatory Shock-Absorber: Legal Metrology’s Answer to Sudden GST Rate Shifts",
    "description": "<p>A sudden shift in GST rates can create challenges for manufacturers of pre-packaged goods due to the Legal Metrology (Packaged Commodities) Rules, 2011, which typically treat the printed retail sale price as fixed. To address this, the Ministry of Consumer Affairs invoked Rule 33, a rarely-used provision allowing for the relaxation of the Rules, to permit a transparent and time-bound repricing of existing stock. This action serves as a vital link between fiscal policy adjustments and consumer protection regulations.</p>\n\n<p>Rule 33, anchored in the Legal Metrology Act, 2009, and the Constitution, allows the Central Government to relax provisions of the Packaged Commodities Rules. It is crucial because Section 18(2) of the Act criminalizes selling above the declared MRP. The relaxation order provides protection against unintended prosecutions as the market adapts to the revised GST rates.</p>\n\n<p>The allowance is limited to pre-packaged goods manufactured, packed, or imported before the GST rate change and unsold at the time of notification. Manufacturers have until December 31, 2025, or until stock depletion, to resticker units with revised MRPs while keeping the original price visible for consumer verification.</p>\n\n<p>Transparency and accountability are reinforced through mandatory publicity. Companies must publish newspaper advertisements and notify stockists, retailers, and relevant Legal Metrology authorities before distributing restickered units.</p>\n\n<p>The circular also addresses the issue of surplus packaging with old MRPs, allowing their continued use until December 31, 2025, provided the revised MRP is clearly superimposed while maintaining the original price's legibility. This concession reduces environmental impact and protects working capital, while ensuring accurate pricing.</p>\n\n<p>The Department of Legal Metrology has refined Rule 33 into a precise regulatory tool. By linking price revisions to the exact tax differential, mandating dual price display, requiring public notice, and preserving prosecution rights, the Ministry has showcased how flexible use of subordinate legislation can balance legal requirements with business needs, while safeguarding consumer interests. This highlights responsive governance where laws adapt to prevent disruption, all while protecting the consumer.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/rule-33-legal-metrologys-fix-for-sudden-gst-rate-hikes.jpg"
  },
  {
    "title": "Spice Crackdown: FSSAI’s October 2025 Manufacturing Sweep Explained",
    "description": "<p>In response to findings of widespread adulteration in spice samples collected nationwide between November 2024 and February 2025, the Food Safety and Standards Authority of India (FSSAI) will conduct a concentrated enforcement drive in October 2025. This initiative, authorized under the Food Safety and Standards Act of 2006, targets manufacturing units producing thirteen specified spices to address issues such as excess lead, illegal coloring, and misleading labels.</p>\n\n<p>Throughout October, teams will inspect spice-grinding mills, cleaning plants, and other relevant facilities, collecting samples for analysis at NABL-accredited labs. These samples will be tested for various contaminants, including pesticide residues, aflatoxins, heavy metals, and extraneous color, with results promptly uploaded to the FoSCoS portal for real-time monitoring. The focus is exclusively on manufacturing units, recognizing that adulteration primarily occurs during grinding, blending, and re-packing processes.</p>\n\n<p>Manufacturers are expected to prepare by reviewing batch records, calibrating on-site labs, and ensuring proper labeling. Non-cooperation or closure during inspections will result in penalties, including license suspension. State food safety departments must submit comprehensive reports by November 20, 2025, detailing inspection findings and laboratory results. This initiative aims to ensure the safety and quality of spices available to consumers and emphasizes compliance as a crucial aspect of market access for manufacturers.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/fssai-spice-crackdown-october-2025-factory-inspections.jpg"
  },
  {
    "title": "Premium Price, Persistent Defects: Delhi Commission Holds Mercedes-Benz Liable",
    "description": "<p>The Delhi State Consumer Disputes Redressal Commission ruled in favor of a consumer, M/s Samaran Media Consultants Pvt. Ltd., against Mercedes-Benz India Pvt. Ltd. concerning a defective Mercedes-Benz EQS 580. The ruling underscores manufacturer accountability for delivering defect-free products, even in the premium automobile sector.</p>\n\n<p>Samaran Media Consultants Pvt. Ltd. purchased the vehicle for ₹1,55,00,000 in November 2022, but it soon experienced persistent issues, including a defective battery, malfunctioning air conditioner, and sensor failures. Despite multiple repair attempts, the problems persisted, leading the complainant to seek redressal from the Commission.</p>\n\n<p>The Commission rejected Mercedes-Benz's preliminary objections, affirming that Samaran Media Consultants was indeed a \"consumer\" under the Consumer Protection Act, 2019, as the vehicle was for the personal use of its director. It also dismissed the argument regarding territorial jurisdiction, citing the authorized dealer's presence in New Delhi and the cause of action arising within its jurisdiction. The Commission concluded that the recurring defects, despite multiple repair attempts, indicated a manufacturing defect, with offers to refund EMIs and extend the warranty viewed as tacit admissions of fault.</p>\n\n<p>As remedy, Mercedes-Benz India Pvt. Ltd. was ordered to refund the purchase price of ₹1,60,09,614.26, loan interest, prepayment charges, and to pay interest on the total amount at 6% per annum from the purchase date until the judgment date, in addition to ₹5,00,000 for mental agony and ₹50,000 for litigation costs. Failure to pay by October 11, 2025, would result in a 9% interest rate from the purchase date. The defective vehicle is to be taken over by Mercedes-Benz India Pvt. Ltd. following the refund. The judgment confirms that a company can be a \"consumer\" for products purchased for personal use, statutory rights override contractual clauses limiting jurisdiction, and manufacturers bear responsibility for persistent defects, even in premium brands. It reinforces that goodwill gestures cannot substitute for a consumer's right to a functional product and strengthens the Consumer Protection Act, 2019.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/delhi-commission-orders-refund-in-mercedes-benz-defect-case.jpg"
  },
  {
    "title": "Supreme Court Closes Gaps in Anand Marriage Act, Orders Uniform Rules Across States",
    "description": "<p>The Supreme Court of India has delivered a significant judgment in Amanjot Singh Chadha v. Union of India & Ors., addressing the delayed operationalization of the Anand Marriage Act, 1909, as amended in 2012. The Court directed all States and Union Territories to frame rules for registering Sikh marriages solemnized through the Anand Karaj ceremony within six months. Until these rules are notified, interim arrangements must be implemented to ensure non-discriminatory registration.</p>\n\n<p>This ruling resolves inconsistencies arising from the failure of several states to notify rules under Section 6 of the amended Act, which mandated provisions for marriage registration. The absence of uniform registration processes left Sikh couples without reliable marriage certificates, essential for various legal and civil matters.</p>\n\n<p>The Court's decision, made in response to a petition filed under Article 32 of the Constitution, emphasizes equal access to civil entitlements for Sikh couples. The Court directed states to enable registration based on existing marriage rules where possible. The Court issued special directions for Goa and Sikkim, addressing the unique administrative and constitutional frameworks in those states by calling for the extension of the Act to those regions.</p>\n\n<p>The judgment ensures nationwide uniformity in marriage certification, strengthens protections for women and children, and reinforces the principle that statutory mandates must be effectively implemented. It underscores the Court’s commitment to constitutional equality, ensuring that faith does not impede access to civil rights.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/sc-orders-uniform-rules-for-anand-marriage-act.jpg"
  },
  {
    "title": "No Partition Rights for Grandsons While Father is Alive, Rules Delhi High Court",
    "description": "<p>The Delhi High Court, in Amit Sethi v. Lalit Sethi & Ors., reaffirmed the legal position on intestate succession under the Hindu Succession Act, 1956 (HSA), ruling that a grandson does not acquire a birthright in his grandfather's property while his father is alive. The court dismissed a partition suit filed by a grandson concerning property in Kalkaji, New Delhi, emphasizing the transformative impact of Section 8 of the HSA, which eliminates pre-1956 coparcenary and survivorship concepts.</p>\n\n<p>The dispute originated from conflicting claims over a property originally acquired by the plaintiff's grandfather. The plaintiff asserted an oral family partition in 1986 resulted in his father and uncle jointly owning the property, entitling him to a share by birth. The defendants countered that the 1986 arrangement vested absolute ownership in the father and uncle, precluding the grandson's claim under the HSA, which prioritizes Class I heirs.</p>\n\n<p>The High Court, considering the pleadings and relevant legal provisions, found that the admitted oral partition in 1986 converted the property into the separate property of the father and uncle. Citing Section 8 of the HSA and landmark precedents, the Court reiterated that property inherited by a son after 1956 is held in an individual capacity, not as part of a coparcenary. Thus, the grandson lacked a birthright, and any cause of action would only arise upon his father's death. The Court also reinforced the use of Order VII Rule 11 CPC to prevent misuse of process and save litigants from prolonged, fruitless litigation.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/no-birthright-for-grandsons-in-fathers-lifetime-delhi-hc.jpg"
  },
  {
    "title": "Does a Daughter’s Marriage Expense Justify Alienation of Joint Family Property?",
    "description": "<p>The Supreme Court of India, in Dastagirsab v. Sharanappa, reaffirmed the established principles governing the power of a Karta (manager) to alienate Hindu Undivided Family (HUF) property. The ruling emphasizes legal necessity, the evidentiary burden on purchasers, and the binding nature of such transactions on coparceners (family members with inheritance rights).</p>\n\n<p>The case involved a dispute over land sold by a Karta, Sharanappa, purportedly to cover the marriage expenses of his daughter, Kashibai. A coparcener challenged the sale, claiming it lacked consideration and legal necessity, alleging the Karta's alcohol addiction and extravagance. The purchaser defended the sale, presenting receipts and revenue records to demonstrate consideration and transfer of title.</p>\n\n<p>The Supreme Court's ruling reinforces that alienations by a Karta for genuine legal necessity bind the entire family, safeguarding coparcenary rights while ensuring transaction stability. While recognizing a daughter's marriage expenses as a valid legal necessity, the ruling should not be interpreted as endorsing or imposing a financial obligation on fathers for daughters' marriages. The judgment focuses on clarifying \"legal necessity\" within Hindu coparcenary law and should not legitimize regressive expectations regarding marriage expenditure.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/daughters-marriage-expenses-as-legal-necessity-in-huf.jpg"
  },
  {
    "title": "Supreme Court Clarifies Arbitrator’s Power to Award Pendente Lite Interest in ONGC v. G&T Beckfield Drilling",
    "description": "<p>The Supreme Court's decision in Oil and Natural Gas Corporation Ltd. v. G&T Beckfield Drilling Services Pvt. Ltd. clarifies the scope of an arbitral tribunal's power to award pendente lite interest. The Court held that a general contractual clause prohibiting interest on delayed or disputed payments does not automatically preclude an arbitral tribunal from awarding interest during the pendency of arbitration proceedings. This ruling balances contractual freedom with the need for equitable compensation in commercial disputes.</p>\n\n<p>The case stemmed from a contractual dispute between ONGC and G&T Beckfield Drilling Services Pvt. Ltd. regarding unpaid invoices. The arbitral tribunal awarded G&T Beckfield Drilling interest from the date of claim filing. ONGC challenged the award, arguing that Clause 18.1 of the contract expressly forbade such interest. The Supreme Court dismissed ONGC's appeal, asserting that Clause 18.1 only restricted interest on delayed payments during the contract's operational phase and did not restrict the tribunal's discretion to award pendente lite interest.</p>\n\n<p>The Court emphasized the distinction between clauses specifically prohibiting interest \"in any respect whatsoever\" versus those merely barring interest on delayed invoices. The judgment reinforces that arbitral discretion to grant interest is preserved unless expressly excluded by the contract. This decision promotes commercial certainty by requiring precise contract drafting to exclude pendente lite interest, and it ensures fairness by preventing unjust enrichment resulting from prolonged payment delays. This pronouncement serves as a key guideline for arbitral tribunals, courts, and contracting parties.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/sc-clarifies-arbitrators-power-on-pendente-lite-interest.jpg"
  },
  {
    "title": "Greater Bengaluru Governance (Registration of Electors) Rules, 2025: A Walk-Through",
    "description": "<p>The Karnataka government has enacted the Greater Bengaluru Governance (Registration of Electors) Rules, 2025, to establish a comprehensive system for creating and maintaining accurate voter rolls for Bengaluru's city-corporation wards. These rules address the long-standing issue of using outdated assembly constituency voter lists for civic elections.</p>\n\n<p>The rules outline the definitions and terminology used, aligning with the Greater Bengaluru Governance Act of 2024 and the Representation of the People Act, 1950. Instead of creating rolls from scratch, the commission can adopt the current legislative-assembly roll, while pruning, adding or transposing entries. The roll is frozen once the last date for filing nominations is notified, preventing manipulation.</p>\n\n<p>The process involves enumerators collecting data from residents using Form-2, and the Registration Officer having access to birth, death, and school records to prevent fraudulent registrations. A draft roll is then published for public review, and citizens can submit claims, objections, or corrections using specific forms (Forms 4-8). These forms can be submitted in person, by post, or through an online portal.</p>\n\n<p>Designated officers process applications, and the Registration Officer reviews them, potentially holding hearings to resolve disputes. Supplementary lists for omissions and deletion lists for deceased or moved individuals can be created, subject to objections and hearings. The final roll, with amendment lists, is published, and two free copies are provided to recognized national and state parties.</p>\n\n<p>Aggrieved electors can appeal decisions to an officer designated by the State Election Commission within fifteen days. Rolls are revised annually through either intensive or summary revisions. Outside of the revision cycle, electors can seek corrections or inclusions at any time. The Commission can also order photo-identity cards to reduce impersonation.</p>\n\n<p>Post-election, rolls and related documents are preserved for a specified period. The Commission has the option to adopt the current legislative-assembly roll, ward-bounded and cleansed, for city-corporation elections. Officers involved in the process are considered on deputation to the State Election Commission and are subject to disciplinary action for breaches of duty. The rules aim to translate the promise of universal adult franchise into a tangible process, empowering residents and shaping local democracy in Bengaluru.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/greater-bengaluru-governance-rules-2025-voter-roll-guide.jpg"
  },
  {
    "title": "Allahabad High Court Upholds Pollution Control Board’s Power to Levy Environmental Compensation",
    "description": "<p>The Allahabad High Court has affirmed the authority of Pollution Control Boards to levy environmental compensation, reinforcing the \"Polluter Pays\" principle. The ruling in M/s Ramesh Dyeing and Washing, Ghaziabad v. State of U.P. & Ors. upheld the U.P. Pollution Control Board's power to issue closure orders and impose financial penalties for environmental damage.</p>\n\n<p>The case originated when the U.P. Pollution Control Board ordered the closure of the petitioner's industrial unit and imposed a fine of ₹14,20,000. The petitioner challenged the Board's authority, arguing that only the National Green Tribunal (NGT) could impose such a fine. The court rejected this argument, citing the Supreme Court’s ruling in Delhi Pollution Control Committee v. Lodhi Property Company Ltd., which confirmed that Pollution Control Boards possess the power to impose compensatory damages under Section 33A of the Water Act, 1974, and Section 31A of the Air Act, 1981.</p>\n\n<p>The High Court clarified that these powers are incidental to the Boards' statutory mandate and are remedial, not punitive, in nature. While acknowledging its jurisdiction under Article 226, the court declined to exercise it due to the petitioner's failure to exhaust the appeal process under the NGT Act and an unexplained delay in filing the petition. The judgment solidifies the regulatory power of Pollution Control Boards and emphasizes the importance of industries internalizing environmental accountability.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/allahabad-hc-upholds-environmental-compensation-power.jpg"
  },
  {
    "title": "NCLAT Upholds Liquidation of E.C. Bose & Company Pvt. Ltd., Rejecting Suspended Director's Settlement Offer",
    "description": "<p>The National Company Law Appellate Tribunal (NCLAT) has affirmed the National Company Law Tribunal's (NCLT) order for the liquidation of E.C. Bose & Company Pvt. Ltd., a corporate debtor undergoing insolvency proceedings. The appeal, filed by the company's suspended director, Deborshi Sadhan Bose, challenged the NCLT's decision to initiate liquidation after the 330-day Corporate Insolvency Resolution Process (CIRP) period expired without an approved resolution plan.</p>\n\n<p>The appellant argued before the NCLAT that a higher settlement offer of ₹8 crore had been received after the Committee of Creditors (CoC) decided to pursue liquidation. However, the NCLAT noted that the offer was made well after the CIRP period had concluded and the CoC had already resolved to liquidate the company.</p>\n\n<p>The NCLAT distinguished this case from previous instances where higher offers from resolution applicants during the CIRP period or settlement proposals under Section 12A of the Insolvency and Bankruptcy Code (IBC) were considered. Ultimately, the NCLAT found no grounds to interfere with the NCLT's decision, emphasizing the importance of adhering to the timelines prescribed under the IBC. The appeal was subsequently dismissed, upholding the liquidation order.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/nclat-upholds-e-c-bose-liquidation-rejects-settlement.jpg"
  },
  {
    "title": "SEBI Streamlines Compliance for FPIs Investing Exclusively in Government Securities",
    "description": "<p>SEBI issued a circular on September 10, 2025, introducing a simplified compliance framework for Foreign Portfolio Investors (FPIs) investing solely in Government Securities under the Fully Accessible Route (FAR), termed \"GS-FPIs.\" Effective February 8, 2026, this framework aims to encourage stable foreign investment in India's sovereign debt market by reducing registration and reporting requirements, aligning KYC obligations with banking norms, and clarifying transition processes between regular FPIs and GS-FPIs.</p>\n\n<p>Key changes include the removal of the obligation for GS-FPIs to disclose investor-group details at registration, acknowledging the low-risk profile of government securities investments. The circular clarifies that resident Indian contributions to GS-FPIs must be made exclusively under the RBI’s Liberalised Remittance Scheme (LRS) with restricted Indian securities exposure. Furthermore, GS-FPIs are relieved from filing \"no-change\" declarations and reporting non-material changes during renewal, with only the payment of fees required, while material changes must still be reported. Custodian KYC review cycles are aligned with RBI guidelines for FPI bank accounts, enhancing operational efficiency.</p>\n\n<p>The circular also establishes a clear process for new applicants to register as GS-FPIs and for existing FPIs to transition to GS-FPI status by divesting non-government securities. Conversely, GS-FPIs opting to operate as regular FPIs must fulfill all additional disclosure requirements. Issued under Section 11(1) of the SEBI Act, 1992, and linked to the RBI's FAR, the circular reflects a strategic move towards risk-based compliance, aiming to increase foreign demand for Indian debt and reinforce regulatory alignment.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/sebi-eases-compliance-for-fpis-in-government-securities.jpg"
  },
  {
    "title": "New TNRERA Penalties for Selling Unregistered Plots/Flats/Apartments",
    "description": "<p>The Tamil Nadu Real Estate Regulatory Authority (TNRERA) has issued Circular No. TNRERA/3867/2024, dated September 10, 2025, introducing significantly stricter penalties for selling plots, flats, or apartments before project registration, superseding a previous circular from November 2024. This action reinforces compliance with Section 3 of the Real Estate (Regulation & Development) Act, 2016.</p>\n\n<p>The new guidelines stipulate that penalties for violating Section 3 will be the highest amount calculated from three options: a fixed amount per plot/flat based on jurisdiction (ranging from ₹3,000 to ₹15,000), a percentage of the proportionate project cost (2% for plots, 1% for flats), or 2% of the total sale value of unregistered properties as reflected in the Encumbrance Certificate (EC).</p>\n\n<p>Additional penalties are applied for projects with multiple violations. A 50% increase is added to the calculated penalty if 10 to 50 properties are sold illegally, and a 100% increase applies if more than 50 such properties are sold.</p>\n\n<p>This revised penalty framework underscores TNRERA's commitment to protecting homebuyers and fostering a more transparent real estate market. Developers face significantly higher costs for non-compliance, emphasizing the importance of timely registration. Homebuyers benefit from increased security and should verify TNRERA registration before purchasing property.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/new-tnrera-penalties-for-sale-before-registration.jpg"
  },
  {
    "title": "Karnataka RERA Issues New Directive on Mandatory Annual Audits",
    "description": "<p>Karnataka RERA has issued a circular mandating strict compliance with annual audit requirements for all promoters, reinforcing financial transparency in the real estate sector. This directive, in accordance with Section 4(2)(l)(D) of the RERA Act 2016, requires promoters to have their accounts audited within six months of the financial year-end by a practicing chartered accountant, ensuring funds are used solely for the designated project and withdrawals are proportionate to project completion.</p>\n\n<p>The circular mandates the submission of Form-7 (Annual Audit Report) for the financial year 2024-25 through a dedicated online module on the K-RERA web portal. Promoters must also submit audited financial statements, including the profit and loss account, balance sheet, cash flow statements, income tax returns, and the auditor’s report, by 15 November 2025.</p>\n\n<p>K-RERA emphasizes that this annual audit is a statutory compliance measure, and failure to adhere to the requirements may result in regulatory action. A helpdesk mechanism is available to assist promoters with any technical issues, demonstrating the authority's commitment to facilitating compliance. This regulatory framework aims to safeguard homebuyers' funds, instill confidence in the real estate market, and align promoters’ responsibilities with the objectives of RERA through efficient digital filing and enhanced transparency.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/karnataka-rera-mandates-annual-audit-filing-for-2024-25.jpg"
  },
  {
    "title": "ITAT Chennai Rules Minor’s Share in Inherited Property Cannot Be Taxed in Guardian’s Hands",
    "description": "<p>The Income Tax Appellate Tribunal (ITAT), Chennai, in Pradeep Jeyavelu v. Income Tax Officer, ruled that a minor's share of inherited property, deposited under court direction, cannot be clubbed with the guardian's income for capital gains tax purposes. This decision balances the Income Tax Act, 1961, with the Hindu Minority and Guardianship Act, 1956, safeguarding minors’ rights and preventing undue tax burdens on guardians.</p>\n\n<p>The case involved the sale of property inherited by the assessee and his minor daughter. The court approved the sale, stipulating that the minor's share be deposited in a nationalized bank under judicial custody. While the assessee paid taxes on his share of the capital gains, the Assessing Officer sought to club the minor's share with his income. The ITAT ruled against this, stating that since the assessee had no control over the minor's share, the clubbing provisions of Section 64(1A) of the Income Tax Act, 1961, did not apply.</p>\n\n<p>The Tribunal emphasized that taxability hinges on ownership and control of income, not merely the occurrence of a transfer. It also accepted the assessee’s claim for brokerage expenses as a customary cost. The ruling clarifies that clubbing provisions are inapplicable when a guardian lacks control over a minor's assets protected by court orders. This provides practical relief for taxpayers in succession cases involving minors, ensuring fair tax administration and the protection of vulnerable stakeholders.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/itat-rules-minors-inherited-property-not-clubbed-for-tax.jpg"
  },
  {
    "title": "Deepfakes, AI, and the Law: Protecting Celebrity Personality Rights in India",
    "description": "<p>India's legal framework for protecting the personality rights of public figures is evolving through judicial interpretation of existing laws and constitutional principles. These rights are rooted in the right to privacy, with the right of publicity recognized as a proprietary right that allows celebrities to control and monetize their persona. The right to privacy, constitutionally backed by Article 21, protects individuals from unwanted exposure and misrepresentation, which has been reinforced in digital safety rulings such as the Madras High Court’s 2025 judgment in X v. Union of India.</p>\n\n<p>Legal safeguards include the Copyright Act, 1957 (moral rights for performers), the Trademarks Act, 1999 (protection of names and catchphrases), and the common law tort of \"passing off,\" which prevents misleading endorsements. The judiciary grants injunctions to prevent unfair exploitation, and intermediary liability under the IT Act, 2000 and the IT Rules, 2021 mandates expedited notice-and-takedown mechanisms.</p>\n\n<p>Recent Delhi High Court interim orders, particularly in Aishwarya Rai Bachchan v. Aishwaryaworld.com & Ors. and Abhishek Bachchan v. The Bollywood Tee Shop & Ors., address challenges from AI and deepfake technology. These cases involved unauthorized use of the Bachchans' personas, including the sale of merchandise, fake websites, and AI-generated content. The court issued injunctions requiring platforms to remove infringing content, emphasizing the financial and reputational harm caused by unauthorized use.</p>\n\n<p>These rulings reaffirm the judiciary's commitment to protecting individual dignity against technological threats. They signify a shift where personality rights are viewed as integral to dignity, privacy, and autonomy, not just economic entitlements. With increasing AI-driven misuse, legislative codification of personality rights in India is becoming essential.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/deepfakes-ai-law-protecting-celebrity-rights-india.jpg"
  },
  {
    "title": "Supreme Court Upholds Testamentary Succession Over State Escheat Claims",
    "description": "<p>The Supreme Court of India, in State of Rajasthan v. Ajit Singh & Ors., has reinforced the primacy of testamentary succession, clarifying that the doctrine of escheat under Section 29 of the Hindu Succession Act, 1956, is applicable only when an individual dies intestate without legal heirs. The Court affirmed that a validly executed and probated Will dictates the devolution of property, precluding the State's intervention based on escheat claims.</p>\n\n<p>The case originated from the estate of Raja Bahadur Sardar Singh, who created the Khetri Trust via a Will and Codicil prior to his death in 1987. While the initial probate petition was dismissed, the Division Bench of the Delhi High Court later overturned this decision, upholding the Will's validity. The State of Rajasthan appealed, asserting its right to the property based on the claim that the testator died without heirs.</p>\n\n<p>The Supreme Court dismissed the State's challenge, emphasizing that the State lacks the standing to contest a validly executed Will. The ruling underscores the significance of adhering to the testator’s intent and reinforces the limits of governmental intervention in succession matters. The Court's decision reaffirms the principle that escheat is a remedy of last resort, applicable only in the absence of both a Will and legal heirs. This ruling strengthens the legal position of trusts and legatees, and enhances certainty in succession law.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/sc-rules-valid-will-overrides-states-escheat-claims.jpg"
  }
]