[
  {
    "title": "Streamlining Insolvency Professional Appointments: The IBBI’s 2025 Guidelines for Insolvency Professionals",
    "description": "<p>The Insolvency and Bankruptcy Board of India (IBBI) has issued the \"Insolvency Professionals to act as Interim Resolution Professionals, Liquidators, Resolution Professionals and Bankruptcy Trustees (Recommendation) Guidelines, 2025,\" effective from July 1, 2025, to December 31, 2025. These guidelines aim to streamline the appointment process of Insolvency Professionals (IPs) by the National Company Law Tribunal (NCLT) and Debt Recovery Tribunal (DRT) in corporate and individual insolvency cases, ensuring a more efficient and transparent procedure.</p>\n\n<p>These guidelines, issued under various sections of the Insolvency and Bankruptcy Code, 2016 (IBC) and related rules, establish stringent eligibility criteria for IPs to be included in the panel. IPs must not have pending disciplinary proceedings or recent convictions, and they must submit an expression of interest in Form A by June 22, 2025, along with their consent and sector-specific experience. A common panel of IPs will be prepared and shared with the Adjudicating Authority, valid for six months, and organized zone-wise and bench-wise.</p>\n\n<p>The panel's sorting criteria prioritize IPs based on the volume of their ongoing liquidation and corporate insolvency resolution assignments, with registration date serving as a tie-breaker. Selected IPs are expected to accept appointments unless otherwise permitted, and unjustified refusal will lead to removal from the panel. IPs must also maintain their registration and membership during the panel’s validity. These new guidelines replace the 2024 guidelines and aim to enhance the effectiveness of the IBC by ensuring qualified IP appointments.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/ibbi-2025-guidelines-insolvency-professional.jpg"
  },
  {
    "title": "FSSAI Issues Guidelines for Acceptance of Recycled PET as Food Contact Material",
    "description": "<p>On May 23, 2025, the Food Safety and Standards Authority of India (FSSAI) issued guidelines for the acceptance of recycled Polyethylene Terephthalate (PET) as Food Contact Material (FCM-rPET). These guidelines, issued under the Food Safety and Standards (Packaging) Regulations, 2018, establish stringent safety and quality standards for recycled PET used in food packaging, covering the recycling process from post-consumer PET to FCM-rPET, focusing on technologies approved by FSSAI and excluding non-food grade consumer applications.</p>\n\n<p>The notification provides key definitions, including those for \"Food Authority,\" \"manufacturer,\" and the types of materials covered (vPET, Post-Consumer Food Grade PET, PET Resin, and FCM-rPET). It mandates rigorous testing procedures such as Challenge, Extraction, and Migration Tests, all to be conducted in NABL/ILAC accredited labs in compliance with specified Indian Standards.</p>\n\n<p>Detailed process requirements ensure the purity and safety of recycled PET, specifying minimum quality standards, process validation criteria based on challenge test results (decontamination level below 220 µg/kg in the resin or below 10 µg/kg in food simulant), and continuous monitoring programs. Stringent acceptance criteria for FCM-rPET resin require adherence to specified decontamination levels and validation tests, and marking/labeling guidelines mandate the use of a specific symbol (FCM-rPET-X, indicating percentage of recycled resin) along with information about the recycled content.</p>\n\n<p>Manufacturers of FCM-rPET, converters, beverage bottlers, food packers, and Food Business Operators (FBOs) must maintain specified documentation, including a Declaration of Compliance, Regulatory Opinion, and supply chain records. Manufacturers must apply for authorization using Form I, subject to annual audits. The FSSAI will authorize or reject applications based on assessment (Form II), register authorized manufacturers on the FSSAI website, and retains the right to request information from manufacturers. Conditions for authorization include the right of the Food Authority to inspect facilities and records, compliance with FSSAI regulations, and the maintenance of all specified documents and test reports.</p>\n\n<p>In conclusion, the FSSAI's notification aims to safeguard public health and promote sustainability by establishing a comprehensive framework for the safe use of recycled PET in food packaging, ensuring that it meets the highest standards of safety and quality.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/fssai-recycle-pet-food-contact-material.jpg"
  },
  {
    "title": "India Imposes Ban on Import and Transit of Goods from Pakistan",
    "description": "<p>On May 2nd, 2025, India's Directorate General of Foreign Trade (DGFT), under the Ministry of Commerce and Industry, issued Notification 06/2025-26, effectively banning the import and transit of all goods originating in or exported from Pakistan. This action, implemented immediately, is based on Paragraph 2.20A of the Foreign Trade Policy (FTP) 2023, and published in the Gazette of India.</p>\n\n<p>The decision leverages Section 3 and 5 of the Foreign Trade (Development & Regulation) Act, 1992, along with Paragraphs 1.02 and 2.01 of the FTP 2023, empowering the government to regulate trade activities that could threaten national interests. The prohibition applies comprehensively to all goods, regardless of existing import regulations. Exceptions are possible but require prior approval from the Indian government.</p>\n\n<p>This ban signifies a major shift in India-Pakistan trade relations and is expected to have broad economic implications. Businesses reliant on imports from Pakistan will need to find alternative sources. The move underscores the Indian government's commitment to prioritizing national security and public policy and will likely prompt a reassessment of trade strategies.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/india-ban-import-transit-goods-pakistan.jpg"
  },
  {
    "title": "High Court of Punjab and Haryana: Proportionality in Punishment is Key in Disciplinary Actions",
    "description": "<p>The High Court of Punjab and Haryana at Chandigarh has ruled on the case of Satyaveer Singh vs State of Haryana, emphasizing the importance of proportionality in disciplinary actions. The court reviewed the punishment of a police officer who was penalized for a single day's absence from duty.</p>\n\n<p>The petitioner, Satyaveer Singh, was initially dismissed from the Haryana Police Force for being absent from duty for 24 hours and 20 minutes. This dismissal was later reduced to forfeiture of 10 annual increments, a decision upheld by the Director General of Police, Haryana. Singh then filed a writ petition arguing that the punishment was disproportionate to the offense.</p>\n\n<p>The court, referencing Rule 16.2 of the Punjab Police Rules, 1934, and Supreme Court judgments such as Om Kumar v. Union of India and Bhagat Ram v. State of Himachal Pradesh, underscored the principle of proportionality and Article 14 of the Constitution of India. The court determined that the forfeiture of 10 annual increments was indeed disproportionate to a single day's absence.</p>\n\n<p>Considering the time elapsed and to prevent further litigation, the High Court reduced the punishment to forfeiture of one increment with cumulative effect. The petition was disposed of accordingly, reaffirming the court's dedication to ensuring that punishments are commensurate with the offenses committed.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/high-court-of-punjab-and-haryana-proportionality-in-punishment-is-key-in-disciplinary-actions.jpg"
  },
  {
    "title": "Karnataka Enacts Groundbreaking Ordinance For Gig Worker Welfare",
    "description": "<p>The Karnataka Platform Based Gig Workers (Social Security and Welfare) Ordinance, 2025, represents a pioneering policy initiative by the Government of Karnataka to regulate the gig economy. This ordinance establishes a legal framework to protect the rights of platform-based gig workers, delineate the obligations of digital platforms and aggregators, and ensure the provision of social security and welfare benefits within the state. It applies to all aggregators and platforms offering services listed in the ordinance's Schedule, as well as registered gig workers.</p>\n\n<p>The ordinance defines key concepts such as gig workers, platforms, and aggregators. Social security encompasses benefits like healthcare and income support during unemployment, old age, illness, maternity, or disability. A welfare fee, ranging from 1% to 5% of a worker's payout, is levied on platforms to fund these entitlements. A dedicated Karnataka Platform Based Gig Workers Welfare Board, comprising government officials, worker representatives, aggregator representatives, and experts, will be established to administer the ordinance.</p>\n\n<p>Platforms are required to register with the Board, maintain updated worker databases, and offer fair contracts with transparent terms. They must also ensure that automated monitoring systems are non-discriminatory and provide workers with information on how algorithms impact assignments and earnings. A designated human point of contact must be available for worker queries.</p>\n\n<p>A Karnataka Gig Workers Social Security and Welfare Fund will be managed by the Board, financed through welfare fees, voluntary contributions, and government grants. Financial transactions will be audited annually, and a Payment and Welfare Fee Verification System (PWFVS) will monitor payouts. Non-compliance will result in penalties, and the State Government is authorized to issue rules for enforcement.</p>\n\n<p>The ordinance marks a significant moment in India's digital economy. As the first of its kind in India, it recognizes gig workers as a distinct category of labour entitled to social protection, setting a potential precedent for other states and the central government.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/karnataka-groundbreaking-gig-worker.jpg"
  },
  {
    "title": "CDSCO Clarifies Permission for Imported Drugs Overprinting, Stickering, and Stamping Under Rule 104A",
    "description": "<p>The Directorate General of Health Services and the Central Drugs Standard Control Organization (CDSCO) issued an Office Memorandum on May 26, 2025, providing clarification on comprehensive permissions for importing drugs for labeling, overprinting, and stickering under Rule 104A of the Drugs and Cosmetics Rules, 1945. This follows an earlier directive from January 29, 2020, and addresses specific conditions for altering drug labels.</p>\n\n<p>The memorandum clarifies that while Rule 104A generally prohibits altering manufacturer markings on drug containers, labels, or wrappers, exceptions are permitted with the Licensing Authority's approval. The new memorandum elaborates on these permissible alterations, particularly for imported drugs requiring specific labeling.</p>\n\n<p>The clarification emphasizes that labeling, overprinting, or stickering is permitted only for imported drugs and requires importers to hold a valid manufacturing license. Licensees must possess adequate storage, ancillary areas, and labeling facilities. While a QC laboratory and QC personnel may not be required, the licensee must appoint at least one manufacturing and QA personnel to the satisfaction of the SLA (State Licensing Authority).</p>\n\n<p>The labeling process must comply with current Drugs and Cosmetics Rules, ensuring the original label remains visible, and the license number and activity performed are clearly indicated on the new label. As an example, drugs intended for CGHS (Central Government Health Scheme) supply require an overprint stating \"CGHS Supply Overprint.\" The memorandum aims to ensure regulatory compliance and facilitate the import of drugs with specific labeling requirements.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/cdsco-104a-drugs-cosmetics-rules-1945.jpg"
  },
  {
    "title": "Navigating the Roadmap for DPDP Compliance: What Companies Need to Start On",
    "description": "<p>The upcoming Digital Personal Data Protection (DPDP) Rules 2025 signify a crucial step for data privacy in India. Organizations must proactively adjust their data governance to meet these new regulations, demonstrating a commitment to data protection and fostering customer trust. This goes beyond mere compliance, offering businesses a competitive edge through robust data security and privacy practices.</p>\n\n<p>The DPDP Act emphasizes accountability, transparency, data minimization, and proactive risk management. Accountability requires organizations to be responsible for the personal data they process, while transparency mandates clear communication with data principals. Data minimization promotes collecting only necessary data, and proactive risk management involves regular assessments and corrective actions.</p>\n\n<p>To prepare for DPDP compliance, companies should first perform a thorough gap assessment to identify discrepancies between current practices and the Act's requirements, determining their obligations as data fiduciaries or processors. Immediate attention should be given to external-facing tasks, such as implementing compliant consent management practices, including obtaining clear consent for specific purposes, providing transparent notice and contact information, and ensuring easy consent withdrawal, while retaining detailed consent logs.</p>\n\n<p>Enhancing data security is critical, requiring advanced data governance measures, including robust data protection strategies and adherence to data minimization and secure processing principles. This includes implementing encryption, access controls, and regular security audits, controlling access to computer resources, monitoring data access, and ensuring continued data processing through measures like data backups. Internal tasks include comprehensive data mapping and inventory, establishing data lifecycle management practices, and appointing a Data Protection Officer (DPO), especially for Significant Data Fiduciaries (SDFs) who are required to conduct data protection impact assessments (DPIAs) and audits regularly.</p>\n\n<p>Strategic recommendations include establishing a robust incident response plan with clear roles and breach simulations, developing customizable breach notification templates for various audiences, and implementing cross-departmental collaboration and staff training. Strengthening data security infrastructure by investing in verification technologies and facilitating collaboration between government agencies and private entities is also crucial.</p>\n\n<p>In conclusion, while the finalization of the DPDP Rules 2025 may take time, proactive compliance, beyond simply meeting legal requirements, can help organizations avoid penalties, foster trust, and gain a competitive advantage. This journey requires a structured approach, continuous improvement, and vigilance in adapting to the evolving regulatory environment to ensure the protection of personal data and the rights of data principals.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/dpdp-compliance-companies-need-start-on.jpg"
  },
  {
    "title": "CCPA Issues Guidelines to Regulate Radio Equipment Sales on E-Commerce Platforms",
    "description": "<p>The Central Consumer Protection Authority (CCPA) has introduced new guidelines, \"Guidelines for the Prevention and Regulation of Illegal Listing and Sale of Radio Equipment including Walkie-Talkies on E-Commerce Platforms, 2025,\" aimed at regulating the sale of radio equipment, including walkie-talkies, on e-commerce platforms. These guidelines, authorized under Section 18 of the Consumer Protection Act, 2019, seek to ensure compliance with national telecommunications and security regulations, protecting consumers from unauthorized wireless telegraphy apparatuses.</p>\n\n<p>These regulations apply to all e-commerce platforms catering to Indian consumers, both domestically and internationally, as well as manufacturers, importers, and sellers of radio equipment, including devices requiring specific authorization. The guidelines define key terms, such as \"Radio Equipment\" and \"Unauthorized Devices,\" clarifying that unauthorized devices are those lacking Wireless Planning and Coordination (WPC) Wing authorization or that have been altered post-certification. E-commerce platforms are prohibited from listing or selling mobile signal boosters and wireless jammers.</p>\n\n<p>To ensure compliance, the guidelines mandate that radio equipment requiring frequency assignment from the Department of Telecommunications (DOT) can only be listed or sold if purchased from an authorized dealer. Product listings must specify frequency ranges, technical parameters, and proof of regulatory approval, such as Equipment Type Approval (ETA), with downloadable copies of the ETA and test reports available. Platforms are required to implement automated scanning systems to detect non-compliant listings and provide a user-friendly reporting mechanism for the public.</p>\n\n<p>Online platforms must ensure sellers of license-exempt equipment certify the authenticity of test reports and remove non-compliant listings within 24 hours of notification from the Department of Consumer Affairs (DoCA) or DOT. Platforms must also cooperate with regulators for real-time takedowns and enforcement actions and submit regular audits and compliance reports. Non-compliance will result in penalties under the Consumer Protection Act, 2019, and other applicable laws, including blacklisting of sellers and potential platform liability. E-commerce platforms must actively collaborate with regulatory authorities, providing regular audits and compliance reports. Platforms are also required to display notices regarding the risks and legal implications of purchasing unauthorized walkie-talkies, educating users on frequency compliance to promote informed consumer behavior.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/ccpa-radio-equipment-ecommerce-platform.jpg"
  },
  {
    "title": "FSSAI Advisory: Discontinuation of the Term “100%” on Food Product Labels and Promotional Materials",
    "description": "<p>The Food Safety and Standards Authority of India (FSSAI) issued an advisory on May 28, 2025, addressing the potentially misleading use of the term \"100%\" on food product labels and promotional materials. The FSSAI has observed a rise in the use of this term, which it deems ambiguous and capable of creating a false impression of absolute purity or superiority, thereby misleading consumers.</p>\n\n<p>The advisory, issued under the Food Safety and Standards Act, 2006, and referencing the Food Safety and Standards (Advertising and Claims) Regulations, 2018, specifically sub-regulations 10(7) and 4(1), prohibits misleading advertising and requires claims to be truthful, unambiguous, and meaningful.</p>\n\n<p>The FSSAI advises all Food Business Operators (FBOs) to discontinue using \"100%\" on food product labels, packaging, and promotional content, whether alone or with other descriptors. This term lacks definition within the FSS Act, potentially causing consumer confusion.</p>\n\n<p>This initiative aims to uphold food safety standards and protect consumers by preventing misleading claims and ensuring transparency and accuracy in marketing practices within the food industry. Compliance with this advisory is crucial for FBOs to avoid regulatory violations and maintain product and marketing integrity.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/discontinuation-100-food-product-labels.jpg"
  },
  {
    "title": "Delhi High Court Terminates Arbitrator's Mandate Due to Unexplained Delay",
    "description": "<p>The Delhi High Court has terminated the mandate of a Sole Arbitrator in the case of *Great Eastern Energy Corporation Limited vs Sopan Projects* due to an unexplained delay exceeding eight years in delivering the arbitral award. This ruling underscores the significance of timely dispute resolution within arbitration proceedings and reinforces the court's dedication to the principles outlined in the Arbitration and Conciliation Act, 1996.</p>\n\n<p>The dispute arose from a Work Order issued by Great Eastern Energy Corporation Limited to Sopan Projects for the construction of an underground MDPE pipeline. Following Sopan Projects' alleged abandonment of the project without completion, arbitration was invoked in October 2015. Final arguments concluded on March 5, 2020, but the Sole Arbitrator failed to render an award, prompting Great Eastern Energy to file a petition under Section 14 of the Arbitration and Conciliation Act, 1996.</p>\n\n<p>The Petitioner argued the delay violated public policy, while the Respondent cited unpaid fees and sought exclusion of the COVID-19 period from delay calculations. They also claimed the Petitioner did not attempt to follow up with the Sole Arbitrator.</p>\n\n<p>Relying on Section 14 of the Act and relevant Supreme Court judgments, the Delhi High Court emphasized the importance of speedy arbitration proceedings and found the unexplained delay sufficient grounds for termination. The court concluded that the arbitrator's failure to render the award within a reasonable time was unacceptable, thus undermining the purpose of arbitration. This decision reaffirms the Court's commitment to ensuring arbitration proceedings are conducted expeditiously and effectively, aligning with the legislative intent of the Arbitration and Conciliation Act, 1996.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/delhi-hc-terminate-arbitrators-mandate-delay.jpg"
  },
  {
    "title": "Environmental Impact of Pharmaceutical Waste: A Review of The Recent Guidance Document On Disposal Of Expired/ Unused Drugs Issued By CDSCO",
    "description": "<p>The article summarizes the recent guidance document issued by the Director General of Health Services, CDSCO, on May 26, 2025, concerning the safe and responsible disposal of expired and unused pharmaceuticals. This document was created in response to growing concerns about the ecological and public health risks associated with improper pharmaceutical waste disposal, stemming from a letter received by CDSCO from researchers.</p>\n\n<p>The primary objective of the guidance is to provide clear instructions, aligned with the Drugs and Cosmetics Act and Rules, to minimize environmental impact and public health risks, including antimicrobial resistance (AMR). It outlines acceptable disposal methods such as properly engineered landfills, waste immobilization techniques (encapsulation and inertization), and controlled use of sewers for specific liquid pharmaceuticals. Open burning is discouraged, while incineration and chemical decomposition are recommended in certain cases.</p>\n\n<p>The document emphasizes the responsibilities of various stakeholders, including retailers, wholesalers, manufacturers, hospitals, and government agencies, in the collection, storage, transportation, and disposal of expired/unused drugs. Detailed record-keeping and adherence to specific handling procedures, particularly for cytotoxic, radioactive, and controlled substances, are also mandated. For the general public, the guidance suggests the establishment of \"Drug Take-Back\" sites and provides guidance on which medications can be safely flushed. Ultimately, the document aims to establish a comprehensive framework for safeguarding both human health and the environment from the adverse effects of pharmaceutical waste.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/environment-impact-pharmaceutical-waste.jpg"
  },
  {
    "title": "IBBI Notifies Fourth Amendment Regulations to Corporate Insolvency Resolution Process",
    "description": "<p>The Insolvency and Bankruptcy Board of India (IBBI) has introduced the Fourth Amendment Regulations to the Insolvency Resolution Process for Corporate Persons, effective May 26, 2025. These amendments aim to enhance the efficiency and transparency of the corporate insolvency resolution process, refining the existing framework for a more streamlined and effective approach. The changes are made under the powers conferred by clause (t) of sub-section (1) of section 196 read with section 240 of the Insolvency and Bankruptcy Code, 2016.</p>\n\n<p>Key changes include the insertion of a new sub-regulation (5) in Regulation 18, allowing the committee to invite interim finance providers to attend meetings as observers without voting rights, facilitating smoother financial arrangements.  Additionally, sub-regulation (1A) has been inserted in Regulation 36A, enabling the resolution professional, with committee approval, to invite expressions of interest for resolution plans, either for the entire corporate debtor or specific assets, increasing potential resolution avenues. Sub-regulation (6A) has been omitted from Regulation 36B.</p>\n\n<p>Furthermore, Regulation 38 is amended to prioritize and ensure proportionate payment to financial creditors who did not support the resolution plan. Amendments to Regulation 39 enhance clarity and compliance by removing redundant language and ensuring the consideration and detailing of non-compliant plans, reinforcing adherence to the Insolvency and Bankruptcy Code and its associated regulations.</p>\n\n<p>In conclusion, these amendments represent a significant step towards a more flexible, fair, and compliant corporate insolvency resolution process, protecting the interests of stakeholders and contributing to a more effective and transparent framework.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/ibbi-fourth-amendment-regulations-2025.jpg"
  },
  {
    "title": "Bail is the Rule, Jail is the Exception — State of Rajasthan v. Balchand alias Baliay (1977)",
    "description": "<p>In <b>State of Rajasthan v. Balchand alias Baliay (1977)</b>, the Supreme Court of India, led by Justice <b>V.R. Krishna Iyer</b>, affirmed the principle that <b>bail is the rule and jail is the exception</b>.</p>\n\n<p>The accused, <b>Balchand alias Baliay</b>, was convicted of housebreaking and theft under <b>Sections 457</b> and <b>380</b> of the <b>Indian Penal Code</b>. During his appeal against the conviction, he was granted interim bail, which the <b>State of Rajasthan</b> challenged on the grounds that a conviction extinguishes the presumption of innocence.</p>\n\n<p>The Court considered whether a conviction automatically deprives an accused of the right to bail pending appeal, and how to balance <b>societal security</b> with an individual’s <b>fundamental liberty</b>. The prosecution contended that conviction nullifies the presumption of innocence and mandates bail cancellation, while the defense argued that the appeal process is an extension of the trial and preserves the accused’s right to liberty until final judgment.</p>\n\n<p>Justice Krishna Iyer’s judgment emphasized that the <b>presumption of innocence</b> endures until all appellate remedies are exhausted. He underscored that under <b>Article 21</b> of the Constitution, personal liberty must be deprived only through a process that is just, fair, and reasonable. The Court held that “<b>bail is the rule</b>” and that bail may be denied only in exceptional circumstances such as flight risk, tampering with evidence, or threat to public order. It ruled that bail cannot be revoked automatically upon conviction, but must be assessed on a case-by-case basis, ensuring the justice system protects both liberty and public interest.</p>\n\n<p>This ruling established the foundation of modern <b>bail jurisprudence</b> in India, affirming that even a convicted person retains dignity and the right to judicial review. It has guided subsequent judgments to resist mechanical denials of bail and reinforced that restrictions on liberty must be grounded in substantial reasons.</p>\n\n<p>In simple terms, the decision balances <b>personal freedom</b> and <b>public safety</b>, favoring release unless compelling reasons demand custody. As Justice Krishna Iyer eloquently stated: “<b>Bail is the rule and jail is the exception.</b>”</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/Bail is the Rule, Jail is the Exception.jpg"
  },
  {
    "title": "Commander K.M. Nanavati vs. State of Maharashtra (1959) — A Landmark Case in Indian Legal History",
    "description": "<p>The case of <b>Commander K.M. Nanavati v. State of Maharashtra</b> (1959) remains one of the most significant criminal trials in Indian jurisprudence, fundamentally altering perceptions of jury trials and the defense of provocation.</p>\n\n<p>Commander Kawas Manekshaw Nanavati, a distinguished officer of the Indian Navy, lived in Mumbai with his wife Sylvia and their children. When Sylvia’s extramarital affair with Prem Ahuja, a wealthy businessman, came to light, Nanavati confronted them. In an emotionally charged encounter, he took his service revolver and went to Prem Ahuja’s residence, where he fatally shot him.</p>\n\n<p>Key legal questions arose: whether Nanavati’s act amounted to murder under <b>Section 302 of the Indian Penal Code (IPC)</b>, and whether it could be reduced to culpable homicide not amounting to murder under <b>Exception 1 to Section 300 IPC</b> for grave and sudden provocation.</p>\n\n<p>At the Bombay Sessions Court, a jury trial returned a “Not Guilty” verdict by 8:1. The Sessions Judge, deeming the jury’s decision perverse and influenced by media sympathy, referred the case to the Bombay High Court under <b>Section 307 of the Code of Criminal Procedure</b>. The High Court reversed the jury’s verdict, finding Nanavati guilty of murder—a conviction later upheld by the Supreme Court of India.</p>\n\n<p>The courts examined whether provocation was truly sudden and overwhelming. Finding that Nanavati had time to plan—retrieving his revolver and traveling to Ahuja’s home—the defense of sudden provocation was rejected. The case also exposed media influence on juries, leading to the abolition of jury trials in Indian criminal law during the 1960s.</p>\n\n<p>Nanavati served his sentence but was subsequently pardoned by the Governor of Maharashtra after significant public and political support. His story inspired numerous films, books, and debates, most famously the Bollywood movie <b>Rustom</b>.</p>\n\n<p>The <b>Nanavati case</b> stands as a milestone in Indian criminal law, clarifying the limits of the provocation defense, highlighting the vulnerabilities of jury-based trials, and prompting the end of the jury system in India.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/Commander K.M. Nanavati vs. State of Maharashtra (1959).jpg"
  },
  {
    "title": "Cheque Bounce Recovery in India: Your Legal Options Explained",
    "description": "<p>In India, a <b>cheque bounce</b>, technically known as <b>dishonor of cheque</b>, is a criminal offense punishable under Section 138 of the <b>Negotiable Instruments Act, 1881</b>. This happens when a bank refuses to honor a cheque due to insufficient funds in the drawer's account, or for other reasons like signature mismatch. For an ordinary citizen, receiving a bounced cheque can be a frustrating experience, but it's crucial to understand the legal options available to recover the owed amount.</p>\n\n<p>The process for <b>cheque bounce recovery</b> begins with sending a legal notice to the issuer of the cheque. This notice must be sent within 30 days from the date the bank informs you about the dishonor of the cheque. The notice should demand payment of the cheque amount within 15 days. If the issuer fails to make the payment within this period, you have the right to file a criminal complaint in the court of a Metropolitan Magistrate or a Judicial Magistrate of the First Class, within one month from the date of expiry of the 15-day notice period. This initiates legal proceedings under Section 138 of the <b>Negotiable Instruments Act</b>.</p>\n\n<p>A critical aspect of the <b>Section 138</b> case is establishing that the debt or liability exists. The onus is on the complainant to prove that the cheque was issued in discharge of a legally enforceable debt or other liability. The drawer of the cheque has the opportunity to defend themselves, and the court will consider both sides before delivering a judgment. If the court finds the accused guilty, they can be sentenced to imprisonment for a term which may extend to two years, or with a fine which may extend to twice the amount of the cheque, or with both.</p>\n\n<p>Beyond the criminal proceedings under Section 138, it's also possible to initiate a civil suit for recovery of money. While the criminal case aims to penalize the defaulter, a civil suit aims to recover the outstanding amount along with interest and other costs. Filing a civil suit doesn't preclude initiating criminal proceedings, and both can proceed simultaneously. The legal recourse available to an individual who receives a <b>bounced cheque</b> provides substantial protection, ensuring that financial transactions are honored and that remedies are available when defaults occur.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/Cheque-Bounce-Recovery-in-India-Your-Legal-Options-Explained.jpg"
  },
  {
    "title": "Indian Landlord Rights: Eviction Rules You Need to Know",
    "description": "<p>In India, landlords have specific rights when it comes to evicting a tenant, governed primarily by the respective state's <b>Rent Control Act</b>. These Acts vary across states, but generally, a landlord cannot evict a tenant at will. A valid and legal ground for eviction must exist, such as non-payment of rent, causing nuisance, subletting without permission, or using the property for illegal activities. It's crucial for landlords to understand the specific provisions of the Rent Control Act applicable in their state to ensure any eviction process complies with the law.</p>\n\n<p>The process of eviction typically involves serving a legal notice to the tenant, clearly stating the reason for eviction and giving them a reasonable timeframe to vacate the premises. If the tenant fails to comply, the landlord can then file an eviction suit in the appropriate court. The court will then hear both sides of the argument, examining the evidence presented by both the landlord and the tenant. The burden of proof usually lies with the landlord to demonstrate that a valid ground for eviction exists under the relevant <b>Rent Control Act</b>. Landlords must keep accurate records of rent payments, communication with the tenant, and any violations of the rental agreement to support their case.</p>\n\n<p>It's important to note that even with a valid reason for eviction, a landlord cannot use force or illegal means to evict a tenant. Such actions can result in legal repercussions for the landlord, including penalties and damages. The eviction process must be carried out through the court, obtaining a court order for eviction if necessary. The Supreme Court has repeatedly emphasized the importance of following due process of law in eviction matters. For example, the landmark case of *Raghunath G. Panhale (Dead) By Lrs. v. M/S. Chaganlal Sundarji And Co* highlighted the need for strict adherence to procedural laws in eviction proceedings.</p>\n\n<p>For ordinary citizens who are landlords, understanding these <b>eviction rules</b> is crucial for protecting their property rights while also acting within the bounds of the law. Seeking legal advice from a lawyer specializing in property law is highly recommended before initiating any eviction proceedings. This ensures compliance with the state's specific Rent Control Act and minimizes the risk of legal complications. Moreover, familiarizing oneself with relevant case laws can provide a better understanding of how courts interpret and apply these laws in practice. Remember that a fair and legal eviction process protects both the landlord's rights and the tenant's rights, promoting a more equitable rental relationship.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/Indian-Landlord-Rights-Eviction-Rules-You-Need-to-Know.jpg"
  },
  {
    "title": "Online Fraud Refund: Your Rights Under Indian Law",
    "description": "<p>If you've fallen victim to <b>online fraud</b> in India, knowing your rights concerning a <b>refund</b> is crucial. Indian law provides avenues for recovering lost funds, though the process can sometimes be complex. The primary legislation governing such issues is the <b>Information Technology Act, 2000</b>, which addresses cybercrimes and provides a framework for holding fraudsters accountable. Banks and payment service providers also have a responsibility to ensure secure transactions, and their negligence can lead to liability.</p>\n\n<p>The liability of banks in cases of <b>unauthorized electronic transactions</b> is often governed by the Reserve Bank of India (RBI) guidelines. These guidelines typically differentiate liability based on customer reporting timelines. If the customer reports the fraudulent transaction promptly (usually within 3 days), the liability is often limited or even zero. Delay in reporting can increase the customer's potential liability. Banks are required to have a robust dispute resolution mechanism to handle customer complaints regarding fraudulent transactions and provide a refund, if warranted. It is important to document all communications with the bank and file a formal complaint with evidence of the <b>fraudulent transaction</b>.</p>\n\n<p>Beyond banking regulations, Section 43 of the <b>IT Act</b> deals with compensation for damages caused to computer systems and networks due to unauthorized access or disruption. While it may not directly guarantee a <b>refund</b>, it allows for claiming damages. Furthermore, depending on the nature of the <b>online fraud</b>, the Indian Penal Code (IPC) provisions related to cheating, forgery, and criminal breach of trust can also be invoked. Registering a First Information Report (FIR) with the police is a crucial step in initiating a criminal investigation and strengthens your case for seeking legal remedies.</p>\n\n<p>For ordinary citizens, the practical implication is to be vigilant and proactive. Immediately report any <b>online fraud</b> to your bank and the cybercrime cell. Keep records of all transactions and communication. File a police complaint to initiate formal investigation. Familiarizing yourself with RBI guidelines on limiting liability in fraudulent transactions can greatly help navigate the process of claiming a <b>refund</b>. Remember, acting quickly and diligently is essential to maximizing your chances of recovering your funds.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/Online-Fraud-Refund-Your-Rights-Under-Indian-Law.jpg"
  },
  {
    "title": "Live-in Relationships in India: Know Your Legal Rights",
    "description": "<p>In India, a <b>live-in relationship</b> refers to an arrangement where two individuals choose to cohabit and share their lives together without being legally married. This form of relationship has gained increasing social acceptance, and the Indian legal system has gradually recognized certain rights and protections for couples in such arrangements. However, it's crucial to understand that live-in relationships don't automatically grant the same rights as a marriage. Proof of a relationship resembling marriage, including factors like duration, shared household, pooling of resources, and intent to marry, is often essential for claiming legal entitlements.</p>\n\n<p>Several landmark court judgments have shaped the legal landscape surrounding live-in relationships. The Supreme Court, in cases like D. Patchaiammal v. D. Velusamy, has laid down guidelines for determining the validity and nature of a live-in relationship. To be considered a valid relationship warranting legal protection, the couple must hold themselves out to society as being akin to spouses. Importantly, not all cohabitation qualifies as a live-in relationship entitled to legal rights. The court has emphasized the necessity of a long-standing and genuine relationship similar to marriage. These judicial pronouncements primarily aim to prevent exploitation and protect vulnerable partners within such arrangements.</p>\n\n<p>The legal implications for women in <b>live-in relationships</b> are particularly significant. While not explicitly covered under the Hindu Marriage Act, certain legislations like the Protection of Women from Domestic Violence Act, 2005, provide some recourse. This Act recognizes women in live-in relationships as being in a relationship \"in the nature of marriage,\" thereby entitling them to protection from domestic violence, including physical, emotional, and economic abuse. They can seek remedies such as residence orders, monetary relief, and protection orders under this Act. Further, children born out of live-in relationships are considered legitimate and have inheritance rights in their parents’ property, as established by various court decisions.</p>\n\n<p>It’s important to note that establishing legal rights within a <b>live-in relationship</b> can often be challenging. Unlike a formal marriage certificate, there's no single document that automatically proves the existence of the relationship or its nature. Individuals need to gather evidence, such as joint bank accounts, utility bills with both names, photographs, and testimonies of friends and family, to demonstrate the validity and characteristics of their relationship to the court. Seeking legal advice from a qualified lawyer is highly recommended for individuals in live-in relationships to understand their rights and obligations and to navigate the legal complexities effectively. This is especially crucial in cases involving property disputes, maintenance claims, or inheritance matters.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/Live-in-Relationships-in-India-Know-Your-Legal-Rights.jpg"
  },
  {
    "title": "Supreme Court Imposes Year-Long Firecracker Ban in Delhi-NCR",
    "description": "<p>The Supreme Court has imposed a comprehensive, year-long ban on the use, manufacture, sale, and storage of firecrackers in the Delhi-National Capital Region (NCR). This decision extends beyond the previous 3-4 month restrictions, aiming to address the region's persistent air quality issues.</p><p>The Court emphasized that the prevailing air pollution levels in Delhi-NCR necessitate stringent measures. Consequently, no exceptions will be made, including for 'green crackers,' which are only marginally less polluting than traditional ones. The ban also encompasses online sales of firecrackers.</p><p>In its ruling, the Court underscored the fundamental right to health under Article 21 of the Constitution, highlighting the adverse effects of air pollution on citizens' well-being. The bench stated that no religious practices advocate for activities that harm the environment or public health.</p><p>This landmark judgment reflects the judiciary's commitment to ensuring a cleaner environment and safeguarding public health in the face of escalating pollution concerns in the capital region.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/Supreme%20Court%20Imposes%20Year-Long%20Firecracker%20Ban%20in%20Delhi-NCR.jpg"
  },
  {
    "title": "Supreme Court Affirms State Commissions' Authority Over Inter-State Power Supply Affecting State Grids",
    "description": "<p>The Supreme Court has clarified that State Electricity Regulatory Commissions (SERCs) retain the authority to regulate open access to electricity transmission within their states, even when it involves inter-state power supply, if such transactions impact the state's grid.</p><p>While the Central Electricity Regulatory Commission (CERC) oversees inter-state electricity transmission under Section 79(1)(c) of the Electricity Act, 2003, this does not preclude SERCs from exercising jurisdiction over intra-state aspects of open access. Specifically, Section 42(2) empowers SERCs to ensure fair and non-discriminatory access to transmission and distribution networks within their respective states.</p><p>This ruling underscores the collaborative regulatory framework envisioned by the Electricity Act, 2003, balancing the roles of both central and state commissions in managing the nation's electricity infrastructure.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/Supreme-Court-Affirms-State-Commissions-Authority-Over-Inter-State-Power-Supply-Affecting-State-Grid.jpg"
  },
  {
    "title": "Supreme Court: S-138 NI Act Complainant Not Required to Prove Financial Capacity at Threshold",
    "description": "<p>The Supreme Court has clarified that under Section 138 of the Negotiable Instruments Act, a complainant is not required to prove their financial capacity at the initial stage of the proceedings. This decision emphasizes that the focus should be on the alleged offense rather than the economic standing of the complainant.</p><p>In its ruling, the Court noted that the procedural threshold is meant to ensure that valid complaints are heard without undue burden on the complainant, thereby upholding the principles of accessible justice. This approach reinforces the idea that the legitimacy of the complaint does not hinge on the complainant’s ability to demonstrate financial robustness.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/Supreme-Court-S-138-NI-Act-Complainant-Not-Required-to-Prove-Financial-Capacity-at-Threshold.jpg"
  },
  {
    "title": "Supreme Court Upholds Cancellation of 25,753 West Bengal SSC Appointments",
    "description": "<p>The Supreme Court has upheld the Calcutta High Court's decision to invalidate approximately 25,753 teaching and non-teaching staff appointments made by the West Bengal School Service Commission (SSC) in 2016.</p><p>The Court found that the selection process was marred by widespread fraud and manipulation, rendering it irreparably tainted. Consequently, the services of the affected candidates are to be terminated, and they are required to refund any salaries received.</p><p>This ruling underscores the judiciary's commitment to maintaining integrity and transparency in public recruitment processes.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/Supreme-Court-Upholds-Cancellation-of-25-753-West-Bengal-SSC-Appointments.jpg"
  },
  {
    "title": "Supreme Court Rejects Partition Suit Filed 45 Years After Property Sale",
    "description": "<p>The Supreme Court recently dismissed a partition suit that was initiated a staggering 45 years after the property's sale deed was registered.</p>  <p>The Court emphasized that the registration of a sale deed serves as a public notice, implying that any party with an interest in the property is presumed to be aware of such transactions from the date of registration. This means that the limitation period for filing claims starts from that moment.</p>  <p>In this particular case, the plaintiffs' prolonged inaction—spanning over four decades—was deemed unacceptable. The Court reiterated that, according to the law, any claims or disputes regarding property transactions should be raised within the prescribed limitation period, which, in this context, had long expired.</p>  <p>This ruling serves as a stark reminder of the importance of timely legal action in property disputes and the weight that registered documents carry as public notices.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/Supreme-Court-Rejects-Partition-Suit-Filed-45-Years-After-Property-Sale.jpg"
  }
]