[
  {
    "title": "Supreme Court Reaffirms Protection to Bona Fide Purchasers in VAT Transactions: Commissioner, Trade & Tax.",
    "description": "<p>The Supreme Court of India, in The Commissioner, Trade and Tax, Delhi v. M/s Shanti Kiran India (P) Ltd., has decisively reaffirmed protection for bona fide purchasing dealers under the Delhi Value Added Tax Act, 2004 (DVAT Act). The Court dismissed the Department's appeals, upholding the Delhi High Court's stance that Input Tax Credit (ITC) cannot be denied to genuine purchasers solely because the selling dealer, despite being registered at the time of transaction, subsequently defaulted on depositing the collected tax with the government. This ruling carries binding legal significance, reinforcing established interpretations and safeguarding genuine business transactions.</p>\n\n<p>The dispute originated from the Department's denial of ITC to purchasing dealers, including M/s Shanti Kiran India (P) Ltd., who had bought goods from validly registered sellers, paid VAT, and possessed proper tax invoices. The Department argued that since the selling dealers later had their registrations cancelled and failed to remit the collected VAT to the treasury, the corresponding ITC claimed by the purchasers was inadmissible.</p>\n\n<p>The Delhi High Court had previously \"read down\" Section 9(2)(g) of the DVAT Act, which stated that ITC would not be allowed if the tax payable by the selling dealer had not been deposited. The High Court reasoned that this provision should not penalize bona fide purchasing dealers acting in good faith without collusion or fraud. It emphasized that the Department's remedy lies against the defaulting seller, not the innocent buyer, to avoid rendering the provision arbitrary and unconstitutional.</p>\n\n<p>The Supreme Court concurred, finding no reason to interfere with the Delhi High Court's judgment. It observed that denying ITC in such circumstances would be unjustified, especially given its earlier confirmation of similar High Court reasoning. The Court concluded that the appeals lacked merit, thereby upholding the right of bona fide dealers to claim ITC.</p>\n\n<p>This concise yet impactful order holds substantial jurisprudential value. It clarifies the scope of Section 9(2)(g), ensuring that honest taxpayers are protected from the defaults of their sellers, provided they have conducted genuine transactions with registered dealers and possess valid documentation. The ruling aligns with broader principles of \"buyer protection\" seen in other indirect tax regimes, such as GST, strengthening the continuity of judicial thought favouring equity, proportionality, and constitutional fairness in tax administration. For businesses, it provides crucial clarity and reassurance that compliance obligations will not extend beyond what is reasonable and just.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/supreme-court-upholds-itc-rights-of-bona-fide-dealers.jpg"
  },
  {
    "title": "Pay First, Recover Later: SC Reiterates Humanitarian Approach in Motor Accident Compensation",
    "description": "<p>In a landmark ruling, the Supreme Court of India, in K. Nagendra v. New India Assurance Co. Ltd., reaffirmed the victim-centric principle in motor accident compensation, holding that an insurer cannot deny compensation to accident victims due to technical policy breaches, such as a vehicle operating beyond its sanctioned route permit. This decision underscores the social justice intent of the Motor Vehicles Act, 1988, positioning motor insurance as a public welfare instrument rather than merely a private contract. The core of the judgment relies on the \"pay and recover\" doctrine, ensuring immediate compensation for victims while preserving the insurer's right to seek recovery from the vehicle owner for proven contractual violations.</p>\n\n<p>The case originated from a fatal motor accident involving a bus, owned by K. Nagendra and insured by New India Assurance Co. Ltd., which was allegedly plying outside its permitted route. While the Motor Accidents Claims Tribunal awarded compensation, the insurer challenged it, citing a fundamental breach of policy conditions. The central legal question before the Apex Court was whether a route permit violation absolves the insurer from third-party liability or if it must still compensate victims before seeking recovery from the vehicle owner.</p>\n\n<p>The Supreme Court emphatically stated that an insurer cannot escape liability to third parties solely because the vehicle operated outside its sanctioned route. It emphasized that the essence of compulsory insurance under the Motor Vehicles Act is to prevent victims from being left uncompensated due to technical defaults. The Court reiterated the \"pay and recover\" mechanism, directing the insurer to first disburse compensation to the victims and then recover the amount from the vehicle owner if the policy breach is established. This approach judiciously balances the protection of third-party rights with the insurer's contractual interests. While prioritizing victim compensation, the Court also clarified that the insurer's obligations are not unlimited, respecting contractual boundaries where liability clearly falls outside the agreed framework.</p>\n\n<p>Consequently, the Supreme Court upheld the High Court's decision, directing New India Assurance Co. Ltd. to pay the awarded compensation to the victims' dependents and subsequently recover the sum from the vehicle owner, K. Nagendra. This judgment reinforces the imperative of prompt compensation for accident victims, regardless of technical infractions, while also ensuring contractual accountability for vehicle owners who violate permit conditions. The ruling solidifies the integrity of India's motor accident compensation system by embodying both judicial empathy for victims and fairness for insurers.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/sc-upholds-pay-and-recover-in-motor-accident-claims.jpg"
  },
  {
    "title": "Registrar Has No Statutory Authority to Issue NOC for Redevelopment, Rules Bombay High Court",
    "description": "<p>The Bombay High Court has issued a significant ruling, asserting that the Registrar of Cooperative Societies lacks the statutory authority to issue a \"No Objection Certificate\" (NOC) for the redevelopment of cooperative housing societies. This judgment, delivered by Justice Amit Borkar, clarifies that such approvals have no legal basis under the Maharashtra Cooperative Societies Act, 1960, or its associated Rules, 1961. The Court unequivocally stated that the General Body of a cooperative housing society remains the ultimate and supreme authority for all redevelopment decisions, provided procedural compliance and transparency are maintained.</p>\n\n<p>The ruling stemmed from a challenge to an NOC granted by a District Deputy Registrar. The Court found no legal provision empowering the Registrar to approve or reject redevelopment decisions, deeming any such issuance ultra vires. Instead, the Court clarified that the Registrar's role, as per the Government Resolution dated 4 July 2019, is strictly supervisory. This involves nominating an Authorised Officer to attend Special General Meetings (SGMs) for developer selection, ensuring quorum, fair voting, and proper record-keeping, without exercising any power to veto or modify the society's decisions.</p>\n\n<p>Consequently, any NOC previously issued by the Registrar for redevelopment is legally invalid, and decisions lawfully made by the society's General Body remain enforceable. Justice Borkar directed all Registrars across the State to refrain from issuing or insisting upon such NOCs and mandated the Commissioner of Cooperation and the Principal Secretary, Cooperation Department, to issue a departmental circular reiterating these directives. Societies are still required to follow prescribed safeguards, including requesting an Authorised Officer and maintaining proper documentation for transparency.</p>\n\n<p>This landmark judgment significantly enhances the autonomy of cooperative housing societies, streamlines redevelopment processes by removing unnecessary administrative hurdles, and reinforces the General Body's decision-making authority. It is expected to foster faster, fairer, and more transparent redevelopment projects throughout Maharashtra by clearly defining the Registrar's role as purely supervisory rather than one of control or approval.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/registrar-lacks-power-to-approve-redevelopment-bombay-hc.jpg"
  },
  {
    "title": "Delhi High Court Upholds Crocs’ Design and Brand Integrity in Questsole Dispute",
    "description": "<p>The Delhi High Court has issued an ex-parte ad-interim injunction in favor of Crocs Inc. and its subsidiary, affirming the protection of their extensive intellectual property rights against Sagar Doijode, trading as Questsole, and others. The suit, filed before the Delhi High Court, sought a permanent injunction for alleged infringement of Crocs' patents, trademarks, registered designs, and distinctive trade dress.</p>\n\n<p>Crocs alleged that Questsole was manufacturing, advertising, and selling footwear and shoe charms that were identical or deceptively similar to their products. Specifically, the defendants were accused of infringing Patent No. IN 271337, which covers the system for attaching decorative accessories (Jibbitz) to shoes, and of copying the registered design No. 349374-001 for Crocs' iconic clog-style footwear. Furthermore, Questsole was found to be using deceptive marks like “CROCKS,” “CROC,” and “JIBIT,” infringing Crocs' registered trademarks “CROCS” and “JIBBITZ.” The defendants also imitated Crocs’ distinctive trade dress, characterized by the clogs' unique bulbous shape, ventilation holes, and back strap design, and posted disparaging videos online.</p>\n\n<p>Justice Tejas Karia, after reviewing the evidence, determined that Crocs Inc. possessed substantial global goodwill, reputation, and valid intellectual property registrations. The Court observed that the defendants' actions, including the use of deceptively similar marks and designs, appeared to be a dishonest attempt to exploit Crocs’ established brand identity and create consumer confusion. A test purchase confirmed direct patent infringement, and the visual and structural resemblance between the defendants' products and Crocs' registered design and trade dress was deemed fraudulent imitation, leading to dilution of Crocs’ distinctiveness.</p>\n\n<p>Based on these findings, the Delhi High Court concluded that Crocs Inc. had established a prima facie case for interim relief, with the balance of convenience lying in its favor and a risk of irreparable harm if an injunction was not granted. Consequently, the Court restrained the defendants from using the infringing marks, manufacturing or selling products embodying Crocs' patented system, imitating its registered design, or copying the distinctive trade dress of Crocs’ geometric clogs. The matter is scheduled for further hearing on February 16, 2026.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/delhi-hc-protects-crocs-ip-rights-against-questsole.jpg"
  },
  {
    "title": "Supreme Court Clarifies: Redeemable Preference Shareholders Are Not Financial Creditors Under IBC",
    "description": "<p>The Supreme Court of India, in the case of EPC Constructions India Limited (Through Its Liquidator) v. Matix Fertilizers and Chemicals Limited, has definitively ruled that holders of Cumulative Redeemable Preference Shares (CRPS) are not to be treated as financial creditors under the Insolvency and Bankruptcy Code, 2016 (IBC). This landmark decision reinforces the statutory distinction between share capital and debt, asserting that preference shareholders are investors, not lenders, and their claims for redemption cannot constitute a \"financial debt\" to trigger insolvency proceedings under Section 7 of the IBC.</p>\n\n<p>The dispute originated from EPC Constructions India Limited (EPCC) converting outstanding receivables of ₹250 crore from Matix Fertilizers and Chemicals Limited into 8% CRPS. When Matix failed to redeem these shares due to a lack of profits or fresh issue proceeds, EPCC's liquidator filed an application under Section 7 of the IBC, contending that Matix had defaulted on a \"financial debt.\" Both the NCLT and NCLAT dismissed this petition, leading to the appeal before the Supreme Court.</p>\n\n<p>The Supreme Court's analysis highlighted several key points. It affirmed that preference shares constitute part of a company's share capital under the Companies Act, 2013, and do not represent loans. Therefore, even if redemption is due, failure to redeem does not transform shareholders into creditors. The Court emphasized that redemption under Section 55 of the Companies Act is contingent upon the availability of distributable profits or proceeds from a fresh issue of shares, which Matix lacked. Furthermore, the conversion of receivables into shares extinguished the original debt, making it a conscious equity investment rather than a disguised loan. The Court also rejected arguments based on accounting treatment classifying CRPS as \"unsecured loans,\" stating that accounting standards cannot override the legal nature of a transaction. Finally, it clarified that the \"commercial effect of borrowing\" test under Section 5(8)(f) of the IBC applies only to genuine debt transactions involving the disbursal and time value of money, which equity instruments like CRPS inherently lack.</p>\n\n<p>This ruling by the Supreme Court critically reinforces the distinction between equity and debt within corporate finance. It safeguards the IBC from being invoked as a mechanism for recovering equity investments and underscores that share capital retains its equity character until lawfully redeemed in accordance with the Companies Act. The judgment contributes to strengthening corporate governance by promoting investor discipline and preserving the integrity of corporate capital structures.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/sc-redeemable-preference-shares-not-financial-debt.jpg"
  },
  {
    "title": "Delhi High Court Affirms Validity of Full and Final Settlement in Subcontract Recovery Dispute",
    "description": "<p>The Delhi High Court recently issued a significant judgment affirming the validity of a full and final settlement in a subcontract recovery dispute between M/S BS Enviro N Infracon Pvt. Ltd. (Appellant) and VIJ Contracts Pvt. Ltd. (Respondent). The core of the case involved the Appellant's claim for an outstanding amount of Rs. 50,41,835/- related to an 800 KLD Sewage Treatment Plant (STP) subcontract, following the Trial Court's dismissal of its recovery suit. The central question revolved around whether a document signed by the parties constituted a conclusive settlement of all claims.</p>\n\n<p>The dispute originated from the Appellant subcontracting its services to the Respondent for an STP project with a total contract value of Rs. 1,28,80,000/-. After receiving partial payments, the Appellant initiated MSME Samadhaan proceedings for a claimed balance of Rs. 50,41,835/-. A pivotal meeting on September 26, 2019, resulted in a document recording a net balance of Rs. 14,68,165/-, subject to the Appellant withdrawing its MSME notice. The Respondent issued cheques for this agreed amount, which the Appellant encashed. However, the Appellant failed to withdraw the MSME notice and continued to pursue further claims, which were subsequently dismissed by an arbitral award and later by the Trial Court.</p>\n\n<p>The Appellant contended that the September 26, 2019 document merely recorded \"on account\" payments to maintain the contract, not a full discharge of liabilities. They also sought release of unbilled contract value and retention amounts, asserting substantial performance. Conversely, the Respondent argued that the document represented a full and final settlement and a novation of prior obligations under Section 62 of the Indian Contract Act, 1872, with the encashment signifying acceptance.</p>\n\n<p>The High Court meticulously examined the evidence, concluding that the September 26, 2019 document, acknowledged by the Appellant's Director, clearly established a full and final settlement. The Court held that the Appellant's act of encashing the cheques, coupled with the contemporaneous records, constituted \"accord and satisfaction\" and a \"novation\" of all accrued claims under Sections 62 and 63 of the Indian Contract Act. It emphasized that voluntary acceptance of a lesser sum in satisfaction of a claim bars subsequent pursuit of the balance. The Court dismissed the Appellant's \"on account\" argument as inconsistent with the signed agreement and their subsequent actions. Furthermore, claims for unbilled contract value and retention amounts were rejected, as the Appellant failed to demonstrate substantial performance—having supplied materials but not completed essential installation, testing, or commissioning—or that the conditions for release of retention had matured.</p>\n\n<p>In conclusion, the Delhi High Court upheld the Trial Court's decision, affirming that the settlement reached on September 26, 2019, effectively discharged all prior claims and barred the Appellant from pursuing further recovery for those matters.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/delhi-hc-upholds-full-final-settlement-in-contract-dispute.jpg"
  },
  {
    "title": "Security Cheques vs. Enforceable Debt: Delhi High Court Reiterates Limits of Section 138 NI Act",
    "description": "<p>The Delhi High Court, in the case of Sri Sai Sapthagiri Sponge Pvt. Ltd. v. State (GNCT of Delhi) & Anr., has delivered a significant judgment clarifying the boundaries of Section 138 of the Negotiable Instruments Act, 1881. The Court quashed multiple complaints, reiterating that cheques issued merely as security or for audit purposes do not constitute instruments issued in discharge of a legally enforceable debt, and thus do not attract criminal liability under the Act. The ruling also addressed critical jurisdictional and procedural flaws in the handling of cheque dishonour cases.</p>\n\n<p>A central point of the judgment was the distinction between security cheques and those issued for existing debt. The Court found that the Memorandum of Understanding (MoU) explicitly stated the cheques were issued \"for security purpose only\" and \"not for depositing into bank.\" This contractual clarity was pivotal, leading the Court to conclude that such cheques could not be treated as having been issued in satisfaction of a legally recoverable debt or liability, which is a prerequisite for invoking Section 138 NI Act.</p>\n\n<p>Furthermore, the High Court highlighted a significant jurisdictional error. The original complaints were filed in Bellary but later returned due to a lack of territorial jurisdiction, aligning with the Supreme Court's ruling in Dashrath Rupsingh Rathod. Subsequently, when the complaints were refiled in New Delhi, the Metropolitan Magistrate adopted the summoning orders previously issued by the Bellary court, instead of issuing fresh summons after due application of mind. The Court held that any proceedings, including summoning orders, conducted by a court lacking jurisdiction are \"non-est in law,\" rendering the adopted orders and all subsequent proceedings null and void.</p>\n\n<p>This decision from the Delhi High Court reinforces two critical legal principles: it safeguards businesses by clarifying that security cheques, when demonstrably not for a present debt, cannot lead to criminal liability under Section 138 NI Act; and it stresses the fundamental importance of procedural propriety and strict adherence to territorial jurisdiction in judicial proceedings. The judgment thereby strengthens the balance between commercial accountability and procedural fairness, preventing the criminalization of civil disputes in cheque transactions.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/delhi-hc-security-cheques-not-enforceable-under-ni-act.jpg"
  },
  {
    "title": "Concealment of Free Seats Amounts to Unfair Trade Practice: Maharashtra Commission Finds Emirates Airlines Deficient in Service",
    "description": "<p>The Maharashtra State Consumer Disputes Redressal Commission, Mumbai, has ruled that Emirates Airlines engaged in deficiency of service and unfair trade practice by misleading passengers into paying for seat selection when free adjacent seats were available. This significant decision, stemming from the case of Emirates Airlines v. Dr. Keshab Nandy & Anr., upheld a District Forum's order compelling the airline to refund ₹7,200 with interest and provide compensation for mental agony and litigation costs. Notably, the ruling is one of the first judicial recognitions in India of \"dark patterns\"—deceptive online design practices that manipulate consumer choice—within consumer jurisprudence, highlighting a growing emphasis on transparency in digital consumer interactions.</p>\n\n<p>The case involved Dr. Keshab Nandy, a diabetic and hypertension patient, and his wife, Mrs. Meenu Pandey, who pre-booked adjacent seats online for ₹7,200 for a Mumbai-New York flight in 2017 to ensure Dr. Nandy received assistance. Upon arrival at the airport, they discovered numerous free adjacent seats that other passengers had availed without charge. This led them to allege that Emirates had falsely led them to believe paid pre-booking was the only option for guaranteed adjacent seating, constituting a deficiency in service and unfair trade practice under the Consumer Protection Act, 1986.</p>\n\n<p>Emirates Airlines contended that seat selection was an optional, voluntary, and non-refundable service, and that free selection was available 48 hours before departure. However, the Commission rejected this argument, finding that Emirates failed to disclose crucial information regarding the availability of free adjacent seats. It emphasized that the airline's online interface created a false impression of scarcity and compelled passengers like the complainants to make unnecessary payments, thereby violating the principles of transparency and informed consent.</p>\n\n<p>Ultimately, the State Commission dismissed Emirates' appeal, affirming the District Forum's directive for a refund of ₹7,200 with 9% interest from the complaint date, ₹10,000 for mental agony, and ₹10,000 for litigation costs. This ruling is a progressive affirmation of consumer rights in the digital age, expanding the scope of unfair trade practices to encompass manipulative online design and the omission of key information. It sends a clear message to airlines and digital service providers about the importance of transparency and fairness in all consumer interactions, both online and offline, to prevent consumer exploitation.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/emirates-penalized-for-hiding-free-seats-dark-pattern-case.jpg"
  },
  {
    "title": "Medical Devices Step Out of Legal Metrology (Packaged Commodities) Shadow: 2025 Amendment Ends Labelling Confusion",
    "description": "<p>The Legal Metrology (Packaged Commodities) Amendment Rules, 2025 has significantly revised the regulatory framework for medical device packaging, effectively exempting these products from the general consumer packaging regulations. This amendment, enacted under the Legal Metrology Act, 2009, resolves a decade-long conflict and overlap between the Legal Metrology rules and the specialized Medical Devices Rules, 2017 (under the Central Drugs Standard Control Organisation - CDSCO).</p>\n\n<p>The Central Government utilized its power to exempt specific package classes, making the Medical Devices Rules, 2017 the exclusive authority for all labelling declarations on medical device packages. This change is integrated by amending Rule 2(h) of the 2011 Packaged Commodities Rules, which now specifically carves out \"packages containing medical devices\" from the definition of a \"pre-packaged commodity.\" Consequently, previous requirements for precise typographic measurements (Rules 7(2) and 7(3)) are no longer applicable; instead, the 2017 Rules' focus on legibility and contrast will govern. Furthermore, Rule 33 clarifies that no Legal Metrology waivers or concessions apply where the Medical Devices Rules, 2017 are in effect, solidifying the medical device regime as the sole compliance pathway.</p>\n\n<p>This amendment addresses a history of jurisdictional confusion, conflicting court rulings, and operational burdens on manufacturers who previously had to comply with two distinct regulatory bodies. The operational impact for manufacturers is immediate, promising shorter artwork cycles, elimination of redundant dual-language stickers, and faster import clearances. For consumers, essential safeguards on safety, performance, and traceability remain intact, with the enforcement authority now solely under CDSCO. This regulatory adjustment represents a strategic \"de-harmonisation through harmonisation,\" aligning medical devices under a single, more specialized legal framework.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/medical-devices-exit-legal-metrology-labelling-rules.jpg"
  },
  {
    "title": "Won the Battle, Must Win the War: Rajasthan High Court Enforces United Kingdom GAFTA Award",
    "description": "<p>The Rajasthan High Court at Jaipur has ordered the enforcement of a London-seated GAFTA (Grain and Feed Trade Association) appeal award, effectively converting it into a decree of the Court. This judgment concludes a seven-year dispute involving an Austrian company, Kingsroad Handelsgesellschaft m.b.H., and an Indian entity, Raj Grow Impex LLP, over three container-loads of yellow peas. The ruling is significant for its reaffirmation of the narrow interpretation Indian courts apply to the \"public policy\" defense against foreign award enforcement.</p>\n\n<p>The dispute originated from three back-to-back contracts in September 2018 for Russian-origin yellow peas, brokered with a standard GAFTA arbitration clause. Following contentious issues over price, demurrage, and container free-time, Kingsroad initiated arbitration in London. The first-tier GAFTA tribunal upheld Kingsroad's claim in August 2020, a decision confirmed by the GAFTA Board of Appeal in September 2021. Raj Grow failed to challenge or set aside the award within the stipulated 28-day window in England.</p>\n\n<p>Subsequently, Kingsroad petitioned the Rajasthan High Court for the award's enforcement as a decree, execution against Raj Grow's assets, and costs. Raj Grow resisted enforcement, citing \"patent illegality\" and \"violation of Indian public policy.\" Their primary contention was that Kingsroad's direct payment of container detention charges to shipping lines outside India deprived Raj Grow of input GST credit, leading to revenue loss for the Indian government and thus offending fundamental Indian law, national interest, and morality.</p>\n\n<p>Justice Anoop Kumar Dhand, noting Raj Grow's prior inaction in the arbitration proceedings and abroad, emphasized that Section 48 of the Arbitration and Conciliation Act, 1996, mandates a skeletal inquiry, precluding a review of merits or re-appreciation of evidence. Drawing upon Supreme Court precedents like Vedanta, Avitel Post Studioz, and Shri Lal Mahal, the Court reiterated that \"public policy\" must be construed narrowly, limited to violations of fundamental Indian law, national interest, or basic notions of justice/morality. The Court found that a grievance regarding GST leakage, even if true, constituted a contractual accounting dispute already adjudicated, which neither shocked the conscience nor struck at the root of India's economic order, thus not meeting the stringent public policy threshold.</p>\n\n<p>As a result, the GAFTA Appeal Award was declared enforceable and converted into a decree of the Rajasthan High Court. Raj Grow has been directed to disclose all its assets within six weeks for execution proceedings, while Kingsroad is free to pursue attachment and sale. This judgment strongly reinforces India's pro-enforcement stance towards foreign arbitral awards, limiting merit-based objections and providing greater assurance to international award holders seeking realization of their claims in India.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/rajasthan-hc-enforces-uk-gafta-award-limits-public-policy.jpg"
  },
  {
    "title": "Bombay High Court Reiterates: Borrowers Cannot Demand One-Time Settlement as a Matter of Right",
    "description": "<p>In a significant ruling, the Bombay High Court (Nagpur Bench) in Ms. Archana Wani v. Indian Bank & Ors. affirmed that borrowers or guarantors do not possess a right to demand a One-Time Settlement (OTS), nor can courts compel banks to disclose internal settlement benchmarks or accept settlement proposals. The Court emphasized that loan recovery and settlement decisions fall squarely within the commercial wisdom of banks, which manage public funds and are bound by financial discipline. Judicial intervention under Article 226 of the Constitution is unwarranted, particularly when statutory remedies under the SARFAESI Act, 2002, and the Insolvency and Bankruptcy Code, 2016 (IBC), are available.</p>\n\n<p>The case involved Ms. Archana Wani, a guarantor for a defaulted loan of ₹62 crore, whose account was declared a Non-Performing Asset (NPA). After the bank initiated recovery proceedings under SARFAESI and IBC, Ms. Wani submitted multiple OTS proposals. These were rejected by the bank for not meeting its \"benchmark criteria,\" which the petitioner argued were arbitrarily withheld. She sought judicial intervention to compel the bank to disclose its standards and accept her proposal.</p>\n\n<p>The High Court meticulously reviewed the contractual obligations and statutory frameworks, concluding that a bank's decision on an OTS proposal is a purely commercial one based on internal policies and risk assessment. The Court reiterated that an OTS proposal does not confer any enforceable right upon the borrower, and banks are not statutorily obligated to disclose their internal benchmark parameters. Relying on established Supreme Court precedents, the Bench highlighted that compelling banks to settle on terms dictated by borrowers would undermine financial prudence and public interest. Consequently, the High Court dismissed the petition, reiterating that OTS schemes are discretionary concessions, not enforceable rights, and that negotiation, not entitlement, is the pathway to settlement. The interim stay on recovery was, however, continued for six weeks to allow the petitioner to explore alternate remedies.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/bombay-hc-no-right-to-one-time-settlement-for-borrowers.jpg"
  },
  {
    "title": "Housewife-Landlady’s Right to Seek Eviction for Husband’s Welfare: Delhi High Court Upholds Bona-Fide Requirement under Section 14(1)(e) of the Delhi Rent Control Act",
    "description": "<p>The Delhi High Court, in the case of Naveen Kumar v. Babita Jain, has issued a significant ruling affirming that a housewife who owns a tenanted property can legitimately seek eviction of a tenant if the premises are required for her husband's welfare or to enable him to start a business. This decision clarifies that familial obligations and spousal dependence fall within the ambit of \"for his own use\" as defined under Section 14(1)(e) of the Delhi Rent Control Act, 1958, emphasizing the gender-neutral application of rent control laws.</p>\n\n<p>The dispute arose when Mrs. Babita Jain, the landlady and a housewife, filed an eviction petition seeking possession of a tenanted shop for her husband to commence a dry-fruits business. The Additional Rent Controller granted the eviction, prompting the tenant to appeal to the Delhi High Court. The tenant argued that the landlady, as a housewife without an independent income, could not claim eviction for her husband's benefit and that the asserted need was fabricated.</p>\n\n<p>The High Court rejected the tenant's contentions, affirming that gender or occupation is immaterial in determining a bona-fide need. Citing the Supreme Court's judgment in Joginder Pal v. Naval Kishore Behal, the Court reiterated that \"for his own use\" must be interpreted liberally to include dependent family members. It held that a housewife possesses equal rights to seek eviction for the welfare or livelihood of her dependents, and to interpret the statute otherwise would amount to discrimination, violating Articles 14 and 15 of the Constitution. The Court found the landlady's claim genuine, noting the tenant's failure to provide evidence disproving the need or showing the husband's alternative employment.</p>\n\n<p>Ultimately, the Court upheld the Additional Rent Controller's finding that the landlady's need for the premises for her husband's business was genuine and bona fide. It dismissed the tenant's revision petition and recorded the tenant's undertaking to vacate the premises by May 30, 2026. This judgment underscores that familial welfare and economic dignity are central to the concept of bona-fide requirement, harmonizing the Delhi Rent Control Act with constitutional principles of gender neutrality and reinforcing that ownership rights and legal entitlements are independent of economic participation or employment status.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/delhi-hc-housewife-can-seek-eviction-for-husbands-welfare.jpg"
  },
  {
    "title": "Rajasthan High Court Orders FSSAI to Frame Regulations on Genetically Modified Foods, Citing Right to Safe Food under Article 21",
    "description": "<p>The Rajasthan High Court, in the case of Kritesh Oswal & Ors. v. Union of India & Ors., has issued a significant directive compelling the Central Government and the Food Safety and Standards Authority of India (FSSAI) to promptly frame and notify regulations for genetically modified (GM) foods under Section 22 of the Food Safety and Standards Act, 2006. The Court emphasized that the current absence of such regulations constitutes a regulatory vacuum, posing substantial risks to public health and infringing upon the fundamental right to life and health guaranteed by Article 21 of the Constitution.</p>\n\n<p>This ruling emerged from a Public Interest Litigation highlighting the unregulated sale, import, and distribution of GM food products in India, particularly edible oils like soybean and canola, without requisite scientific evaluation of their health impacts. Petitioners argued that despite the FSS Act mandating a framework, FSSAI had failed to establish regulations, allowing GM ingredients into the market without proper oversight or safety standards. The petition also challenged the legality of merely labelling GM products under existing rules without a fundamental regulatory approval process.</p>\n\n<p>The Court underscored the State's affirmative duty under Article 47 to ensure safe nutrition, asserting that food security cannot undermine food safety. It invoked the precautionary principle, stressing that potential harm from unregulated GM foods necessitates robust oversight. Key findings included that the absence of regulations directly violates Article 21, that FSSAI is the sole competent authority for GM food regulation, and that consumers possess a fundamental right to know about GM ingredients in their food. The Court also deemed any prior approvals by the Genetic Engineering Appraisal Committee (GEAC) for GM foods as illegal and non-binding.</p>\n\n<p>Consequently, the Rajasthan High Court directed FSSAI to finalize and notify the GM food regulations within three months. Furthermore, it mandated that no GM food product, whether raw, processed, or as an ingredient, should be imported, manufactured, or sold in India without FSSAI approval and compliance with the new regulations, including specific labelling requirements. The judgment reinforces that food safety is a constitutional imperative deeply connected to human dignity, urging proactive governance to align scientific advancement with public welfare and constitutional values.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/rajasthan-hc-orders-fssai-to-regulate-gm-foods-under-art-21.jpg"
  },
  {
    "title": "When Fees Stop the Fight: Bombay High Court Upholds Tribunal’s Power to Terminate Arbitration for Non Payment",
    "description": "<p>The Bombay High Court, in a ruling by Justice Manish Pitale, upheld an arbitral tribunal's decision to terminate arbitration claims under Section 38(2) of the Arbitration and Conciliation Act, 1996, due to a claimant's persistent non-payment of arbitrator fees. The case involved Marvel Sigma Homes Private Limited, whose claims were terminated while the respondents' counterclaim was allowed to proceed. Marvel Sigma challenged this decision via a writ petition, prompting a debate on the maintainability of such petitions, the tribunal's jurisdiction, and party autonomy.</p>\n\n<p>The dispute originated from a development agreement, with the arbitral tribunal, comprising three former High Court judges, establishing a fee schedule from the outset. Marvel Sigma consistently failed to meet its obligations, accumulating a significant shortfall despite multiple reminders, conditional orders, and broken undertakings. Ultimately, after numerous extensions and no part-payment offered even at a final hearing, the tribunal concluded that the claimant lacked bona fides and was prejudicing the counterclaimants. It consequently terminated Marvel Sigma's claims, imposing Rs 10 lakh in costs, and directed the counterclaim to advance.</p>\n\n<p>Marvel Sigma's writ petition argued that since the Arbitration Act does not provide an immediate statutory challenge to a Section 38(2) termination, a constitutional writ was the only available recourse. The petitioner relied on Supreme Court precedents, including Deep Industries Limited v. Oil and Natural Gas Corporation Limited, where a writ was entertained for a Section 32(2)(c) termination, and Oil and Natural Gas Corporation v. Afcons Gunanusa JV, asserting that arbitrators cannot unilaterally impose fee regimes, emphasizing party autonomy. They further contended that the termination, despite substantial payments, violated principles of natural justice.</p>\n\n<p>The respondents countered, asserting that a writ petition is only maintainable for jurisdictional error or gross injustice, neither of which was evident. They argued that Section 38(2), read with Sections 31(8) and 31A, expressly empowers the tribunal to dismiss parties failing to pay cost deposits. The fee schedule, they noted, was mutually agreed upon, and the petitioner had received ample opportunities, making the fault lie with the claimant's default, not the tribunal's order.</p>\n\n<p>Justice Pitale analyzed three core questions: the maintainability of a writ against a Section 38(2) termination, whether the arbitrators exceeded jurisdiction or breached natural justice, and the applicability of the cited Supreme Court precedents. The Court acknowledged the Arbitration Act's \"vacuum\" regarding direct challenges to Section 38(2) terminations but concluded that this vacuum is not universally filled by writ jurisdiction. Instead, an aggrieved party could pursue an alternate remedy under Section 14 of the Act, which allows for the removal of an arbitrator or setting aside of an order if the mandate has terminated. The Court found no excess of jurisdiction, citing Section 31A and 31(8), which vest the tribunal with the power to fix and secure costs. Natural justice was also not violated, given the extensive opportunities granted to Marvel Sigma. Furthermore, the Court distinguished Afcons Gunanusa, as the fee structure in this case was agreed upon at the outset, unlike a unilateral imposition.</p>\n\n<p>Ultimately, the Bombay High Court dismissed the writ petition, finding that Marvel Sigma had failed to demonstrate a prima facie case of jurisdictional overreach or gross injustice. The judgment reinforces that arbitration, while a private dispute resolution mechanism, is not cost-free. Parties agreeing to fee schedules must adhere to them, as repeated defaults can lead to the dismissal of claims. The decision also subtly signals that writ courts will generally refrain from acting as appellate bodies when parallel statutory remedies, such as Section 14 of the Arbitration Act, are available.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/bombay-hc-upholds-tribunals-power-to-end-arbitration.jpg"
  },
  {
    "title": "DoT Tightens Noose on Unused Transmitters, Issues Post Licence Disposal Playbook",
    "description": "<p>India's Department of Telecommunications (DoT) has issued a comprehensive guideline to resolve the ambiguity surrounding the disposal of wireless transmitting and receiving equipment upon the expiry of a Wireless Operating Licence (WOL). Effective immediately and applicable to all entities—private and public—possessing radiating hardware under WPC licenses, these stern guidelines establish clear accountability and strict timelines for equipment disposal, backed by the threat of prosecution under the Indian Telegraphy Act.</p>\n\n<p>The guidelines prescribe varying disposal periods depending on the manner of licence expiry. For licensee-initiated cancellations, a 90-day window is provided to scrap, return, transfer the apparatus, or secure a Non-Destructive Possession Licence (NDPL), with a \"deemed NDPL\" cover during this period. In cases of simple non-renewal, a 30-day period is allotted for disposal, requiring a disposal certificate upload within seven days of completion, also with a deemed NDPL. The most abrupt scenario, government-induced termination due to breach of conditions, allows only 15 days for hardware removal and surrender, reflecting a heightened focus on spectrum security. Retaining equipment for future experiments necessitates obtaining a regular NDPL before the existing licence lapses, as no deemed grace period is extended for long-term storage.</p>\n\n<p>Proof of disposal can be established by returning equipment to the original vendor or an authorised dealer, transferring it to another licensed entity with identical frequency clearance, or physically destroying it in the presence of a Wireless Monitoring Organisation (WMO) inspector or licensed dealer. Government laboratories may self-certify demolition but must inform WPC. Crucially, all disposed equipment, including circuit boards, batteries, and metal carcasses, must comply with the Environment Ministry's 2022 rules for telecom-specific e-waste, ensuring they reach only authorised recyclers.</p>\n\n<p>Non-compliance with these new directives will be treated as a wilful violation, leading to \"appropriate action\" by the DoT, which could include fines, black-listing, and criminal prosecution under wireless statutes. The new playbook definitively shifts the full lifecycle liability for every radio chip onto the licence-holder, emphasizing that experimental frequencies are temporary leases on public property, and equipment must be promptly removed once the licence tenure concludes.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/dot-issues-strict-rules-for-disposing-wireless-equipment.jpg"
  },
  {
    "title": "When IBC Meets Electricity Act: Why Discoms Can’t Hold a New Owner to Ransom for Past Arrears",
    "description": "<p>The Allahabad High Court has decisively ruled on the pre-eminence of the Insolvency and Bankruptcy Code, 2016 (IBC) over the Electricity Act, 2003, in a case involving past electricity arrears. The court affirmed that power distribution companies (discoms) cannot compel new owners, who acquire assets through IBC liquidation auctions, to settle outstanding electricity bills of the former corporate debtor before providing a new connection. This judgment, M/s Dharti Agro Industries Pvt. Ltd. v. Managing Director, PVVNL, reinforces the protection afforded to successful resolution applicants and auction purchasers from inheriting historical liabilities.</p>\n\n<p>The dispute arose when Dharti Agro Industries purchased the assets of a liquidated company, M/s Chaudhary Ingots Pvt. Ltd., via an \"as-is-where-is-whatever-there-is\" auction under the IBC. Following the acquisition, the Pashchimanchal Vidyut Vitran Nigam Ltd. (PVVNL) refused to grant a new electricity connection unless Dharti Agro paid ₹4.92 crore in arrears owed by the previous owner. This prompted Dharti Agro to seek legal recourse against the discom's demand.</p>\n\n<p>Dharti Agro contended that Section 238 of the IBC, being a non-obstante clause, overrides any inconsistent provisions in the Electricity Act. They argued, supported by Supreme Court precedents, that a discom must participate in the IBC's liquidation process and adhere to its waterfall mechanism for debt recovery, rather than penalizing a new, unrelated owner. PVVNL, conversely, maintained that the Electricity Act, with its own non-obstante clauses, is a comprehensive code for electricity dues, and a statutory first charge on the premises meant that arrears were tied to the asset, citing the K.C. Ninan Supreme Court judgment.</p>\n\n<p>The High Court concluded that the IBC, as a later special statute with a broad non-obstante clause (Section 238), prevails over the Electricity Act, applying the \"last-in-time\" doctrine. The court distinguished K.C. Ninan, noting it did not arise from an IBC liquidation. It held that PVVNL's appropriate path for recovering its dues was through the IBC's Section 53 waterfall mechanism, having already filed its claim with the liquidator, rather than using the electricity connection as leverage against the auction purchaser. Consequently, the court quashed PVVNL's coercive order and directed the immediate installation of the new electricity connection, clarifying that the discom's dues would be processed by the liquidator under the IBC framework.</p>\n\n<p>This ruling reiterates the IBC's foundational role as a comprehensive framework designed to re-order creditor rights and insulate fresh investments from the baggage of the past. By preventing discoms from hindering the operationalization of assets due to previous owners' debts, the judgment significantly enhances the credibility of the insolvency process and instills confidence in auction purchasers that their acquired assets can be utilized without inherited financial encumbrances.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/ibc-vs-electricity-act-discoms-cant-burden-new-buyers.jpg"
  },
  {
    "title": "Speak Now or Forever Hold Your Peace: Bombay HC Clears ICC, Denies Tarapur Doctor a Second Bite After Year-Long Silence Makes Waiver Win the POSH Fight",
    "description": "<p>The Bombay High Court has affirmed that silence during a sexual harassment inquiry can amount to a waiver of procedural objections, denying a doctor's petition to quash an Internal Complaints Committee (ICC) report. In the case of Dr Shyam Bihari v. Nuclear Power Corporation of India Ltd., the court emphasized that participating in proceedings without protest precludes subsequent challenges to the ICC's composition or procedure, and reiterated the correct interpretation of the Sexual Harassment of Women at Workplace (Prevention, Prohibition and Redressal) Act, 2013 (POSH Act).</p>\n\n<p>Dr. Shyam Bihari, a Medical Officer at NPCIL's Tarapur site, faced an inquiry after a complaint of inappropriate behavior in July 2024. An ICC was swiftly constituted, headed by a woman medical officer of the same grade as Dr. Bihari, along with other members including an external expert. After recording statements and conducting an inquiry, the ICC, applying the \"preponderance of probabilities\" standard, concluded in December 2024 that the allegations were proven, despite an earlier preliminary note observing \"insufficient evidence.\"</p>\n\n<p>Instead of submitting a representation to the disciplinary authority, Dr. Bihari petitioned the High Court in August 2025, seeking to quash the proceedings. His primary arguments centered on the Presiding Officer not being senior in rank to him, the \"external\" member having a consultancy contract with NPCIL, and an apprehension of bias due to another member living in the same building as the complainant's father. He also referenced a Department of Personnel & Training memorandum regarding the seniority of inquiry officers in general disciplinary cases.</p>\n\n<p>The High Court dismissed Dr. Bihari's petition, highlighting his year-long participation in the inquiry without raising any objections. Justice Bhobe, writing for the Bench, applied the cardinal rule of statutory interpretation, noting that Section 4(2)(a) of the POSH Act requires the Presiding Officer to be a \"senior-level woman,\" not necessarily senior in rank to the accused. The court found no material evidence of the ENT surgeon being an employee or that the neighbor-member influenced the panel. Furthermore, it clarified that the October note was an interim assessment, and the December report applied the correct standard of proof. The court also reminded the petitioner that the POSH Act provides a self-contained appeal mechanism to a court or tribunal once the disciplinary authority issues final orders, making his writ petition premature.</p>\n\n<p>This judgment serves as a critical reminder that procedural objections in an inquiry must be raised at the earliest opportunity. It reinforces that meticulously conducted ICC inquiries, adhering to the statutory checklist and principles of natural justice, will withstand judicial scrutiny, even if the Presiding Officer is not hierarchically senior to the accused, provided they meet the \"senior-level woman\" requirement. The ruling clears the path for NPCIL's disciplinary authority to proceed with determining the appropriate penalty.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/bombay-hc-upholds-icc-rejects-doctors-posh-challenge.jpg"
  },
  {
    "title": "Supreme Court: Non-Resident Companies Liable to Tax in India Even Without Permanent Office",
    "description": "<p>The Supreme Court of India recently delivered a significant judgment in the case of Pride Foramer S.A. v. Commissioner of Income Tax, clarifying that non-resident companies can be deemed to be carrying on business in India even during periods of operational inactivity, thus remaining eligible for tax deductions and liable for tax on income accruing in India.</p>\n\n<p>The case involved Pride Foramer S.A., a French offshore oil drilling company, which experienced a lull in active contracts between 1993 and 1999. During this interim, despite operating from foreign offices and having no active projects, the company engaged in business correspondence, submitted bids, incurred various business-related expenses, and claimed deductions for these along with unabsorbed depreciation. The Income Tax Department, however, disallowed these claims, asserting that the company had ceased business operations during this inactive period.</p>\n\n<p>Reversing the High Court's decision, the Supreme Court affirmed the Income Tax Appellate Tribunal's view, distinguishing a \"lull\" from a \"cessation\" of business. The Court emphasized that a company's continuous intent and efforts to secure future contracts, such as submitting bids and maintaining business correspondence, demonstrate ongoing operations, irrespective of immediate contract acquisition. Crucially, the Court clarified that the absence of a permanent establishment or conducting business solely through foreign offices does not absolve a non-resident company from tax liability in India if income accrues or arises within the country. Consequently, the Court allowed the deduction of business expenses under Section 37 and permitted the carry-forward of unabsorbed depreciation under Section 32(2) of the Income Tax Act.</p>\n\n<p>This landmark judgment adopts a pragmatic and modern approach to assessing non-resident companies, reinforcing the principle of \"substance over form.\" It establishes that business continuity and entitlement to tax benefits are determined by a company's overarching conduct and intent, rather than merely by active contract periods or physical presence within India, thereby aligning with globalized trade dynamics.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/sc-non-resident-companies-taxable-in-india-without-office.jpg"
  },
  {
    "title": "Lull vs. Cessation: Supreme Court Defines “Carrying on Business” for Non-Residents",
    "description": "<p>In a landmark judgment concerning Pride Foramer S.A. v. Commissioner of Income Tax & Anr., the Supreme Court of India has provided essential clarification on the concept of \"carrying on business\" for non-resident companies. The core issue revolved around whether a non-resident entity, during a period without active contracts or a physical presence in India, could still be considered to be carrying on its business and thus be eligible to claim deductions for business expenditure under Section 37 and carry forward unabsorbed depreciation under Section 32(2) of the Income Tax Act, 1961. This ruling significantly impacts how business continuity is assessed, particularly for project-based industries in a globalized economy.</p>\n\n<p>The appellant, Pride Foramer S.A., a French oil drilling company, had an \"interregnum\" period (1996-2000) after an initial 10-year contract expired in 1993, during which it had no active drilling operations in India. Despite this inactivity, the company maintained business correspondences with ONGC from its offices abroad and submitted a bid for a new oil exploration contract, which it eventually secured in 1998. While the Assessing Officer and CIT (Appeals) disallowed tax benefits, asserting the company was not \"carrying on any business,\" the Income Tax Appellate Tribunal (ITAT) reversed these findings. The ITAT distinguished between a \"temporary lull\" and \"cessation of business,\" recognizing the appellant's ongoing efforts. However, the High Court of Uttarakhand overturned the ITAT, linking \"carrying on business\" to the presence of a permanent office or an active contract in India.</p>\n\n<p>The Supreme Court, overturning the High Court's decision, unequivocally affirmed that the appellant was indeed \"carrying on business\" during the relevant period. The Court emphasized that the company's continuous business correspondences and active bidding for new contracts demonstrated a clear \"intention to carry on business\" from the perspective of a prudent businessman, constituting a \"lull in business\" rather than a complete cessation. Crucially, the Supreme Court declared the High Court's linkage of \"carrying on business\" with the existence of a \"permanent establishment\" (PE) as \"wholly fallacious.\" It clarified that while a PE is relevant for Double Tax Avoidance Agreements (DTAA), it is not a mandatory prerequisite under Indian tax law for a non-resident to be deemed as carrying on business and thus liable for tax on income from a \"business connection in India.\" The Court further noted that the High Court's restrictive view was \"wholly anachronistic\" in the contemporary era of globalization and contrary to the principle of \"ease of doing business.\"</p>\n\n<p>This judgment provides much-needed clarity, adopting a pragmatic and commercially aware approach to tax law. By distinctly separating a temporary business lull from permanent cessation and delinking the concept of \"carrying on business\" from the rigid requirement of a physical \"Permanent Establishment,\" the Supreme Court has set a vital precedent. The decision champions the intention and continuous efforts of an assessee, such as maintaining client relationships and bidding for new work, as integral to business continuity. This aligns Indian tax jurisprudence with global commercial realities, offering significant protection to businesses during unavoidable inactive periods and fostering an environment conducive to international trade and investment.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/supreme-court-clarifies-carrying-on-business-for-non-residents.jpg"
  },
  {
    "title": "Family Members Have First Right to Buy Ancestral Property, Says Bombay High Court",
    "description": "<p>The Bombay High Court has affirmed the preferential right of family members to purchase ancestral property, particularly when it remains undivided, even if the selling co-parcener transfers their share to an outsider. This significant ruling arose from a dispute involving ancestral agricultural lands in Beed district, Maharashtra, where certain members of a joint Hindu family (Rathod family) sold portions of undivided property to external purchasers without offering it to the other co-parceners (Selukar family). The plaintiffs, the Selukar family, invoked Section 22 of the Hindu Succession Act, 1956, to assert their right of pre-emption, a claim previously upheld by the Trial Court.</p>\n\n<p>Justice Shailesh P. Brahme's analysis established that the properties were indeed undivided joint family holdings, confirming the plaintiffs and the original sellers as co-parceners. The Court clarified that while Section 22 specifically references Class I heirs, in the context of undivided joint family property, the right of pre-emption extends to all co-parceners sharing a common ancestral interest. A pivotal aspect of the judgment was the ruling that a separate declaration to set aside the sale deeds was not required; title automatically vests in the plaintiffs upon their deposit of the purchase consideration, as per Order XX Rule 14 of the Code of Civil Procedure. The High Court also upheld the lower court's decision to extend the payment timeline, recognizing that appellate proceedings had effectively stayed the original decree. Furthermore, the Court rejected the purchasers' reliance on Section 44 of the Transfer of Property Act, as they had not sought partition.</p>\n\n<p>Ultimately, the High Court dismissed both appeals, thereby confirming the concurrent findings of the Trial Court and the First Appellate Court. The plaintiffs were directed to deposit the purchase price, along with 6% simple interest, within ninety days. This decision is crucial as it reinforces the pre-emptive rights of co-parceners in undivided ancestral property, streamlining the process by removing the necessity of first canceling sale deeds and providing clarity on the application of Section 22 in such scenarios. It also highlights the judiciary's discretion to adjust timelines for decree execution when appeals delay proceedings.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/bombay-hc-family-has-first-right-to-buy-ancestral-property.jpg"
  },
  {
    "title": "Karnataka Domestic Workers (Social Security and Welfare) Bill, 2025: How Karnataka Plans to Rescue, Register and Retire Domestic Workers with Dignity",
    "description": "<p>The Karnataka Government has introduced the Karnataka Domestic Workers (Social Security and Welfare) Bill, 2025, an ambitious legislative effort aimed at formalizing the employment of an estimated 10-12 lakh domestic workers across the state. This landmark draft law seeks to elevate domestic work to the status of formal sector employment, providing workers with dignity, social security, and comprehensive welfare benefits. If enacted, Karnataka would become the first major state to legally recognize the home as a regular workplace, ensuring protection for housemaids, cooks, nannies, caregivers, gardeners, and gig helpers.</p>\n\n<p>A cornerstone of the Bill is the mandatory requirement for a written employment agreement, mirroring a state-notified model format. This agreement, detailing wages, hours, leave, and welfare contributions, must supersede any oral or informal understanding, with its absence constituting a punishable offense. Furthermore, all domestic workers, employers, placement agencies, and digital platforms must register on a government portal within thirty days. Workers will receive a three-year renewable certificate with a unique identification number, granting access to benefits, while employers failing to register will be barred from hiring and agencies supplying unregistered workers face prosecution.</p>\n\n<p>The Bill defines \"domestic work\" and \"domestic worker\" broadly, covering all chores in various residential settings and encompassing full-time, part-time, live-in, and migrant staff, including those hired via apps. \"Employer\" extends beyond the primary householder to any adult with ultimate control, establishing joint liability with agencies. Registered workers will gain statutory rights beyond the Minimum Wages Act, including notified minimum wages, overtime pay, a maximum 48-hour work week, weekly days off, annual leave, maternity and paternity benefits, accident compensation, and state-run health coverage. Discrimination based on caste, religion, gender, or language is explicitly outlawed, and practices like confining workers or seizing their phones can lead to charges of illegal confinement.</p>\n\n<p>To finance these provisions, the legislation establishes a tripartite Karnataka State Domestic Workers Social Security and Welfare Board, comprising representatives from government, worker unions, employers, welfare associations, and digital platforms. This Board will administer a dedicated Fund, sustained by registration fees, a periodic five percent welfare cess from employers and agencies, fines, and government grants. The Bill also empowers inspectors, acting as labour-cum-social security officers, to investigate complaints of child employment or sexual exploitation, rescue minors, and demand records, possessing powers akin to a civil court for evidence gathering.</p>\n\n<p>Disputes, excluding sexual harassment cases which fall under the POSH Act, 2013, will be mediated by district-level grievance redress committees, with the option to escalate to the State Board for binding orders and appeals to the Karnataka High Court. The Bill prescribes steep penalties for non-compliance, with escalating fines and imprisonment terms for repeat offenders. Grave offenses like employing children or trafficking women for immoral purposes carry severe non-negotiable minimum prison sentences. Notably, the Bill overrides any existing contract or law offering lower protection, while allowing workers to bargain for better terms and ensuring the co-application of other relevant labour statutes.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/karnataka-domestic-workers-bill-2025.jpg"
  },
  {
    "title": "Orissa HC: EPC Disputes Can’t Hide Under MSME Statutory Arbitration Umbrella : VR Tank Award Set Aside",
    "description": "<p>The Orissa High Court has delivered a significant judgment, setting clear boundaries for the application of the Micro, Small and Medium Enterprises Development Act, 2006 (MSMED Act) concerning complex Engineering, Procurement, and Construction (EPC) contracts. In the case of Indian Oil Corporation Ltd. v. Adarsh Nobel Corporation Ltd., the Court quashed a ₹2.43 crore arbitration award that had been issued by the MSME Facilitation Council, Cuttack, against IOCL. The ruling unequivocally states that composite, turnkey \"works contracts,\" such as EPC agreements, fall outside the statutory conciliation and arbitration framework designed for buyers and sellers of goods or services under the MSMED Act.</p>\n\n<p>The dispute originated from a lumpsum EPC contract awarded by IOCL to Adarsh Nobel Corporation Ltd. (ANCL) in November 2017 for a VR storage tank at its Paradip Refinery. Following the abrupt cessation of work by ANCL in June 2018 and subsequent termination by IOCL in early 2019, ANCL registered itself as a small enterprise under the MSMED Act in January 2021, post-termination. It then invoked Section 18 of the Act before the MSME Facilitation Council, which subsequently issued an award directing IOCL to pay ANCL significant compensation and release its bank guarantees.</p>\n\n<p>IOCL challenged this award, ultimately pursuing a constitutional writ petition after withdrawing a Section 34 challenge. The company argued that the Facilitation Council lacked inherent jurisdiction (coram non judice) as a composite works contract is fundamentally distinct from a sale of goods or pure service agreement, and therefore outside the MSMED Act's purview. It further highlighted ANCL's post-termination MSME registration and the contract's unsuitability for the statute. ANCL, conversely, contended that the Act's language was expansive, registration was directory, and an alternative remedy existed.</p>\n\n<p>Justice Sanjeeb K. Panigrahi meticulously examined the tender documents, confirming the contract's nature as a \"textbook EPC\" involving design, engineering, supply, fabrication, civil works, testing, and commissioning. Citing established precedents, the Court held that such composite obligations are sui generis and cannot be artificially bifurcated into goods and services to fit the MSMED Act. The Court further clarified that a tribunal acting without inherent jurisdiction constitutes a classical exception to the alternative remedy rule, making the award \"stillborn\" and invalid from its inception. Consequently, the High Court set aside the award and declared the ongoing execution petition infructuous, while leaving parties free to pursue remedies under general law.</p>\n\n<p>This judgment serves as a critical clarification for MSMEs and larger entities alike. It reiterates that the MSME Facilitation Council is intended for straightforward sale or service disputes, not for complex, performance-oriented EPC claims. For purchasers, especially public sector undertakings, it provides reassurance that works contracts will not be arbitrarily brought under the MSMED Act simply because a counterparty later acquires an MSME registration. The ruling underscores the fundamental principle that jurisdiction is paramount, and an award issued without it is void.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/orissa-hc-epc-contracts-outside-msme-arbitration-scope.jpg"
  },
  {
    "title": "IBC and Homebuyers Protection",
    "description": "<p>The article details the evolving landscape of homebuyers' rights under India's Insolvency and Bankruptcy Code (IBC). A pivotal 2018 amendment recognized real estate allottees as financial creditors, granting them participation and voting rights in the Committee of Creditors (CoC) during Corporate Insolvency Resolution Processes (CIRP). This move followed significant protests by homebuyers, who were initially excluded from meaningful engagement, leading to earlier regulatory adjustments by the Insolvency and Bankruptcy Board of India (IBBI) to facilitate their claims. Courts have consistently held that delays in property handover constitute a default under the IBC, necessitating developers to either deliver or return funds.</p>\n\n<p>Despite this progress, the Supreme Court's validation of the 2018 amendment in Pioneer Urban Land and Infrastructure Ltd. v. Union of India (2019) categorized homebuyers as unsecured creditors. This classification has been criticized for limiting their recovery prospects and decision-making power in comparison to secured financial institutions, which typically dominate the CoC. Practical administration reveals ongoing inequities, including the exclusion of homebuyers who fail to file claims on time and a significant disparity in interest rates, with homebuyers receiving a capped 8% per annum while lenders impose much higher rates. Regulatory measures, such as IBBI's Regulation 4-E, further empower project lenders by requiring substantial CoC approval for possession, potentially exacerbating homebuyer suppression.</p>\n\n<p>The Real Estate (Regulation and Development) Act (RERA), 2016, complements the IBC by mandating transparency, timely project completion, and offering recourse for delays. However, a deeper integration of these frameworks is needed. Legal scholarship and emerging jurisprudence advocate for elevating homebuyers to secured creditor status, citing their proprietary interest in specific flats and the statutory debt arising from non-delivery under RERA. While innovative judicial solutions like 'Reverse CIRP' have emerged to protect possession rights, a definitive consensus on granting homebuyers secured status remains elusive.</p>\n\n<p>Recent trends from 2023-2025 indicate some positive shifts, with the Supreme Court acknowledging verified claims for flat possession and urging the inclusion of unfiled but recorded claims. Nevertheless, systemic challenges persist, fueled by fragmented homebuyer groups, procedural complexities, opaque valuations, and the financial dominance of project lenders. Comprehensive reforms are crucial, including enhancing homebuyers' voting power, legally recognizing their secured status, equalizing interest rates, and empowering regulators to enforce transparency and penalize malfeasance, ultimately ensuring homebuyers' constitutional right to shelter is effectively upheld within the insolvency framework.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/ibc-and-homebuyers-evolving-rights-and-legal-protections.jpg"
  },
  {
    "title": "Rajasthan HC: Assignment under section 5 SARFAESI survives even if NPA tag quashed, guarantors can’t reopen decade-old ARC deal.",
    "description": "<p>The Rajasthan High Court, Jodhpur Bench, recently delivered a significant ruling affirming that a debt assignment under Section 5 of the SARFAESI Act, 2002, maintains its validity even if the Non-Performing Asset (NPA) classification, which triggered subsequent enforcement actions, is later quashed. In Harendra Singh Rathore & Ors. v. State Bank of India & Ors., Justice Rekha Borana refused to undo a 2014 debt assignment by SBI to Alchemist Assets Reconstruction Co., emphasizing that invalidating the NPA tag affects only Section 13 enforcement actions, not the independent prior sale of the loan under Section 5.</p>\n\n<p>This decade-long legal battle originated from a ₹24 crore debt incurred by Hotel Gaudavan Pvt. Ltd. in 2008, guaranteed by its director-shareholders. After the account became an NPA and was put up for sale, SBI assigned the debt to Alchemist ARC in 2014. Despite borrowers' attempts to challenge the proceedings through various forums, including a DRT ruling in 2015 that declared the original NPA classification illegal, the debt's ownership remained with the ARC. The guarantors subsequently sought to declare the 2014 assignment void, arguing that the quashing of the NPA rendered all subsequent actions, including the assignment, invalid.</p>\n\n<p>The High Court dismissed the guarantors' petition, primarily citing the principle of res judicata, as identical pleas had been rejected multiple times by various judicial bodies, up to the Supreme Court. The court reiterated that while Section 13 of the SARFAESI Act requires an NPA declaration for enforcement, Section 5, which deals with the transfer of financial assets, does not. Therefore, the 2015 DRT order invalidating the NPA only impacted possession proceedings, not the earlier, distinct assignment deed. Relying on the Supreme Court's ICICI Bank v. Official Liquidator of APS Star Industries judgment, the court affirmed that a debt is an asset transferable by a bank without borrower consent, irrespective of the NPA tag's correctness. The court also noted the availability of alternative statutory remedies for challenging recovery orders.</p>\n\n<p>This ruling provides crucial clarity and reassurance for lenders and Asset Reconstruction Companies. It firmly establishes that a bank's right to assign its loan under Section 5 of the SARFAESI Act is an independent power, not contingent on the ultimate fate of its internal NPA classification or the successful execution of Section 13 enforcement measures. Once a debt is assigned, courts will generally uphold the finality of that contract, strengthening the framework for managing and resolving bad assets within the financial system.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/rajasthan-hc-upholds-sarfaesi-assignment-despite-npa-quash.jpg"
  },
  {
    "title": "IBC is for genuine roofs, not punters: SC lays down new home-buyer litmus test",
    "description": "<p>The Supreme Court of India, in a landmark ruling on September 12, 2025, significantly redefined the eligibility criteria for home-buyers seeking to initiate corporate insolvency proceedings under the Insolvency & Bankruptcy Code (IBC). In the case of Mansi Brar Fernandes v. Shubha Sharma & Ors. and connected appeals, a two-Judge Bench distinguished between genuine end-users seeking shelter and speculative investors primarily driven by profit. The Court affirmed that the IBC is a \"remedial shield for sick companies and genuine home-buyers, not a sword for risk-free windfalls.\"</p>\n\n<p>Central to the judgment, the Supreme Court held that buyers who enter into buy-back or assured-return schemes are to be considered \"speculative investors\" and, therefore, cannot trigger corporate insolvency proceedings against developers. This ruling effectively bars individuals treating apartments as financial derivatives from leveraging the IBC for debt recovery. Additionally, the Court addressed the technical objection regarding the 2019 amendment, which mandates collective action by at least 100 allottees (or 10%), setting aside its application on equity grounds where the National Company Law Tribunal (NCLT) had already reserved orders prior to the amendment's enforcement. The bench also issued a comprehensive 12-point charter, directing the Centre and States to fill tribunal vacancies, establish a revival fund, strengthen RERA, and safeguard the constitutional right to shelter.</p>\n\n<p>The dispute originated from cases like Ms. Mansi Brar Fernandes, who invested in flats under an MoU granting the developer a buy-back option at a significantly higher price within a year, and Ms. Sunita Agarwal, who was promised an assured return or a flat. Both, after developers defaulted, sought to invoke IBC under Section 7. The NCLAT had previously reversed NCLT admissions, branding them \"speculative investors.\" The Supreme Court's reasoning highlighted that the IBC's purpose is \"revival-oriented, not a debt-recovery mechanism.\" It established a non-exhaustive checklist for tribunals, examining factors such as the nature of the contract, deviation from RERA model agreements, insistence on usurious interest, and absence of steps towards possession, to identify genuine buyers versus profit-chasers. Applying these, the Court concluded that the appellants were indeed pursuing profit through \"financial derivatives masquerading as real estate\" rather than seeking homes.</p>\n\n<p>Regarding the 2019 ordinance requiring collective action, the Court clarified its applicability to pending, non-admitted petitions. However, it emphasized that where an NCLT had already reserved judgment, a buyer could not be expected to comply with an impossible demand, allowing subsequent compliance in appeal to cure the defect on equitable grounds. This comprehensive judgment thus fortifies the insolvency process for its intended purpose: the resurrection of viable projects and the protection of genuine home-buyers. It sends a clear message to investors prioritizing high-yield bets that the IBC is not a private debt-recovery mechanism, redirecting them to alternative legal avenues like RERA, consumer fora, or civil courts for redressal.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/supreme-court-defines-genuine-vs-speculative-home-buyers.jpg"
  },
  {
    "title": "Orissa HC slams Cuttack bank for holding back gratuity over a loan guarantee—reaffirms Section 4(6) is the only key to forfeit gratuity dues.",
    "description": "<p>The Orissa High Court, in a Division Bench ruling on September 20, 2025, emphatically reiterated that gratuity can only be forfeited under the precise conditions stipulated in Section 4(6) of the Payment of Gratuity Act, 1972. The court admonished the Cuttack Central Cooperative Bank Ltd. for unlawfully withholding a retired employee's gratuity over her role as a personal guarantor for a defaulted loan, underscoring that superannuation does not permit such set-offs.</p>\n\n<p>The case originated when a Deputy Manager, who retired in 2010 after superannuation with an unblemished record, was denied her gratuity. The bank justified its action by citing her liability as a guarantor for a loan that later went unpaid. This decision was consistently overturned by the Controlling Authority, the Appellate Authority, and a Single Bench of the Orissa High Court before reaching the Division Bench as a writ appeal.</p>\n\n<p>The High Court dismissed the bank's appeal, emphasizing that Section 4(6) of the Act, which begins with a non-obstante clause, permits forfeiture only to the extent of damage or loss suffered by the employer if the employee was \"terminated\" for a wilful act, omission, or negligence causing such damage. Retirement on superannuation, the court clarified, is the antithesis of termination for misconduct, thus eliminating the statutory trigger for forfeiture. The court further held that introducing a guarantor's civil liability into the Act would constitute an unauthorized judicial expansion of its scope, reinforcing that gratuity is a statutory right earned through service, not a security deposit for credit.</p>\n\n<p>Concluding that three statutory forums had already reached the same conclusion without perversity, irrationality, or exceeding statutory remit, the court found no grounds for interference. This judgment serves as a critical reminder to all employers that the provisions of Section 4(6) of the 1972 Act are the sole gateway for gratuity forfeiture, strictly limited to proven misconduct and not extendable to civil liabilities like loan guarantees. The bank was consequently ordered to release the gratuity forthwith.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/orissa-hc-gratuity-cannot-be-withheld-for-loan-guarantee.jpg"
  },
  {
    "title": "Arms Act, 1959: Renewal is the Norm, Refusal the Exception, Rules Madras High Court",
    "description": "<p>The Madras High Court, in a significant ruling by its Madurai Bench, has clarified that while possessing a firearm is a regulated privilege under the Arms Act, 1959, the renewal of an existing licence, especially after peaceful use, should be considered the norm. Refusal of renewal, the Court asserted, must be based on explicit, rational, and case-specific findings, shifting the burden from the applicant to the licensing authority to provide compelling reasons.</p>\n\n<p>This judgment arose from a petition filed by Magudapathi, an ordinary citizen who held a smooth bore gun licence since 2021 for crop protection and sport, which had been routinely renewed once. His application for a second renewal in 2024 was denied by the District Magistrate cum District Collector, Dindigul, solely on the grounds that Magudapathi was facing prosecution under Section 304A of the Indian Penal Code for a fatal motor vehicle accident. The Collector deemed this a threat to \"public safety,\" prompting Magudapathi to challenge the decision in the High Court.</p>\n\n<p>Justice G.R. Swaminathan, examining Sections 13, 14, and 15 of the Arms Act, 1959, highlighted Section 15(3), which mandates that a licence \"shall, unless the licensing authority for reasons to be recorded in writing otherwise decides, be renewable.\" The Court emphasized that this provision converts the initial privilege into an expectancy of renewal, which can only be defeated by reasons that meet the standards of Section 14, pertaining to refusal. The High Court found the Collector's justification \"woefully insufficient,\" stating that a prosecution for negligent driving (Section 304A IPC) is distinct from firearm-related misconduct, nor does it indicate an individual is of unsound mind or unfit as per Section 14. Furthermore, the Court reiterated that while alternative remedies exist, it can intervene via writ jurisdiction when an impugned order is patently illegal.</p>\n\n<p>Consequently, the High Court quashed the Collector's order and directed the renewal of Magudapathi’s gun licence for five years, subject to standard conditions. This ruling serves as a crucial reminder that administrative discretion in weapon licensing tightens once a citizen has demonstrated trustworthy conduct, safeguarding individual expectation and ensuring a principled application of the Arms Act against arbitrary denials based on unrelated criminal proceedings.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/madras-hc-renewal-the-rule-refusal-the-exception-arms-act-1959.jpg"
  },
  {
    "title": "Dependents Beyond Legal Heirs Entitled to Compensation: MP High Court",
    "description": "<p>The Madhya Pradesh High Court, in a landmark decision in Smt. Saroj & Others v. Rajendra Prasad Patel & Others, significantly broadened the interpretation of \"legal representative\" under the Motor Vehicles Act, 1988. The case addressed whether individuals not strictly legal heirs, but demonstrably financially and emotionally dependent on the deceased, are entitled to compensation for a motor accident death. The High Court adopted a liberal and humanitarian approach, emphasizing that the Act is beneficial legislation designed to provide relief to victims and their dependents, transcending the technicalities of personal law.</p>\n\n<p>The case originated from a motor accident where Ramakant Patel died. His brother's widow, Smt. Saroj, and her daughter filed a claim, asserting that Ramakant had supported them financially and emotionally after her husband's demise. The Motor Accident Claims Tribunal rejected their claim, holding that as they were not legally wedded wife or biological child, they could not be legal heirs. However, the High Court overturned this, referencing the Supreme Court's ruling in N. Jayasree v. Cholamandalam MS General Insurance Co. Ltd., which states that \"legal representative\" is not confined to legal heirs but includes anyone demonstrating financial dependency, even without a formal marital relationship.</p>\n\n<p>The High Court affirmed that evidence clearly showed the deceased supported Smt. Saroj and her daughter, thus qualifying them as dependents and \"legal representatives\" under Section 166 of the Act. This judgment marks a progressive development in accident compensation jurisprudence, acknowledging the evolving social realities where dependency and familial bonds may extend beyond conventional definitions of marriage or heirship. It underscores that substantive justice should prioritize proven dependency and loss over rigid adherence to formal relationships, ensuring the compassionate intent of the Motor Vehicles Act is upheld.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/mp-hc-expands-legal-representative-in-accident-claims.jpg"
  },
  {
    "title": "Section 17 or Article 226? Kerala High Court Slams the Door on Writ Route in SARFAESI",
    "description": "<p>The Kerala High Court, through a Division Bench, has unequivocally restated that borrowers cannot bypass the specialized statutory remedy under Section 17 of the Securitisation and Reconstruction of Financial Assets and Enforcement of Security Interest Act, 2002 (SARFAESI Act) by directly filing a writ petition under Article 226 of the Constitution. This ruling emerged from a case involving a ₹16 lakh business loan from Kerala State Cooperative Bank, where a borrower sought the return of physically possessed mortgaged property on mere part-payment.</p>\n\n<p>The dispute arose after Jishith Kumar defaulted on a loan, leading the bank to classify his account as an NPA and subsequently take physical possession of the mortgaged property under Sections 13 and 14 of the SARFAESI Act. Despite having previously failed to honor a One Time Settlement (OTS) scheme facilitated by an earlier writ petition, the borrower filed a fresh writ, seeking restructuring and immediate release of the asset. A Single Judge initially directed the bank to return possession upon a payment of ₹4 lakh and an instalment plan, which the bank contested as exceeding judicial authority.</p>\n\n<p>The Division Bench, hearing the bank's appeal, meticulously examined the SARFAESI framework and numerous Supreme Court precedents. It concluded that the Single Judge's order effectively rewrote the contract and statute, and that the High Court, exercising writ jurisdiction, could not sit in appeal over a meticulously followed statutory process. The bench emphasized that the proper and sole avenue for the borrower to challenge the bank's actions after possession was taken was under Section 17 before the Debts Recovery Tribunal (DRT). It dismissed the argument that a bank's informal concession could override substantive statutory rights, affirming that equity follows the law.</p>\n\n<p>Consequently, the Division Bench set aside the Single Judge's judgment in its entirety and dismissed the writ petition as not maintainable. While reaffirming the judiciary's role in policing its own boundaries and prioritizing statutory discipline over judicial equity, the court clarified that its order does not prevent the borrower from approaching the DRT under Section 17 of the SARFAESI Act. This decision serves as a critical reminder for borrowers that the High Court is not the first forum for challenging SARFAESI proceedings, reinforcing the legislative intent of swift, non-interventionist recovery mechanisms for financial institutions.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/kerala-hc-no-writ-when-section-17-sarfaesi-remedy-exists.jpg"
  },
  {
    "title": "A Breach Too Far: Court Exonerates Insurer After Agricultural Tractor Used for Wedding Procession",
    "description": "<p>A protracted legal battle spanning over two decades, stemming from a 2004 tractor accident, recently concluded with a significant judgment by the Madhya Pradesh High Court. The case centered on the New India Insurance Company's liability when an agricultural tractor, insured solely for farming purposes, was involved in an accident while transporting wedding guests (Baratis), resulting in injuries to two pedestrians.</p>\n\n<p>The incident occurred on May 29, 2004, when a speeding tractor collided with Shivram Chaudhary and Sukhlal Chaudhary, causing various injuries. The 3rd Additional Motor Accidents Claims Tribunal initially awarded compensation of ₹30,000 to Shivram and ₹10,000 to Sukhlal, directing the insurer to pay with the liberty to recover the amount from the vehicle's owner and driver (a \"pay and recover\" order).</p>\n\n<p>Aggrieved by the tribunal's decision, three appeals were filed: Shivram Chaudhary sought enhanced compensation, while the insurance company challenged its liability entirely. The insurer argued a fundamental breach of policy terms, citing that the tractor, insured for agricultural use, was illegally transporting passengers. Furthermore, the driver allegedly lacked a valid license. The claimants contended the awarded compensation was insufficient given their sustained injuries and economic losses.</p>\n\n<p>The High Court, after meticulous examination, sided with the insurance company. It emphasized that the tractor's use for carrying wedding guests constituted a clear and fundamental deviation from its insured purpose, altering the risk profile significantly. Citing Supreme Court precedents, the court affirmed that insurers are not liable when vehicles are used in direct violation of core policy conditions, particularly when carrying unauthorized passengers. Consequently, the \"pay and recover\" doctrine was deemed inapplicable in this instance due to the deliberate and fundamental nature of the policy breach.</p>\n\n<p>While exonerating the insurance company, the High Court acknowledged the inadequacy of Shivram Chaudhary's original compensation. It enhanced his award to ₹50,000, factoring in his physical pain, medical expenses, and long-term impact on his livelihood. The final judgment directed the owner and driver of the tractor to jointly and severally deposit the full compensation amount, including the enhanced sum and interest, within 30 days. The insurance company was relieved of all liability, with provisions for refunding any amounts already deposited and recovering any sums paid to the claimant from the owner and driver.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/tractor-misuse-nullifies-insurance-mphcs-key-ruling.jpg"
  }
]