[
  {
    "title": "Tribunal Deems Procedural Lapses Curable, Admits Insolvency Plea Against Corporate Debtor",
    "description": "<p>The National Company Law Tribunal (NCLT), Mumbai Bench-II, admitted an insolvency petition filed by Pegasus Assets Reconstruction Pvt. Ltd. against Dee Plone Polyester Pvt. Ltd. under Section 7 of the Insolvency and Bankruptcy Code, 2016 (IBC), concerning a default exceeding ₹37 crore. The ruling underscores the tribunal's stance that demonstrable debt and default should take precedence over procedural irregularities.</p>\n\n<p>The case originated from loan facilities sanctioned by Dombivli Nagari Sahakari Bank Ltd. (DNS Bank) to Dee Plone Polyester Pvt. Ltd., secured by hypothecation and mortgage deeds. After the Corporate Debtor defaulted, DNS Bank classified the loan as an NPA and subsequently assigned the debt to Pegasus Assets Reconstruction Pvt. Ltd. As of October 16, 2023, the default amounted to ₹37.35 crore, which the Corporate Debtor acknowledged in audited financial statements and email correspondence.</p>\n\n<p>The NCLT concluded that procedural objections concerning stamping, registration, and authorization lapses were curable and did not invalidate the insolvency petition. It emphasized that acknowledgment of debt extends the limitation period and that the core focus under Section 7 of the IBC remains establishing the existence of financial debt and default. The tribunal dismissed allegations of malicious intent and reinforced the role of Asset Reconstruction Companies (ARCs) in pursuing CIRP against defaulting borrowers. The decision reinforces the principle that the IBC is intended as a timely resolution mechanism focused on debt and default rather than being derailed by technical objections.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/nclt-admits-insolvency-plea-curable-lapses-clarified.jpg"
  },
  {
    "title": "BIS Issues Fresh Rules for Digital TV Receivers – 26 Oct 2025 Deadline Looms",
    "description": "<p>The Bureau of Indian Standards (BIS) has issued a circular effective 18 September 2025, mandating compliance with IS 18112:2025 \"Digital Television Receiver for Satellite Broadcast Transmission Specification (First Revision)\" for all plasma, LCD, and LED televisions sold in India. This is in addition to the existing safety standard IS 616:2017 / IEC 60065:2014, enforced under the Compulsory Registration Scheme (CRS). The deadline for compliance is 26 October 2025.</p>\n\n<p>The new regulation requires all television sets, both new and existing models, to incorporate a digital satellite receiver compliant with IS 18112 while continuing to meet the safety requirements of IS 616. A single R-number will now cover both standards, replacing separate satellite-only certifications. While labs can accept IS 18112:2022 test data until 30 December 2025, manufacturers must provide a notarized declaration committing to upgrade to the 2025 version.</p>\n\n<p>Existing safety-only licensees have until 25 September 2025 to submit inclusion requests with updated test reports. Those with models already containing evaluated satellite tuners can use an online module referencing the original IS 616 report. Non-compliant models will be removed from licenses after 26 October 2025, potentially leading to registration cancellation. Manufacturers using the 2022 standard have until 30 December 2025 to declare their transition to the 2025 version to avoid regulatory action. New applications are encouraged to directly pursue IS 18112:2025.</p>\n\n<p>After 26 October 2025, BIS will no longer grant new or expanded licenses without satellite receiver compliance. The standard mark has been simplified to include both \"IS 616 / IEC 60065\" and \"IS 18112\" with the common R-number. Customs officials, legal-metrology authorities, and e-commerce platforms have been alerted to the conjoined mark, with shipments bearing only the old IS 616 label potentially facing detention, fines, or re-export. IS 18112:2025 includes updated definitions, allows IS / IEC 62368-1 as an alternative safety standard, removes the power-consumption clause, adds testing guidance, and specifies a mute-to-unmute button on remote controls.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/bis-tightens-rules-for-digital-tv-sets-ahead-of-oct-2025.jpg"
  },
  {
    "title": "\"Typo\" No Excuse: SC Quashes Complaint After Demand Notice Claims Double the Bounced Cheque",
    "description": "<p>The Supreme Court of India in Kaveri Plastics v. Mahdoom Bawa Bahrudeen Noorul ruled that a statutory demand notice seeking an amount that differs from the dishonored cheque's value is invalid, thus rendering a subsequent criminal complaint under Section 138 of the Negotiable Instruments Act, 1881, non-maintainable. The court emphasized a strict and technical interpretation of the law.</p>\n\n<p>The case arose from a dishonored cheque for Rs. 1,00,00,000/- issued by Kaveri Plastics to Mahdoom Bawa Bahrudeen Noorul. The subsequent demand notices incorrectly demanded Rs. 2,00,00,000/-, leading to the respondent's petition to quash the criminal complaint, which was ultimately upheld by the High Court. The Supreme Court addressed whether a demand notice survives when the amount claimed differs numerically from the dishonored cheque, even if the discrepancy is claimed to be inadvertent.</p>\n\n<p>The Supreme Court upheld the High Court's decision, asserting the necessity of a precise demand for \"the said amount of money\" as stipulated in Proviso (b) to Section 138. While a notice may include additional claims, the demand for the cheque amount must be accurate. The court found that demanding an inflated amount invalidated the notice and the associated complaint. The ruling reaffirms that meticulous adherence to the law is required for criminal prosecutions related to cheque dishonor, placing the onus on the complainant to ensure the demand notice is accurate, thereby providing the drawer with a clear and honest opportunity to settle the debt.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/sc-wrong-amount-in-demand-notice-invalidates-complaint.jpg"
  },
  {
    "title": "Supreme Court on Medical Negligence: NCDRC Cannot Create a New Case Beyond Pleadings",
    "description": "<p>The Supreme Court of India, in Deep Nursing Home and Another v. Manmeet Singh Mattewal and Others, clarified that adjudicatory forums cannot exceed the pleadings of the parties and invent a new case. The ruling emphasizes judicial discipline and clarifies the scope of liability in medical negligence cases. The court overturned the findings of the State Consumer Disputes Redressal Commission (SCDRC) and the National Consumer Disputes Redressal Commission (NCDRC), which had held doctors and a nursing home liable.</p>\n\n<p>The case originated from the death of Charanpreet Kaur and her newborn child during delivery at Deep Nursing Home. The complainant, Manmeet Singh Mattewal, alleged negligence in post-delivery care due to inadequate equipment and delayed blood arrangement, seeking substantial compensation. The SCDRC found Deep Nursing Home and Dr. Kanwarjit Kochhar negligent in post-delivery management and awarded compensation.</p>\n\n<p>On appeal, the NCDRC shifted the liability entirely to Dr. Kochhar, finding him negligent in antenatal management for not prescribing certain tests, despite acknowledging no negligence in delivery or post-delivery care. The Supreme Court found that the NCDRC overstepped its jurisdiction by creating a new case of antenatal negligence, which was not part of the original complaint. The Court cited previous rulings, emphasizing that decisions must be based on pleaded grounds and parties cannot be taken by surprise.</p>\n\n<p>Ultimately, the Supreme Court allowed the appeal, dismissing the complaint and directing Manmeet Singh Mattewal to refund ₹10,00,000/- received during the litigation, to be paid to New India Assurance Company and the doctors involved. The judgment underscores the importance of adhering to pleadings and expert medical opinions in consumer cases.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/sc-ncdrc-cannot-go-beyond-pleadings-in-med-negligence.jpg"
  },
  {
    "title": "Gauhati High Court Upholds Right to Free Books and Uniforms under the RTE Act",
    "description": "<p>The Gauhati High Court, in Master Rehan Barai & Anr. v. State of Assam & Ors., reaffirmed the Right of Children to Free and Compulsory Education Act, 2009 (RTE Act), directing that children admitted under Section 12(1)(c) are entitled to free textbooks and uniforms, in addition to free admission. This ruling stemmed from a case where children were denied regular classes due to their parents' inability to pay for these materials, despite being admitted under the RTE Act.</p>\n\n<p>The school authorities agreed to provide the books and uniforms, with the understanding that the State Government would reimburse the costs under Section 12(2) of the RTE Act. The Court referenced precedents, including the Supreme Court's ruling in Society for Unaided Private Schools of Rajasthan v. Union of India, which upheld the validity of Section 12(1)(c) and emphasized the State's duty to ensure universal elementary education.</p>\n\n<p>Justice Kaushik Goswami directed the school to provide the necessary materials and further ordered that remedial classes be arranged to help the children catch up with their peers, given the classes they had missed. This decision reinforces the substantive nature of the right to education, ensuring that children are equipped with the tools necessary for meaningful participation. The judgment underscores the importance of accountability for private schools operating under the RTE mandate and the State's role in timely reimbursement and strict compliance monitoring to ensure genuinely free and accessible education for all children.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/gauhati-hc-free-books-uniforms-under-rte-a-right.jpg"
  },
  {
    "title": "Inter-operable Regulatory Sandbox (IoRS): A New Era of Cross-Sectoral FinTech Innovation",
    "description": "<p>India has launched the Inter-operable Regulatory Sandbox (IoRS) to foster innovation in the financial sector. This unified framework allows innovators to test hybrid financial products and services that span multiple regulatory domains through a single-window environment, streamlining compliance and accelerating innovation. This eliminates the need for separate engagements with individual regulators.</p>\n\n<p>The IoRS was conceived by the Inter-Regulatory Technical Group on FinTech (IRTG on FinTech) and the Financial Stability and Development Council. It represents a collaborative effort between financial sector regulators and key government stakeholders. The initiative establishes a framework involving a Principal Regulator (PR) and Associate Regulators (ARs), based on the dominant feature of the product being tested. Applications are submitted through the RBI FinTech Department for preliminary review.</p>\n\n<p>The IoRS is open to a broad range of participants, including financial institutions, FinTech companies, and startups. Foreign FinTechs entering India and Indian FinTechs with global ambitions can also participate. Applications are accepted on-tap, and following successful testing, entities must obtain necessary approvals before commercial launch. The IoRS signifies a paradigm shift by providing a coordinated regulatory oversight, thereby setting the stage for the next phase of India’s FinTech growth, aligning with global best practices.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/india-launches-iors-cross-sector-fintech-sandbox.jpg"
  },
  {
    "title": "Pending Section 37 Appeal Without Stay Does Not Justify Deferring Execution: Supreme Court Order in Chakardhari Sureka v. Prem Lata Sureka",
    "description": "<p>The Supreme Court of India, in a recent order in Chakardhari Sureka v. Prem Lata Sureka, addressed the executability of an arbitral award when a Section 37 appeal is pending but no stay order has been issued. The court clarified that the mere pendency of a Section 37 appeal does not justify an executing court in adjourning execution proceedings after a Section 34 application has been dismissed and no stay on the award has been granted.</p>\n\n<p>The case arose after an arbitral award was granted to Chakardhari Sureka. Prem Lata Sureka's objection under Section 34 was rejected by the Delhi High Court. Subsequently, a Section 37 appeal was filed, but no interim stay order was passed against the award. The Execution Court then adjourned the hearing on the grounds that the appeal was pending, prompting the appeal to the Supreme Court.</p>\n\n<p>The Supreme Court acknowledged the disagreement between parties regarding the award's resistance during execution, but emphasized that the absence of an interim stay order allows the execution court to proceed. While the Execution Court can examine objections to executability, it cannot defer the execution solely because a Section 37 appeal is pending without a stay.</p>\n\n<p>The Supreme Court disposed of the appeal, clarifying that the Execution Court is free to proceed with the execution of the award, subject to any future interim order passed in the Section 37 appeal. Any objections to executability should be addressed in accordance with the law, providing both parties with an opportunity to be heard. The order reaffirms that dismissal of a Section 34 application without a stay in the Section 37 proceeding renders the award enforceable, and the executing court cannot delay execution based solely on the pending appeal.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/sc-no-stay-in-sec-37-appeal-execution-can-proceed.jpg"
  },
  {
    "title": "Rule 33 as a Regulatory Shock-Absorber: Legal Metrology’s Answer to Sudden GST Rate Shifts",
    "description": "<p>A sudden shift in GST rates can create challenges for manufacturers of pre-packaged goods due to the Legal Metrology (Packaged Commodities) Rules, 2011, which typically treat the printed retail sale price as fixed. To address this, the Ministry of Consumer Affairs invoked Rule 33, a rarely-used provision allowing for the relaxation of the Rules, to permit a transparent and time-bound repricing of existing stock. This action serves as a vital link between fiscal policy adjustments and consumer protection regulations.</p>\n\n<p>Rule 33, anchored in the Legal Metrology Act, 2009, and the Constitution, allows the Central Government to relax provisions of the Packaged Commodities Rules. It is crucial because Section 18(2) of the Act criminalizes selling above the declared MRP. The relaxation order provides protection against unintended prosecutions as the market adapts to the revised GST rates.</p>\n\n<p>The allowance is limited to pre-packaged goods manufactured, packed, or imported before the GST rate change and unsold at the time of notification. Manufacturers have until December 31, 2025, or until stock depletion, to resticker units with revised MRPs while keeping the original price visible for consumer verification.</p>\n\n<p>Transparency and accountability are reinforced through mandatory publicity. Companies must publish newspaper advertisements and notify stockists, retailers, and relevant Legal Metrology authorities before distributing restickered units.</p>\n\n<p>The circular also addresses the issue of surplus packaging with old MRPs, allowing their continued use until December 31, 2025, provided the revised MRP is clearly superimposed while maintaining the original price's legibility. This concession reduces environmental impact and protects working capital, while ensuring accurate pricing.</p>\n\n<p>The Department of Legal Metrology has refined Rule 33 into a precise regulatory tool. By linking price revisions to the exact tax differential, mandating dual price display, requiring public notice, and preserving prosecution rights, the Ministry has showcased how flexible use of subordinate legislation can balance legal requirements with business needs, while safeguarding consumer interests. This highlights responsive governance where laws adapt to prevent disruption, all while protecting the consumer.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/rule-33-legal-metrologys-fix-for-sudden-gst-rate-hikes.jpg"
  },
  {
    "title": "Spice Crackdown: FSSAI’s October 2025 Manufacturing Sweep Explained",
    "description": "<p>In response to findings of widespread adulteration in spice samples collected nationwide between November 2024 and February 2025, the Food Safety and Standards Authority of India (FSSAI) will conduct a concentrated enforcement drive in October 2025. This initiative, authorized under the Food Safety and Standards Act of 2006, targets manufacturing units producing thirteen specified spices to address issues such as excess lead, illegal coloring, and misleading labels.</p>\n\n<p>Throughout October, teams will inspect spice-grinding mills, cleaning plants, and other relevant facilities, collecting samples for analysis at NABL-accredited labs. These samples will be tested for various contaminants, including pesticide residues, aflatoxins, heavy metals, and extraneous color, with results promptly uploaded to the FoSCoS portal for real-time monitoring. The focus is exclusively on manufacturing units, recognizing that adulteration primarily occurs during grinding, blending, and re-packing processes.</p>\n\n<p>Manufacturers are expected to prepare by reviewing batch records, calibrating on-site labs, and ensuring proper labeling. Non-cooperation or closure during inspections will result in penalties, including license suspension. State food safety departments must submit comprehensive reports by November 20, 2025, detailing inspection findings and laboratory results. This initiative aims to ensure the safety and quality of spices available to consumers and emphasizes compliance as a crucial aspect of market access for manufacturers.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/fssai-spice-crackdown-october-2025-factory-inspections.jpg"
  },
  {
    "title": "Premium Price, Persistent Defects: Delhi Commission Holds Mercedes-Benz Liable",
    "description": "<p>The Delhi State Consumer Disputes Redressal Commission ruled in favor of a consumer, M/s Samaran Media Consultants Pvt. Ltd., against Mercedes-Benz India Pvt. Ltd. concerning a defective Mercedes-Benz EQS 580. The ruling underscores manufacturer accountability for delivering defect-free products, even in the premium automobile sector.</p>\n\n<p>Samaran Media Consultants Pvt. Ltd. purchased the vehicle for ₹1,55,00,000 in November 2022, but it soon experienced persistent issues, including a defective battery, malfunctioning air conditioner, and sensor failures. Despite multiple repair attempts, the problems persisted, leading the complainant to seek redressal from the Commission.</p>\n\n<p>The Commission rejected Mercedes-Benz's preliminary objections, affirming that Samaran Media Consultants was indeed a \"consumer\" under the Consumer Protection Act, 2019, as the vehicle was for the personal use of its director. It also dismissed the argument regarding territorial jurisdiction, citing the authorized dealer's presence in New Delhi and the cause of action arising within its jurisdiction. The Commission concluded that the recurring defects, despite multiple repair attempts, indicated a manufacturing defect, with offers to refund EMIs and extend the warranty viewed as tacit admissions of fault.</p>\n\n<p>As remedy, Mercedes-Benz India Pvt. Ltd. was ordered to refund the purchase price of ₹1,60,09,614.26, loan interest, prepayment charges, and to pay interest on the total amount at 6% per annum from the purchase date until the judgment date, in addition to ₹5,00,000 for mental agony and ₹50,000 for litigation costs. Failure to pay by October 11, 2025, would result in a 9% interest rate from the purchase date. The defective vehicle is to be taken over by Mercedes-Benz India Pvt. Ltd. following the refund. The judgment confirms that a company can be a \"consumer\" for products purchased for personal use, statutory rights override contractual clauses limiting jurisdiction, and manufacturers bear responsibility for persistent defects, even in premium brands. It reinforces that goodwill gestures cannot substitute for a consumer's right to a functional product and strengthens the Consumer Protection Act, 2019.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/delhi-commission-orders-refund-in-mercedes-benz-defect-case.jpg"
  },
  {
    "title": "Supreme Court Closes Gaps in Anand Marriage Act, Orders Uniform Rules Across States",
    "description": "<p>The Supreme Court of India has delivered a significant judgment in Amanjot Singh Chadha v. Union of India & Ors., addressing the delayed operationalization of the Anand Marriage Act, 1909, as amended in 2012. The Court directed all States and Union Territories to frame rules for registering Sikh marriages solemnized through the Anand Karaj ceremony within six months. Until these rules are notified, interim arrangements must be implemented to ensure non-discriminatory registration.</p>\n\n<p>This ruling resolves inconsistencies arising from the failure of several states to notify rules under Section 6 of the amended Act, which mandated provisions for marriage registration. The absence of uniform registration processes left Sikh couples without reliable marriage certificates, essential for various legal and civil matters.</p>\n\n<p>The Court's decision, made in response to a petition filed under Article 32 of the Constitution, emphasizes equal access to civil entitlements for Sikh couples. The Court directed states to enable registration based on existing marriage rules where possible. The Court issued special directions for Goa and Sikkim, addressing the unique administrative and constitutional frameworks in those states by calling for the extension of the Act to those regions.</p>\n\n<p>The judgment ensures nationwide uniformity in marriage certification, strengthens protections for women and children, and reinforces the principle that statutory mandates must be effectively implemented. It underscores the Court’s commitment to constitutional equality, ensuring that faith does not impede access to civil rights.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/sc-orders-uniform-rules-for-anand-marriage-act.jpg"
  },
  {
    "title": "No Partition Rights for Grandsons While Father is Alive, Rules Delhi High Court",
    "description": "<p>The Delhi High Court, in Amit Sethi v. Lalit Sethi & Ors., reaffirmed the legal position on intestate succession under the Hindu Succession Act, 1956 (HSA), ruling that a grandson does not acquire a birthright in his grandfather's property while his father is alive. The court dismissed a partition suit filed by a grandson concerning property in Kalkaji, New Delhi, emphasizing the transformative impact of Section 8 of the HSA, which eliminates pre-1956 coparcenary and survivorship concepts.</p>\n\n<p>The dispute originated from conflicting claims over a property originally acquired by the plaintiff's grandfather. The plaintiff asserted an oral family partition in 1986 resulted in his father and uncle jointly owning the property, entitling him to a share by birth. The defendants countered that the 1986 arrangement vested absolute ownership in the father and uncle, precluding the grandson's claim under the HSA, which prioritizes Class I heirs.</p>\n\n<p>The High Court, considering the pleadings and relevant legal provisions, found that the admitted oral partition in 1986 converted the property into the separate property of the father and uncle. Citing Section 8 of the HSA and landmark precedents, the Court reiterated that property inherited by a son after 1956 is held in an individual capacity, not as part of a coparcenary. Thus, the grandson lacked a birthright, and any cause of action would only arise upon his father's death. The Court also reinforced the use of Order VII Rule 11 CPC to prevent misuse of process and save litigants from prolonged, fruitless litigation.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/no-birthright-for-grandsons-in-fathers-lifetime-delhi-hc.jpg"
  },
  {
    "title": "Does a Daughter’s Marriage Expense Justify Alienation of Joint Family Property?",
    "description": "<p>The Supreme Court of India, in Dastagirsab v. Sharanappa, reaffirmed the established principles governing the power of a Karta (manager) to alienate Hindu Undivided Family (HUF) property. The ruling emphasizes legal necessity, the evidentiary burden on purchasers, and the binding nature of such transactions on coparceners (family members with inheritance rights).</p>\n\n<p>The case involved a dispute over land sold by a Karta, Sharanappa, purportedly to cover the marriage expenses of his daughter, Kashibai. A coparcener challenged the sale, claiming it lacked consideration and legal necessity, alleging the Karta's alcohol addiction and extravagance. The purchaser defended the sale, presenting receipts and revenue records to demonstrate consideration and transfer of title.</p>\n\n<p>The Supreme Court's ruling reinforces that alienations by a Karta for genuine legal necessity bind the entire family, safeguarding coparcenary rights while ensuring transaction stability. While recognizing a daughter's marriage expenses as a valid legal necessity, the ruling should not be interpreted as endorsing or imposing a financial obligation on fathers for daughters' marriages. The judgment focuses on clarifying \"legal necessity\" within Hindu coparcenary law and should not legitimize regressive expectations regarding marriage expenditure.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/daughters-marriage-expenses-as-legal-necessity-in-huf.jpg"
  },
  {
    "title": "Supreme Court Clarifies Arbitrator’s Power to Award Pendente Lite Interest in ONGC v. G&T Beckfield Drilling",
    "description": "<p>The Supreme Court's decision in Oil and Natural Gas Corporation Ltd. v. G&T Beckfield Drilling Services Pvt. Ltd. clarifies the scope of an arbitral tribunal's power to award pendente lite interest. The Court held that a general contractual clause prohibiting interest on delayed or disputed payments does not automatically preclude an arbitral tribunal from awarding interest during the pendency of arbitration proceedings. This ruling balances contractual freedom with the need for equitable compensation in commercial disputes.</p>\n\n<p>The case stemmed from a contractual dispute between ONGC and G&T Beckfield Drilling Services Pvt. Ltd. regarding unpaid invoices. The arbitral tribunal awarded G&T Beckfield Drilling interest from the date of claim filing. ONGC challenged the award, arguing that Clause 18.1 of the contract expressly forbade such interest. The Supreme Court dismissed ONGC's appeal, asserting that Clause 18.1 only restricted interest on delayed payments during the contract's operational phase and did not restrict the tribunal's discretion to award pendente lite interest.</p>\n\n<p>The Court emphasized the distinction between clauses specifically prohibiting interest \"in any respect whatsoever\" versus those merely barring interest on delayed invoices. The judgment reinforces that arbitral discretion to grant interest is preserved unless expressly excluded by the contract. This decision promotes commercial certainty by requiring precise contract drafting to exclude pendente lite interest, and it ensures fairness by preventing unjust enrichment resulting from prolonged payment delays. This pronouncement serves as a key guideline for arbitral tribunals, courts, and contracting parties.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/sc-clarifies-arbitrators-power-on-pendente-lite-interest.jpg"
  },
  {
    "title": "Greater Bengaluru Governance (Registration of Electors) Rules, 2025: A Walk-Through",
    "description": "<p>The Karnataka government has enacted the Greater Bengaluru Governance (Registration of Electors) Rules, 2025, to establish a comprehensive system for creating and maintaining accurate voter rolls for Bengaluru's city-corporation wards. These rules address the long-standing issue of using outdated assembly constituency voter lists for civic elections.</p>\n\n<p>The rules outline the definitions and terminology used, aligning with the Greater Bengaluru Governance Act of 2024 and the Representation of the People Act, 1950. Instead of creating rolls from scratch, the commission can adopt the current legislative-assembly roll, while pruning, adding or transposing entries. The roll is frozen once the last date for filing nominations is notified, preventing manipulation.</p>\n\n<p>The process involves enumerators collecting data from residents using Form-2, and the Registration Officer having access to birth, death, and school records to prevent fraudulent registrations. A draft roll is then published for public review, and citizens can submit claims, objections, or corrections using specific forms (Forms 4-8). These forms can be submitted in person, by post, or through an online portal.</p>\n\n<p>Designated officers process applications, and the Registration Officer reviews them, potentially holding hearings to resolve disputes. Supplementary lists for omissions and deletion lists for deceased or moved individuals can be created, subject to objections and hearings. The final roll, with amendment lists, is published, and two free copies are provided to recognized national and state parties.</p>\n\n<p>Aggrieved electors can appeal decisions to an officer designated by the State Election Commission within fifteen days. Rolls are revised annually through either intensive or summary revisions. Outside of the revision cycle, electors can seek corrections or inclusions at any time. The Commission can also order photo-identity cards to reduce impersonation.</p>\n\n<p>Post-election, rolls and related documents are preserved for a specified period. The Commission has the option to adopt the current legislative-assembly roll, ward-bounded and cleansed, for city-corporation elections. Officers involved in the process are considered on deputation to the State Election Commission and are subject to disciplinary action for breaches of duty. The rules aim to translate the promise of universal adult franchise into a tangible process, empowering residents and shaping local democracy in Bengaluru.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/greater-bengaluru-governance-rules-2025-voter-roll-guide.jpg"
  },
  {
    "title": "Allahabad High Court Upholds Pollution Control Board’s Power to Levy Environmental Compensation",
    "description": "<p>The Allahabad High Court has affirmed the authority of Pollution Control Boards to levy environmental compensation, reinforcing the \"Polluter Pays\" principle. The ruling in M/s Ramesh Dyeing and Washing, Ghaziabad v. State of U.P. & Ors. upheld the U.P. Pollution Control Board's power to issue closure orders and impose financial penalties for environmental damage.</p>\n\n<p>The case originated when the U.P. Pollution Control Board ordered the closure of the petitioner's industrial unit and imposed a fine of ₹14,20,000. The petitioner challenged the Board's authority, arguing that only the National Green Tribunal (NGT) could impose such a fine. The court rejected this argument, citing the Supreme Court’s ruling in Delhi Pollution Control Committee v. Lodhi Property Company Ltd., which confirmed that Pollution Control Boards possess the power to impose compensatory damages under Section 33A of the Water Act, 1974, and Section 31A of the Air Act, 1981.</p>\n\n<p>The High Court clarified that these powers are incidental to the Boards' statutory mandate and are remedial, not punitive, in nature. While acknowledging its jurisdiction under Article 226, the court declined to exercise it due to the petitioner's failure to exhaust the appeal process under the NGT Act and an unexplained delay in filing the petition. The judgment solidifies the regulatory power of Pollution Control Boards and emphasizes the importance of industries internalizing environmental accountability.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/allahabad-hc-upholds-environmental-compensation-power.jpg"
  },
  {
    "title": "NCLAT Upholds Liquidation of E.C. Bose & Company Pvt. Ltd., Rejecting Suspended Director's Settlement Offer",
    "description": "<p>The National Company Law Appellate Tribunal (NCLAT) has affirmed the National Company Law Tribunal's (NCLT) order for the liquidation of E.C. Bose & Company Pvt. Ltd., a corporate debtor undergoing insolvency proceedings. The appeal, filed by the company's suspended director, Deborshi Sadhan Bose, challenged the NCLT's decision to initiate liquidation after the 330-day Corporate Insolvency Resolution Process (CIRP) period expired without an approved resolution plan.</p>\n\n<p>The appellant argued before the NCLAT that a higher settlement offer of ₹8 crore had been received after the Committee of Creditors (CoC) decided to pursue liquidation. However, the NCLAT noted that the offer was made well after the CIRP period had concluded and the CoC had already resolved to liquidate the company.</p>\n\n<p>The NCLAT distinguished this case from previous instances where higher offers from resolution applicants during the CIRP period or settlement proposals under Section 12A of the Insolvency and Bankruptcy Code (IBC) were considered. Ultimately, the NCLAT found no grounds to interfere with the NCLT's decision, emphasizing the importance of adhering to the timelines prescribed under the IBC. The appeal was subsequently dismissed, upholding the liquidation order.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/nclat-upholds-e-c-bose-liquidation-rejects-settlement.jpg"
  },
  {
    "title": "SEBI Streamlines Compliance for FPIs Investing Exclusively in Government Securities",
    "description": "<p>SEBI issued a circular on September 10, 2025, introducing a simplified compliance framework for Foreign Portfolio Investors (FPIs) investing solely in Government Securities under the Fully Accessible Route (FAR), termed \"GS-FPIs.\" Effective February 8, 2026, this framework aims to encourage stable foreign investment in India's sovereign debt market by reducing registration and reporting requirements, aligning KYC obligations with banking norms, and clarifying transition processes between regular FPIs and GS-FPIs.</p>\n\n<p>Key changes include the removal of the obligation for GS-FPIs to disclose investor-group details at registration, acknowledging the low-risk profile of government securities investments. The circular clarifies that resident Indian contributions to GS-FPIs must be made exclusively under the RBI’s Liberalised Remittance Scheme (LRS) with restricted Indian securities exposure. Furthermore, GS-FPIs are relieved from filing \"no-change\" declarations and reporting non-material changes during renewal, with only the payment of fees required, while material changes must still be reported. Custodian KYC review cycles are aligned with RBI guidelines for FPI bank accounts, enhancing operational efficiency.</p>\n\n<p>The circular also establishes a clear process for new applicants to register as GS-FPIs and for existing FPIs to transition to GS-FPI status by divesting non-government securities. Conversely, GS-FPIs opting to operate as regular FPIs must fulfill all additional disclosure requirements. Issued under Section 11(1) of the SEBI Act, 1992, and linked to the RBI's FAR, the circular reflects a strategic move towards risk-based compliance, aiming to increase foreign demand for Indian debt and reinforce regulatory alignment.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/sebi-eases-compliance-for-fpis-in-government-securities.jpg"
  },
  {
    "title": "New TNRERA Penalties for Selling Unregistered Plots/Flats/Apartments",
    "description": "<p>The Tamil Nadu Real Estate Regulatory Authority (TNRERA) has issued Circular No. TNRERA/3867/2024, dated September 10, 2025, introducing significantly stricter penalties for selling plots, flats, or apartments before project registration, superseding a previous circular from November 2024. This action reinforces compliance with Section 3 of the Real Estate (Regulation & Development) Act, 2016.</p>\n\n<p>The new guidelines stipulate that penalties for violating Section 3 will be the highest amount calculated from three options: a fixed amount per plot/flat based on jurisdiction (ranging from ₹3,000 to ₹15,000), a percentage of the proportionate project cost (2% for plots, 1% for flats), or 2% of the total sale value of unregistered properties as reflected in the Encumbrance Certificate (EC).</p>\n\n<p>Additional penalties are applied for projects with multiple violations. A 50% increase is added to the calculated penalty if 10 to 50 properties are sold illegally, and a 100% increase applies if more than 50 such properties are sold.</p>\n\n<p>This revised penalty framework underscores TNRERA's commitment to protecting homebuyers and fostering a more transparent real estate market. Developers face significantly higher costs for non-compliance, emphasizing the importance of timely registration. Homebuyers benefit from increased security and should verify TNRERA registration before purchasing property.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/new-tnrera-penalties-for-sale-before-registration.jpg"
  },
  {
    "title": "Karnataka RERA Issues New Directive on Mandatory Annual Audits",
    "description": "<p>Karnataka RERA has issued a circular mandating strict compliance with annual audit requirements for all promoters, reinforcing financial transparency in the real estate sector. This directive, in accordance with Section 4(2)(l)(D) of the RERA Act 2016, requires promoters to have their accounts audited within six months of the financial year-end by a practicing chartered accountant, ensuring funds are used solely for the designated project and withdrawals are proportionate to project completion.</p>\n\n<p>The circular mandates the submission of Form-7 (Annual Audit Report) for the financial year 2024-25 through a dedicated online module on the K-RERA web portal. Promoters must also submit audited financial statements, including the profit and loss account, balance sheet, cash flow statements, income tax returns, and the auditor’s report, by 15 November 2025.</p>\n\n<p>K-RERA emphasizes that this annual audit is a statutory compliance measure, and failure to adhere to the requirements may result in regulatory action. A helpdesk mechanism is available to assist promoters with any technical issues, demonstrating the authority's commitment to facilitating compliance. This regulatory framework aims to safeguard homebuyers' funds, instill confidence in the real estate market, and align promoters’ responsibilities with the objectives of RERA through efficient digital filing and enhanced transparency.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/karnataka-rera-mandates-annual-audit-filing-for-2024-25.jpg"
  },
  {
    "title": "ITAT Chennai Rules Minor’s Share in Inherited Property Cannot Be Taxed in Guardian’s Hands",
    "description": "<p>The Income Tax Appellate Tribunal (ITAT), Chennai, in Pradeep Jeyavelu v. Income Tax Officer, ruled that a minor's share of inherited property, deposited under court direction, cannot be clubbed with the guardian's income for capital gains tax purposes. This decision balances the Income Tax Act, 1961, with the Hindu Minority and Guardianship Act, 1956, safeguarding minors’ rights and preventing undue tax burdens on guardians.</p>\n\n<p>The case involved the sale of property inherited by the assessee and his minor daughter. The court approved the sale, stipulating that the minor's share be deposited in a nationalized bank under judicial custody. While the assessee paid taxes on his share of the capital gains, the Assessing Officer sought to club the minor's share with his income. The ITAT ruled against this, stating that since the assessee had no control over the minor's share, the clubbing provisions of Section 64(1A) of the Income Tax Act, 1961, did not apply.</p>\n\n<p>The Tribunal emphasized that taxability hinges on ownership and control of income, not merely the occurrence of a transfer. It also accepted the assessee’s claim for brokerage expenses as a customary cost. The ruling clarifies that clubbing provisions are inapplicable when a guardian lacks control over a minor's assets protected by court orders. This provides practical relief for taxpayers in succession cases involving minors, ensuring fair tax administration and the protection of vulnerable stakeholders.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/itat-rules-minors-inherited-property-not-clubbed-for-tax.jpg"
  },
  {
    "title": "Deepfakes, AI, and the Law: Protecting Celebrity Personality Rights in India",
    "description": "<p>India's legal framework for protecting the personality rights of public figures is evolving through judicial interpretation of existing laws and constitutional principles. These rights are rooted in the right to privacy, with the right of publicity recognized as a proprietary right that allows celebrities to control and monetize their persona. The right to privacy, constitutionally backed by Article 21, protects individuals from unwanted exposure and misrepresentation, which has been reinforced in digital safety rulings such as the Madras High Court’s 2025 judgment in X v. Union of India.</p>\n\n<p>Legal safeguards include the Copyright Act, 1957 (moral rights for performers), the Trademarks Act, 1999 (protection of names and catchphrases), and the common law tort of \"passing off,\" which prevents misleading endorsements. The judiciary grants injunctions to prevent unfair exploitation, and intermediary liability under the IT Act, 2000 and the IT Rules, 2021 mandates expedited notice-and-takedown mechanisms.</p>\n\n<p>Recent Delhi High Court interim orders, particularly in Aishwarya Rai Bachchan v. Aishwaryaworld.com & Ors. and Abhishek Bachchan v. The Bollywood Tee Shop & Ors., address challenges from AI and deepfake technology. These cases involved unauthorized use of the Bachchans' personas, including the sale of merchandise, fake websites, and AI-generated content. The court issued injunctions requiring platforms to remove infringing content, emphasizing the financial and reputational harm caused by unauthorized use.</p>\n\n<p>These rulings reaffirm the judiciary's commitment to protecting individual dignity against technological threats. They signify a shift where personality rights are viewed as integral to dignity, privacy, and autonomy, not just economic entitlements. With increasing AI-driven misuse, legislative codification of personality rights in India is becoming essential.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/deepfakes-ai-law-protecting-celebrity-rights-india.jpg"
  },
  {
    "title": "Supreme Court Upholds Testamentary Succession Over State Escheat Claims",
    "description": "<p>The Supreme Court of India, in State of Rajasthan v. Ajit Singh & Ors., has reinforced the primacy of testamentary succession, clarifying that the doctrine of escheat under Section 29 of the Hindu Succession Act, 1956, is applicable only when an individual dies intestate without legal heirs. The Court affirmed that a validly executed and probated Will dictates the devolution of property, precluding the State's intervention based on escheat claims.</p>\n\n<p>The case originated from the estate of Raja Bahadur Sardar Singh, who created the Khetri Trust via a Will and Codicil prior to his death in 1987. While the initial probate petition was dismissed, the Division Bench of the Delhi High Court later overturned this decision, upholding the Will's validity. The State of Rajasthan appealed, asserting its right to the property based on the claim that the testator died without heirs.</p>\n\n<p>The Supreme Court dismissed the State's challenge, emphasizing that the State lacks the standing to contest a validly executed Will. The ruling underscores the significance of adhering to the testator’s intent and reinforces the limits of governmental intervention in succession matters. The Court's decision reaffirms the principle that escheat is a remedy of last resort, applicable only in the absence of both a Will and legal heirs. This ruling strengthens the legal position of trusts and legatees, and enhances certainty in succession law.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/sc-rules-valid-will-overrides-states-escheat-claims.jpg"
  },
  {
    "title": "Identity, Dignity, and the Law: Constitutional Protection of Name Change in India",
    "description": "<p>The right to change one's name in India is constitutionally protected under Articles 19(1)(a) and 21, as affirmed by the High Court of Jammu & Kashmir and Ladakh in Mohd. Hassan v. Union Territory of J&K & Ors. This right stems from the fundamental freedoms of speech and expression, as well as the right to life and personal liberty, encompassing dignity and individuality. The court emphasized that any curtailment of this right must meet the test of reasonableness under Article 19(2), allowing restrictions only in cases involving fraud, criminality, or overriding public interest.</p>\n\n<p>In the Mohd. Hassan case, the petitioner, originally named Raj Wali, sought to change his name to Mohd. Hassan. The Jammu & Kashmir Board of School Education rejected his application to update his educational certificates, citing a limitation period and lack of provision for such changes. The High Court overturned this decision, clarifying that the limitation period applied only to corrections of errors, not substantive name changes. The court emphasized that constitutional rights prevail over administrative rules, and that public documents reflecting the changed name hold statutory presumption of correctness under the Indian Evidence Act.</p>\n\n<p>The judgment aligns with a broader judicial consensus among Indian High Courts, including Allahabad, Kerala, and Delhi, which recognize the right to change one's name as a constitutionally guaranteed entitlement under Articles 19(1)(a) and 21. This jurisprudence highlights that a name is central to individuality. The decision in Mohd. Hassan reinforces the principle that administrative rules must operate within the framework of constitutional guarantees, safeguarding identity autonomy and recognizing names as reflections of individuality, culture, and dignity.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/name-change-in-india-constitutional-right-affirmed.jpg"
  },
  {
    "title": "Promotion and Regulation of Online Gaming in 2025: A Landmark in Digital Policy",
    "description": "<p>The Promotion and Regulation of Online Gaming Bill, 2025, represents a significant development in India's digital legal framework, aiming to mitigate the social and economic harms of predatory online money games while simultaneously fostering e-sports and safe recreational gaming. This legislation balances innovation and responsibility, ensuring societal benefits from digital progress without exposing individuals to exploitation.</p>\n\n<p>The Bill addresses the exponential growth of online gaming platforms and the associated risks, including financial losses, addiction, and misuse for illicit activities such as money laundering. Recognizing the potential of India's gaming sector, the Bill establishes a comprehensive framework to manage these risks.</p>\n\n<p>Key provisions include the recognition of e-sports, promotion of social and educational games, and a complete prohibition of online money games. A national regulatory authority will oversee permissible games, issue compliance guidelines, and address public grievances. Stringent penalties, including imprisonment and fines, are in place for violations, and corporate liability is imposed on companies involved in prohibited activities.</p>\n\n<p>The legislation aligns with existing frameworks such as the Information Technology Act, 2000, and the Bharatiya Nyaya Sanhita, 2023, and also includes GST regulations for digital platforms. This Bill will protect individuals from exploitative gaming platforms and stimulate the growth of e-sports and social gaming, positioning India as a hub for digital innovation and employment.</p>\n\n<p>The Bill promotes responsible digital governance and sets a precedent for other jurisdictions facing similar challenges. It ensures that technology empowers rather than harms society, balances the risks of digital exploitation with the opportunities of constructive digital engagement and sets a strong foundation for responsible innovation. Continuous regulatory adaptation and industry cooperation will be essential to ensure that India achieves the dual goals of protecting citizens and fostering a thriving digital gaming ecosystem.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/online-gaming-regulation-india-2025-key-legal-reforms.jpg"
  },
  {
    "title": "Equal Coparcenary Rights and Limits of Review: Supreme Court Clarification",
    "description": "<p>The Supreme Court of India's judgment in Malleeswari v. K. Suguna & Anr. (2025) reaffirms the equal coparcenary rights of daughters under the Hindu Succession (Amendment) Act, 2005, and the Tamil Nadu Amendment Act of 1989. The ruling emphasizes that these claims cannot be easily dismissed. Concurrently, it underscores the limited scope of judicial review, which is restricted to correcting evident errors and not a disguised appeal.</p>\n\n<p>The case originated from a partition suit filed in 2000, excluding Malleeswari. After a series of property transfers and her father's death, Malleeswari sought amendment of the preliminary decree in 2018 to reflect her coparcenary rights based on the 1989 and 2005 amendments. The Trial Court dismissed her application, but the High Court initially recognized her rights before reversing its decision on review.</p>\n\n<p>The Supreme Court addressed two key issues: the enforceability of Malleeswari's coparcenary rights despite the 2003 decree and whether the High Court exceeded its review jurisdiction. The Court held that the High Court improperly expanded the scope of review by re-evaluating settled facts. The Supreme Court allowed the appeal, reinstating the High Court's original order which recognized Malleeswari's one-third coparcenary share and directed the Trial Court to expedite pending applications.</p>\n\n<p>The judgment is significant as it reinforces the statutory rights of daughters and defines the boundaries of appellate and review jurisdiction. The Court acknowledged the layered statutory framework, including the Tamil Nadu Amendment Act of 1989. The decision protects against the misuse of review proceedings, thereby strengthening both substantive justice in succession law and procedural integrity in civil litigation.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/sc-upholds-daughters-coparcenary-rights-limits-review.jpg"
  },
  {
    "title": "The Income-tax Act, 2025: A Modern Framework for Direct Taxation in India",
    "description": "<p>The Income-tax Act, 2025, a comprehensive reform of India's direct tax framework, received Presidential assent on August 21, 2025, and is set to replace the Income-tax Act, 1961, effective April 1, 2026. The legislation aims to establish a simpler, fairer, and more digitally-aligned tax system. Its key objectives include simplifying the law, providing certainty on digital assets and cross-border transactions, ensuring equity for middle-income taxpayers through revised slabs, and modernizing administration with technology-driven processes.</p>\n\n<p>Structurally, the Act replaces the \"Previous Year\" and \"Assessment Year\" system with a single \"Tax Year\" definition. It streamlines provisions, removes archaic clauses, and simplifies drafting while maintaining legal rigor. Transitional arrangements are in place to ensure continuity for pending assessments and preservation of accumulated entitlements.</p>\n\n<p>For individuals, the new regime is the default, offering complete relief up to ₹4,00,000 income, with a more generous rebate under Section 87A, potentially resulting in no liability for taxpayers up to ₹12,00,000. For corporations, existing competitive tax rates are maintained, and Minimum Alternate Tax (MAT) rules are clarified. International taxation aligns with OECD's BEPS standards, with the equalisation levy retained and strengthened reporting obligations for non-residents.</p>\n\n<p>Significantly, the Act formally recognizes Virtual Digital Assets (VDAs), bringing cryptocurrencies and NFTs into the statutory framework. It modernizes compliance through digital processes, including refunds for belated returns, clarified tax deduction and collection rules, and expanded faceless assessments. The Central Board of Direct Taxes (CBDT) remains the apex authority, and the five classical heads of income are retained for continuity.</p>\n\n<p>The Income-tax Act, 2025 is expected to reduce litigation, improve compliance, and enhance India’s credibility in taxation. Individuals will benefit from revised slabs, while corporations gain stability. The legislation sets the stage for a more transparent, equitable, and efficient tax regime.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/income-tax-act-2025-modern-framework-for-taxation.jpg"
  },
  {
    "title": "The National Sports Governance Act, 2025: A New Era for Indian Sports",
    "description": "<p>The Government of India has enacted The National Sports Governance Act, 2025, a comprehensive legislative reform designed to modernize the nation's sports administration. The Act aims to promote sports development, ensure athlete welfare, and establish ethical practices aligned with Olympic, Paralympic, and international standards. It provides a unified system for resolving sports-related grievances, fostering a professional, transparent, and athlete-centric ecosystem.</p>\n\n<p>A core objective of the Act is establishing structured frameworks for the recognition and operation of National Sports Bodies. It mandates a single National Olympic Committee and National Paralympic Committee, requiring all bodies to have international recognition and affiliation. The newly created National Sports Board holds the power to grant, suspend, or cancel recognition, which is essential for accessing government grants and financial assistance.</p>\n\n<p>To ensure ethical and transparent operations, the Act introduces strict governance and compliance requirements. Key policies and committees are established to promote ethical conduct, athlete welfare, and effective oversight within the sports ecosystem.</p>\n\n<p>The Act establishes the National Sports Board and the National Sports Tribunal to oversee sports governance. The Board is responsible for policy, regulation, and recognition, while the Tribunal serves as an independent body for resolving disputes.</p>\n\n<p>In conclusion, The National Sports Governance Act, 2025, is a transformative piece of legislation poised to bring significant reform to Indian sports. By emphasizing good governance, transparency, accountability, and athlete welfare, and establishing dedicated bodies, the Act lays the foundation for a robust sports culture and strengthens India's reputation in global sports.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/national-sports-governance-act-2025-key-reforms-explained.jpg"
  },
  {
    "title": "Rajasthan High Court Upholds Child's Right to Education, Dismissing Technicalities",
    "description": "<p>The Rajasthan High Court, Jaipur Bench, ruled in favor of a minor, Master Daivik Rangwani, reinforcing the fundamental right to education under Article 21-A of the Constitution and the Right of Children to Free and Compulsory Education Act, 2009 (RTE Act). The court directed Vardhman International School, Jaipur, to admit Master Rangwani under the Economically Weaker Section (EWS) quota.</p>\n\n<p>The case arose after the school rejected Master Rangwani's application due to a missing ward number on his Aadhaar card, despite the subsequent submission of a verified residence certificate. The court found this rejection arbitrary and a violation of the child's fundamental right to education.</p>\n\n<p>Justice Anoop Kumar Dhand emphasized that the right to education, a constitutional guarantee, cannot be undermined by technicalities if valid proof of residence is furnished. Citing precedents, the court reiterated that schools cannot arbitrarily deny admission under the EWS quota. The ruling serves as a reminder that procedural issues should not impede a child's access to education, ensuring inclusivity and equal opportunity. The court directed Vardhman International School to admit Master Daivik Rangwani within 15 days. This decision reaffirms the judiciary's commitment to upholding a child's fundamental right to education, reinforcing that it is a substantive entitlement that cannot be defeated by administrative rigidity.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/right-to-free-education-rajasthan-hc-upholds-childs-claim.jpg"
  },
  {
    "title": "Rose Valley Chit Fund Scam: Judicial Responses to Large-Scale Financial Fraud",
    "description": "<p>The Rose Valley chit fund scam, led by Chairman Gautam Kundu, involves alleged fraudulent collective investment schemes that deceived numerous individuals. Investigative agencies like the Enforcement Directorate and the Central Bureau of Investigation are involved due to the schemes posing a threat to public and national financial stability.</p>\n\n<p>The Rose Valley Group allegedly used fraudulent tactics to amass funds from the public through entities like Rose Valley Real Estate Construction Ltd. Issuing secured non-convertible debentures (NCDs) without SEBI compliance, the group raised over ₹12.82 crores. These funds were allegedly diverted into other businesses, using cross-shareholding to create \"fake capital,\" disguising public deposits as company capital and circumventing regulations to exploit public trust. It is alleged that around ₹17,378 Crores were collected from investors, with more than ₹9,000 Crores yet to be refunded.</p>\n\n<p>Legal battles, as documented in cases like Gautam Kundu vs. The Enforcement Directorate, demonstrate the judiciary's stance on economic offenses. The Calcutta High Court prioritized a speedy trial, while the Orissa High Court emphasized that economic offenses require a different approach to bail considerations, especially when posing a threat to the nation's financial health. The Supreme Court has also reinforced that collective investment schemes without SEBI approval are illegal.</p>\n\n<p>The Prevention of Money Laundering Act (PMLA) has been crucial in investigating and attaching assets acquired through illicit activities. The judiciary's strict stance signals a commitment to combating complex financial fraud, aiming to restore public trust. The attachment and sale of Rose Valley's assets under PMLA aims to compensate defrauded investors, overseen by the Justice S.P. Talukdar Committee.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/rose-valley-chit-fund-scam-judicial-response-impact.jpg"
  },
  {
    "title": "Free Speech in the Digital Age: Telangana HC Issues Guidelines on Social Media FIRs",
    "description": "<p>On September 10, 2025, the Telangana High Court, in Nalla Balu @ Durgam Shashidhar Goud v. State of Telangana, quashed three FIRs against a citizen who criticized the ruling Congress Party and the Chief Minister on \"X\" (formerly Twitter). The Court ruled the FIRs were inappropriately filed and further issued binding guidelines for police and magistrates on handling complaints related to social media speech.</p>\n\n<p>The petitioner was accused of posting tweets that included abusive language, compared the Congress party to a pest, and alleged corruption in the Chief Minister’s government. The FIRs cited offences under the Bharatiya Nyaya Sanhita, 2023, and Section 67 of the Information Technology Act, 2000. The prosecution argued the tweets defamed the Chief Minister and disturbed public tranquility, while the petitioner contended they were protected political commentary under Article 19(1)(a) and did not constitute cognizable offenses.</p>\n\n<p>Justice N. Tukaramji concluded that the FIRs were mechanically registered without meeting statutory requirements. The court emphasized that political criticism, even if harsh, does not automatically constitute provocation, public mischief, or obscenity. At most, some posts might be considered under defamation, but such cases require a complaint by the aggrieved party before a magistrate, not a police investigation. The Court then established clear guidelines for police and magistrates in Telangana on handling social media speech cases, emphasizing preliminary inquiry, high thresholds for speech-related offenses, and locus standi.</p>\n\n<p>The judgment is considered a significant moment for free speech jurisprudence in India. It interprets the BNS and BNSS in the context of digital expression and reinforces that political speech, even when uncomfortable, should not be suppressed through criminal law. By offering operational clarity to law enforcement and judicial officers, the ruling aims to protect citizens, journalists, and opposition voices from arbitrary FIRs and politically motivated harassment. It reaffirms the constitutional principle that democracy thrives on dissent, criticism, and debate, and that freedom of speech is a fundamental right requiring diligent protection, particularly in the digital age.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/social-media-firs-telangana-hc-issues-key-guidelines.jpg"
  },
  {
    "title": "Supreme Court Clarifies Strict Application of Limitation in Negotiable Instruments Act Cases",
    "description": "<p>The Supreme Court of India has reaffirmed the importance of adhering to statutory timelines in cheque dishonor cases under the Negotiable Instruments Act, 1881 (NI Act). The ruling emphasizes that a complaint filed after the prescribed deadline cannot be automatically considered maintainable. Any delay necessitates a formal application for condonation, which must be substantively evaluated by the court.</p>\n\n<p>Section 138 of the NI Act provides recourse for payees when cheques are dishonored due to insufficient funds, but Section 142(b) requires the complaint to be filed in writing and within a specific timeframe. While courts can condone delays, this is not an automatic process. The Supreme Court clarified that the principle of certainty in limitation law is paramount, particularly in quasi-criminal cheque dishonor proceedings. Statutory timelines prevent abuse and ensure fair, prompt prosecution.</p>\n\n<p>In H.S. Oberoi Buildtech Pvt. Ltd. & Ors. v. M/s MSN Woodtech, the Court overturned decisions by lower courts that had proceeded with a cheque dishonor complaint filed five days late without a formal condonation application. The Supreme Court underscored that even minor delays require a proper application under Section 142(b). While the civil recovery proceedings were unaffected, the Court emphasized that criminal liability under the NI Act requires strict adherence to limitation requirements.</p>\n\n<p>This ruling reinforces that limitation is a crucial statutory mandate. While courts retain the discretion to condone delays under Section 142(b), this power is conditional upon a formal application supported by valid reasons. This preserves the balance between protecting the rights of payees and shielding accused individuals from prosecutions initiated outside statutory timelines.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/sc-rules-no-automatic-delay-condonation-in-ni-act-case.jpg"
  }
]