[
  {
    "title": "What Happens When an Employee Dies in Harness? Rights under Employees Compensation Act, 1923",
    "description": "<p>The death of an employee during employment is a significant event with both human and legal dimensions. The Employees Compensation Act, 1923 (EC Act) in India, aims to provide financial support to the dependents of a deceased employee, irrespective of their employment status (permanent, probationary, or trainee). This legislation underscores the importance of worker and family security within labor welfare laws.</p>\n\n<p>Under the EC Act, the term \"employee\" is broadly defined to include trainees and probationers. This ensures that compensation and benefits are applicable regardless of whether the deceased was a confirmed employee, probationer, or trainee.</p>\n\n<p>The Act mandates statutory compensation to the dependents of a deceased employee. The compensation amount is calculated based on a formula involving the employee's monthly wages and a relevant factor determined by age, as specified in Schedule IV.  Additionally, the employer is required to deposit a fixed sum towards funeral expenses. Failure to deposit the compensation within 30 days can result in penalties and interest charges.</p>\n\n<p>The EC Act establishes a clear procedure for disbursing compensation to legally recognized dependents, safeguarding against private settlements and disputes. Employers are obligated to promptly notify the Commissioner of Employee’s Compensation, conduct an internal inquiry, preserve records and evidence, and facilitate the claim process. Non-compliance can lead to legal repercussions.</p>\n\n<p>In conclusion, the EC Act is a crucial social welfare law designed to protect the dependents of employees who die during employment, ensuring they are not left financially insecure. The Act protects all employees and requires employers to adhere to statutory timelines and procedures, balancing compassion with accountability.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/compensation-for-employee-death-under-ec-act-1923.jpg"
  },
  {
    "title": "RBI Issues Draft Circular on Counterparty Credit Risk and Potential Future Exposure",
    "description": "<p>On August 20, 2025, the Reserve Bank of India (RBI) released a draft circular addressing Counterparty Credit Risk (CCR) and Potential Future Exposure (PFE), inviting public comments until September 10, 2025. This revision updates the existing framework outlined in the Master Circular on Basel III Capital Regulations, aiming to align domestic capital adequacy rules with international standards set by the Basel Committee on Banking Supervision (BCBS) while adapting to the evolving Indian derivatives market.</p>\n\n<p>The draft circular focuses on the Current Exposure Method (CEM) for calculating PFE, a key component of the Basel III framework designed to ensure adequate capital coverage against counterparty defaults in financial contracts. The RBI's actions are grounded in its statutory powers derived from the Banking Regulation Act, 1949, and the Reserve Bank of India Act, 1934.</p>\n\n<p>Key implications for banks include the potential need to hold additional capital against CCR, particularly for those acting as clearing members of SEBI-recognized exchanges. While this may impact short-term profitability, it is intended to bolster the stability of the banking system. The alignment with BCBS guidelines will enhance the credibility and competitiveness of Indian banks in cross-border transactions and reduce regulatory arbitrage.</p>\n\n<p>In conclusion, the draft circular signifies a crucial regulatory update in India's prudential capital framework. By clarifying obligations and revising add-on factors to align with Basel III, the RBI aims to maintain financial stability, ensure international consistency, and address emerging risks in the derivatives market. Banks and market participants are urged to assess the draft's impact and provide feedback during the consultation period.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/rbi-draft-on-counterparty-credit-risk-basel-iii-alignment.jpg"
  },
  {
    "title": "Rajasthan High Court Reinforces Citizens' Right to Safe Roads: No Place for Illegal Occupations",
    "description": "<p>The Rajasthan High Court addressed the persistent issue of encroachments on public roads and pedestrian pathways in the case of *Vijay Kumar Boyat & Ors. Versus Vaibhav Galriya*. Recognizing the widespread nature of the problem and the failure of previous directives, the Court revived a pending Public Interest Litigation (PIL) filed in 2022 and issued stringent new directions to identify, remove, and prevent illegal encroachments statewide. The court emphasized that public spaces belong to the community and cannot be usurped for private interests.</p>\n\n<p>The case originated from a PIL highlighting encroachments obstructing traffic and endangering pedestrians in Jaipur. Despite earlier court orders to remove these obstructions, inaction prompted a civil contempt petition. The Court clarified that contempt proceedings are exclusive to the Court and the directed parties, dismissing attempts to include additional contemnors. Subsequently, the court reactivated the original PIL to ensure effective action against encroachments.</p>\n\n<p>The High Court stressed that encroachments, which often evolve from temporary stalls into permanent structures, threaten public safety and erode urban infrastructure efficiency. The Court stated that no local authority or court order could legitimize these illegal occupations. It reinforced that public interest supersedes private encroachment, and roads and pedestrian pathways must remain unobstructed. The Court mandated that encroachment assessments must align with Master Plans and Zonal Development Plans to prevent arbitrary enforcement. Drawing support from the Supreme Court’s decision in *In Re: Manoj Tibrewal Akash*, the bench highlighted the urgent need to remove unauthorized structures from public spaces to safeguard civic infrastructure and public rights.</p>\n\n<p>The judgment underscores the broader challenge of managing urban growth while protecting public spaces, exposing systemic weaknesses in enforcement, monitoring, and potential collusion between authorities and violators. The Court's statewide directives indicate a need for a uniform and accountable enforcement mechanism to protect public land, reinforcing that sustainable urban development requires consistent enforcement of planning laws and zero tolerance for encroachments.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/rajasthan-hc-orders-statewide-crackdown-on-road-encroachments.jpg"
  },
  {
    "title": "Telangana Government Exempts Persons with Disabilities from Routine Transfers and Postings",
    "description": "<p>The Government of Telangana has issued G.O.Ms. No. 34, effective August 7, 2025, exempting government employees with disabilities and caregivers of dependents with disabilities from routine transfers and postings. This order operationalizes safeguards outlined in the Rights of Persons with Disabilities Act, 2016 (RPwD Act).</p>\n\n<p>The RPwD Act, 2016, aligns with the UN Convention on the Rights of Persons with Disabilities (UNCRPD), emphasizing equality of opportunity, non-discrimination, and reasonable accommodation. While Section 20(5) of the RPwD Act primarily focuses on job security, courts have interpreted it to include protection from arbitrary transfers. The Telangana order institutionalizes this principle by providing a policy-level exemption.</p>\n\n<p>The order, issued by the Department for Women, Children, Disabled and Senior Citizens, and with the concurrence of the Finance (HRM.I) Department, is binding on all state government departments. This initiative aligns with judicial precedents and policy directions emphasizing equal treatment and reasonable accommodation in employment for persons with disabilities. The Telangana order goes further by extending the exemption to caregivers, recognizing the potential for indirect discrimination. This progressive move strengthens workplace inclusivity, ensures stability for employees, and furthers the objectives of the RPwD Act, 2016.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/telangana-grants-exemption-from-routine-transfers-to-pwds.jpg"
  },
  {
    "title": "Aadhaar Not Mandatory: Labour Ministry Clarifies Authentication Rules for ESIC Beneficiaries",
    "description": "<p>On August 19, 2025, the Ministry of Labour and Employment issued Notification S.O. 3792(E) authorizing the Employees’ State Insurance Corporation (ESIC) to use Aadhaar authentication for identifying beneficiaries, superseding the notification dated January 13, 2023. The authorization aligns with the Aadhaar Act, 2016, and the Aadhaar Authentication for Good Governance Rules, 2020, with prior approval from MeitY and UIDAI.</p>\n\n<p>The notification aims to enhance transparency, prevent benefit leakage, and improve governance within the ESI scheme. While it allows ESIC to use Aadhaar for authentication, it emphasizes that such authentication is voluntary and requires explicit consent from the Aadhaar holder. Alternative identification methods, including Passport, PAN card, and Driving License, must be accepted, ensuring no beneficiary is denied benefits for not possessing or choosing not to use Aadhaar.</p>\n\n<p>This update balances digital governance with individual rights, adhering to Supreme Court directives on Aadhaar's usage. Employers and beneficiaries should be aware that while Aadhaar can streamline processes, it is not a mandatory requirement for accessing ESI benefits. ESIC is obligated to inform beneficiaries of alternative identification options.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/aadhaar-authentication-for-esic-clarified-as-voluntary.jpg"
  },
  {
    "title": "RPs Declared ‘Public Servants’: High Court Ruling Boosts Accountability in IBC",
    "description": "<p>The Madras High Court, in the case of Anil Kumar Ojha v. The State & Others, has ruled that Resolution Professionals (RPs) appointed under the Insolvency and Bankruptcy Code (IBC) qualify as \"public servants\" under Section 2(c) of the Prevention of Corruption Act, 1988. This decision resolves conflicting views among High Courts and has far-reaching implications for accountability within the insolvency ecosystem.</p>\n\n<p>The central legal issue before the court was whether an RP, appointed by the National Company Law Tribunal (NCLT), falls within the definition of a \"public servant\" due to their functions in managing debtor affairs, preserving assets, collating claims, and submitting reports to the NCLT, therefore performing duties connected with the administration of justice. The court emphasized the administrative and supervisory nature of an RP's duties, highlighting their centrality to the integrity of the insolvency process.</p>\n\n<p>The ruling clarifies the legal status of RPs, subjecting them to the anti-corruption framework of the Prevention of Corruption Act and requiring sanction for prosecution. This enhances the accountability framework for insolvency proceedings, prevents investigations into financial misconduct from being stalled, and strengthens the integrity of the insolvency system to better protect the interests of creditors. While awaiting a potential Supreme Court review, the judgment provides a vital check on the powers of RPs.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/madras-hc-resolution-professionals-are-public-servants.jpg"
  },
  {
    "title": "Finality Of Orders Vs. Master Plans: Allahabad Hc Draws Line On Ghaziabad Development Authority’s Powers",
    "description": "<p>The Allahabad High Court, in *Pheasant Infrastructure Private. Limited. v. State of U.P. & Others*, ruled that subordinate authorities cannot revisit a matter based on fresh grounds once an appellate authority's order has achieved finality. The case involved Pheasant Infrastructure's sanctioned group housing map in Ghaziabad, which the Ghaziabad Development Authority (GDA) initially cancelled and later refused to release, citing the Master Plan 2021 despite the project's 2006 sanction date.</p>\n\n<p>The court emphasized that the Commissioner's order setting aside the cancellation revived the original sanction, making reliance on the subsequent Master Plan impermissible. The court noted the original cancellation was uncommunicated, and thus legally ineffective. Furthermore, the court deemed that the GDA could not supplement its reasons for rejection in a counter affidavit, especially since they admitted the developer's compliance with the original sanction conditions. The court also cited the principle of parity, as another developer was granted approval under similar circumstances.</p>\n\n<p>The High Court quashed the GDA's orders and mandated the release of the sanctioned map within four weeks, asserting that final appellate orders must be respected. This ruling reinforces that vested rights, established through valid sanctions and completed formalities, are protected against retrospective application of master plans, thus promoting fairness and predictability in urban development.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/allahabad-hc-gda-cant-deny-sanction-citing-master-plan-2021.jpg"
  },
  {
    "title": "Judicial Intervention in Corporate Affairs: High Court Clarifies Scope of Interim Injunctions",
    "description": "<p>The Delhi High Court has delivered a significant judgment clarifying the limitations of judicial intervention in a company’s internal affairs, specifically regarding the granting of interim injunctions. The court set aside an interim injunction that had prevented Drharors Aesthetics Private Ltd. from convening board and general meetings to consider the removal of two directors. This decision underscores the principle that courts should avoid unduly interfering with a company's statutory right to manage its own affairs.</p>\n\n<p>The dispute originated from a business relationship between Drharors Aesthetics Private Ltd. and two former directors, Debulal Banerjee and Rahul Shawel. The respondents alleged denial of access to official email, withheld salaries, and short notice for board meetings concerning their removal, without sufficient supporting documentation. They claimed violations of Section 173(3) of the Companies Act, 2013, regarding adequate meeting notice. The Appellant Company countered that the proposed removal was necessary due to financial irregularities, breach of fiduciary duties, and acts of sabotage by the Respondents.</p>\n\n<p>The High Court's decision was based on a rejection of the District Judge’s rationale and an affirmation of established corporate law principles. The court found that the interim injunction was legally flawed as it stalled a lawful statutory process and disrupted the company’s corporate governance. The court directed the parties to pursue their remedies through arbitration or under the Companies Act, 2013, if necessary.</p>\n\n<p>In conclusion, the Delhi High Court's judgment sets a precedent against judicial overreach into a company’s internal affairs. By overturning the interim injunction, the court affirmed that the right to hold statutory meetings for the removal of directors is a fundamental aspect of corporate governance. The ruling clarifies that equitable relief is intended to preserve the subject matter of a dispute, not to paralyze a company’s operations or pre-emptively halt a lawful statutory process.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/delhi-hc-on-corporate-governance-limits-on-interim-relief.jpg"
  },
  {
    "title": "Supreme Court Upholds Sanctity of Arbitration, Bars Non-Signatories from Confidential Proceedings",
    "description": "<p>The Supreme Court of India, in *Kamal Gupta vs M/s. L.R. Builders Private Limited*, ruled that arbitration proceedings are strictly limited to signatories of the arbitration agreement. This decision reinforces party autonomy and confidentiality, asserting that non-signatories, even those with potentially affected interests, lack the right to attend arbitration proceedings. This ruling overturned Delhi High Court orders that had permitted non-signatories to attend proceedings after initially denying their request.</p>\n\n<p>The case stemmed from a family settlement, formalized in a Memorandum of Understanding (MoU), containing an arbitration clause. Non-signatories to the MoU sought permission to attend the arbitration proceedings, which was initially dismissed by the Delhi High Court. However, the High Court later allowed their attendance, a decision challenged by the signatories in the Supreme Court.</p>\n\n<p>The Supreme Court clarified that while doctrines might bind non-signatories in certain circumstances, being bound by an arbitral award does not automatically grant the right to participate in the proceedings. The Court emphasized arbitration as a consensual process, with participation rights limited to signatories. Allowing non-signatories would violate the confidentiality mandated by Section 42A of the Arbitration & Conciliation Act, 1996, which requires the arbitrator, arbitral institution, and parties to maintain confidentiality.</p>\n\n<p>The Court stated that non-signatories have limited remedies, primarily the ability to challenge the enforcement of an arbitral award against them under Section 36. Once an arbitrator is appointed under Section 11(6), the High Court loses jurisdiction, and subsequent applications from non-signatories constitute judicial overreach. This decision reinforces arbitration as a self-contained, party-driven process with minimal judicial intervention. In conclusion, the Supreme Court’s ruling reinforces that arbitration in India is a private, consensual, and confidential dispute resolution mechanism, strictly reserved for signatories. The Court imposed costs of ₹3,00,000 on the respondents (non-signatories), payable to the Supreme Court Advocates-on-Record Association within two weeks.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/supreme-court-on-confidentiality-in-arbitration-in-india.jpg"
  },
  {
    "title": "IBBI Continuing Professional Education Guidelines 2025: Enhancing Professional Excellence for Insolvency Professionals",
    "description": "<p>The Insolvency and Bankruptcy Board of India (IBBI) issued the Continuing Professional Education (CPE) Guidelines (Amendment) 2025 on August 13, 2025, updating the professional development framework for Insolvency Professionals (IPs). This amendment introduces mandatory in-person learning requirements and revises the CPE credit structure, reinforcing the objective of ensuring professional competence in insolvency practice under the Insolvency and Bankruptcy Code, 2016 (IBC).</p>\n\n<p>The IBC provides the legal framework for insolvency resolution. Section 196 empowers the IBBI to regulate IPs, Insolvency Professional Agencies (IPAs), and Information Utilities. This authorization allows the IBBI to set codes of conduct, professional standards, and continuous education requirements for IPs, ensuring their competence in statutory functions such as acting as Resolution Professionals (RPs), Liquidators, and Insolvency Professional Entities (IPEs). The 2025 amendment builds upon the original 2019 CPE Guidelines by introducing structured in-person learning and additional compliance requirements.</p>\n\n<p>The CPE Guidelines Amendment 2025 strengthens the regulatory framework for IPs in India. By mandating structured in-person learning and expanding the scope of relevant subjects, the amendment ensures that insolvency professionals remain equipped to handle the complexities of corporate and personal insolvency, thereby supporting the effective implementation of the IBC.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/ibbi-issues-updated-cpe-guidelines-2025-for-ips.jpg"
  },
  {
    "title": "IFSCA Clarifies Opening of Foreign Currency Accounts by Indian Residents in IFSCs",
    "description": "<p>On August 13, 2025, the International Financial Services Centres Authority (IFSCA) released a circular clarifying that Indian residents can now open and maintain foreign currency accounts with International Banking Units (IBUs) in International Financial Services Centres (IFSCs) without needing prior approval. This update harmonizes regulations with India's Foreign Exchange Management Act (FEMA) and related regulations, facilitating easier access to offshore-equivalent banking services within India.</p>\n\n<p>This clarification is a strategically important move for India's financial system. By allowing residents to hold foreign currency accounts in IBUs within IFSCs, the IFSCA effectively brings offshore banking capabilities into Indian jurisdiction. This provides exporters, corporations, and individuals with simpler access to foreign currency management tools, reinforcing GIFT City's position as a competitive global financial hub.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/ifsca-allows-foreign-currency-accounts-in-ifscs.jpg"
  },
  {
    "title": "Strengthening Investor Protection: SEBI’s Master Circular on Debenture Trustees (2025)",
    "description": "<p>On August 13, 2025, the Securities and Exchange Board of India (SEBI) released a Master Circular for Debenture Trustees (DTs), consolidating and updating the regulatory framework governing them. This circular replaces numerous prior circulars with a single, comprehensive document, streamlining compliance and reinforcing investor protection within India's debt markets.</p>\n\n<p>Debenture Trustees, appointed under the SEBI (Debenture Trustees) Regulations, 1993, safeguard the interests of debenture holders. They serve as fiduciaries, ensuring issuers adhere to debenture terms, trust deeds, and relevant SEBI regulations. This Master Circular compiles existing directives into a unified resource for DTs, issuers, and investors. Key areas covered include trustee obligations, compliance requirements, and standardised procedures.</p>\n\n<p>Effective immediately from August 13, 2025, the Master Circular supersedes all previous SEBI circulars on the subject. It represents SEBI's commitment to strengthening India's corporate bond market by standardising trustee responsibilities and consolidating compliance requirements. This initiative enhances regulatory clarity and standardization, ultimately bolstering investor protection and corporate debt governance. Corporate entities should review existing debenture structures, compliance frameworks, and trustee arrangements to align with the new guidelines.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/sebi-issues-master-circular-for-debenture-trustees-2025.jpg"
  },
  {
    "title": "India’s First Digital Connectivity Rating System for Properties Unveiled by TRAI",
    "description": "<p>On August 13, 2025, the Telecom Regulatory Authority of India (TRAI) launched the Manual for Assessment of Digital Connectivity in Properties, operationalizing the Rating of Properties for Digital Connectivity Regulations, 2024. This framework marks the first national effort to evaluate digital infrastructure quality in residential, commercial, and institutional properties, addressing a significant gap in India’s connectivity ecosystem. The move aims to ensure indoor digital experiences align with increasing reliance on online services.</p>\n\n<p>The manual, issued under Section 36 of the TRAI Act, establishes uniform parameters for assessing a property's digital connectivity readiness and performance. These parameters result in a digital connectivity rating, similar to energy efficiency ratings, empowering buyers and tenants to make informed decisions. This transparent and standardized rating system reinforces consumers' right to information, aligning with the Consumer Protection Act, 2019, and the Real Estate (Regulation and Development) Act, 2016 (RERA).</p>\n\n<p>The framework implicitly acknowledges digital connectivity as essential infrastructure, building on the National Digital Communications Policy, 2018, and judicial recognition of internet access as a fundamental right. It provides state governments and municipal authorities with a legal instrument to integrate digital connectivity standards into regulatory processes, including Building Codes and Development Control Regulations.</p>\n\n<p>The framework's non-binding nature and potential cost implications pose challenges. The system will require regular updates to remain relevant amid rapid advancements in network technology. Despite these challenges, TRAI's manual represents a pioneering step towards a structured and legally supported approach to digital connectivity assessment. Integration into real estate regulation, consumer protection frameworks, and urban planning codes could significantly influence buyer behavior, developer practices, and state-level legislative amendments, furthering India's goal of universal digital access.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/trai-launches-indias-first-digital-connectivity-rating.jpg"
  },
  {
    "title": "Modernizing India’s Maritime Sector: The Coastal Shipping Act, 2025",
    "description": "<p>The Coastal Shipping Act, 2025, passed by the Indian Parliament and assented to on August 9, 2025, marks a significant legislative reform for India's maritime sector. Replacing Part XIV of the Merchant Shipping Act, 1958, this Act aims to consolidate and amend laws governing coastal shipping, promote domestic participation, and ensure a nationally owned and operated coastal fleet for security and commercial needs, aligning India with global standards. It is designed to unlock the potential of India’s 11,098 km coastline and support the “Viksit Bharat” and “Aatmanirbhar Bharat” initiatives.</p>\n\n<p>The Act is a strategic enabler for economic growth, employment, and logistics efficiency, with a goal to increase coastal cargo share to 230 million metric tonnes by 2030. It simplifies the legal framework, reduces regulatory burdens, and enhances the competitiveness of Indian vessels, minimizing dependence on foreign vessels and bolstering supply-chain security.</p>\n\n<p>Key provisions include Chapter II, which regulates coasting trade through a licensing system administered by the Director-General, considering factors such as applicant history, crew nationality, and national security. Chapter III mandates the creation of a National Coastal and Inland Shipping Strategic Plan and a publicly accessible National Database for Coastal Shipping. Chapter IV governs the licensing of chartered vessels operated by Indian citizens or entities. Chapter V outlines penalties for offenses, including imprisonment and fines for operating without a license or providing false information. Chapter VI grants the Central Government authority to issue policy directions and create implementing rules, and it repeals Part XIV of the Merchant Shipping Act, 1958, with a savings clause to ensure a smooth transition.</p>\n\n<p>The Coastal Shipping Act, 2025, is a decisive step towards a modern, efficient, and self-reliant maritime ecosystem, enhancing supply chain resilience and driving economic growth. This legislation is part of a comprehensive package including the Merchant Shipping Bill, 2025, and the Carriage of Goods by Sea Bill, 2025, demonstrating a commitment to transforming India into a global maritime hub. The focus now shifts to the practical implementation of these reforms, guided by the National Coastal and Inland Shipping Strategic Plan.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/modernizing-indias-maritime-sector-the-coastal-shipping-act-2025.jpg"
  },
  {
    "title": "Delhi HC Quashes ₹12 Lakh Cost in VI-John v. Dabur, Holds Procedural Penalties Must Be Proportionate",
    "description": "<p>The Delhi High Court overturned a ₹12,00,000 cost imposed on Vi-John Healthcare India LLP by the Trial Court for a 48-day delay in filing a Written Statement in a trademark infringement suit filed by Dabur India Ltd. The High Court emphasized the importance of judicial discretion, proportionality, and the consideration of subsequent developments in procedural matters.</p>\n\n<p>The dispute arose from Dabur's allegations that Vi-John's toothpaste packaging was deceptively similar to Dabur’s Meswak toothpaste. The Trial Court had initially directed Vi-John to file its Written Statement within 30 days, with a penalty of ₹25,000 per day of delay. The imposed cost was challenged by Vi-John, which explained the delay was due to ongoing settlement efforts.</p>\n\n<p>Justice Tejas Karia held that the cost was disproportionate and legally unsustainable, noting that while the initial order aimed to promote procedural discipline, it should not curtail judicial discretion. The High Court emphasized that the Trial Court should have considered subsequent developments and the disproportionate nature of the penalty, as Dabur's primary relief sought was ₹2,50,000 in damages, significantly less than the imposed cost. The ruling reaffirms that procedural orders prescribing costs for delay must be applied flexibly, and judicial discretion should prioritize fairness and proportionality.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/delhi-hc-quashes-%e2%82%b912-lakh-procedural-cost-in-vi-john-case.jpg"
  },
  {
    "title": "Supreme Court Upholds Insurer Liability in Incomplete Vehicle Transfer Case",
    "description": "<p>The Supreme Court of India overturned a High Court decision, reaffirming an insurance company's liability for compensation awarded by the Motor Accidents Claims Tribunal (MACT) following a motor vehicle accident. The case centered on a dispute between the insurer, seeking to avoid liability, and the driver/ostensible owner of the vehicle, with key issues including the status of the injured parties as gratuitous passengers and the legal transfer of vehicle ownership.</p>\n\n<p>The insurance company argued that the injured were gratuitous passengers and that the vehicle ownership had been transferred to the driver, thus voiding their obligation. The Supreme Court rejected both arguments. It determined that the injured, petty hawkers carrying goods, were not gratuitous passengers under Section 147(1)(b)(i) of the Motor Vehicle Act, 1988, and were therefore covered under the policy. Furthermore, the Court found that the vehicle's ownership transfer was incomplete as a final payment was pending and the transfer of registration had not occurred as per Section 50 of the Motor Vehicle Act, 1988.</p>\n\n<p>The Supreme Court emphasized a purposive interpretation of the Motor Vehicle Act, 1988, to protect accident victims. The ruling reinforced the principle that the registered owner remains liable for compensating accident victims, and this liability must be indemnified by the insurer. The Court allowed the appeals, directing the insurer to satisfy the compensation awards as originally determined by the MACT, highlighting a victim-centric approach to motor accident claims.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/financial-vs-operational-leases-under-ibc-2016.jpg"
  },
  {
    "title": "Born Abroad, Raised in India: Legal Protection for Children of Indian Citizens in Transnational Families",
    "description": "<p>The Rajasthan High Court addressed the complex legal issues surrounding a child born abroad to Indian parents in *Seher Gogia v. FRRO & Ors.* The case involved a five-year-old Australian citizen, Seher Gogia, whose visa extension was jeopardized due to a matrimonial dispute between her Indian parents. This situation placed her at risk of being declared an illegal migrant, despite both parents being Indian citizens.</p>\n\n<p>The court emphasized that the child's best interests are the paramount consideration and referenced the UN Convention on the Rights of the Child (UNCRC). It held that Seher could not be deported solely because her mother refused to provide a No Objection Certificate (NOC) for the visa extension, particularly as the child resided with her father and no custody order favored the mother. The Foreigners Regional Registration Officer (FRRO) was directed to extend the visa without the mother's NOC.</p>\n\n<p>While Seher had not applied for an Overseas Citizenship of India (OCI) card, the court noted that children born abroad to Indian citizens could acquire Indian citizenship by descent under Section 4 of the Citizenship Act, 1955. The court directed the Ministry of Home Affairs (MHA) to revisit Indian laws and policies to address transnational child citizenship issues, advocating for harmonization with international child rights norms and a flexible approach in cases involving minor children of Indian citizens.</p>\n\n<p>The judgment reaffirms child-centric justice in immigration matters, protecting children from becoming collateral damage in marital disputes or victims of administrative rigidity. It bridges the gap between citizenship law, immigration regulation, and constitutional rights, applying a humanitarian and rights-based approach. The case sets a precedent for flexible, welfare-first solutions in cross-border family situations and demonstrates the importance of aligning domestic law with international conventions to protect vulnerable children.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/born-abroad-raised-in-india-transnational-child-citizenship-law.jpg"
  },
  {
    "title": "Delhi HC Upholds Equal Co-Ownership in Jointly Purchased Property, Limits Scope of Shared Household Rights",
    "description": "<p>The Delhi High Court, in *Smita Jina v. Amit Kumar Jina*, affirmed the principle of equal co-ownership in a jointly purchased property by a husband and wife, emphasizing that both parties hold a 50% share. The Court addressed the wife's argument that her right to reside in the \"shared household\" under the Protection of Women from Domestic Violence Act (PWDV Act), 2005, should prevent the husband from seeking partition.</p>\n\n<p>The case originated from a property purchased jointly in Delhi during the couple's marriage, financed through a joint loan. Following matrimonial discord, the husband sought partition of the property. The wife contested, claiming a larger financial contribution and asserting her right to reside in the property as a shared household under the PWDV Act. She argued that her residence rights should override the co-owner's right to partition.</p>\n\n<p>The Court acknowledged the wife’s right to residence under the PWDV Act but clarified that this right does not confer ownership or the ability to block a co-owner's legal right to partition. The Court emphasized that in the absence of specified shares in the sale deed, equal ownership is presumed under Section 45 of the Transfer of Property Act, 1882. Ultimately, the High Court upheld the Family Court’s order for equal division, balancing co-ownership rights with statutory residence protections, and noting the wife's financial independence and the husband's legitimate right to partition.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/delhi-hc-on-jointly-owned-property-rights-shared-household.jpg"
  },
  {
    "title": "Draft Maharashtra Child Labour Amendment Rules 2025: A Step Towards Child Protection",
    "description": "<p>The Government of Maharashtra has introduced the Draft Child Labour (Prohibition and Regulation) Amendment Rules, 2025, demonstrating a reinforced commitment to eradicating child labor. The proposed amendments aim to strengthen enforcement, increase public awareness, and ensure comprehensive rehabilitation of rescued children, aligning with constitutional obligations and international standards.</p>\n\n<p>Despite existing legal frameworks, child labor persists due to enforcement gaps, economic inequalities, and regional challenges. The proposed rules address these issues by aligning Maharashtra's regulations with constitutional safeguards, such as Article 24, and international commitments like the UNCRC and ILO conventions. These amendments aim to tackle modern challenges, improve inter-departmental coordination, and promote a holistic approach to the welfare and rehabilitation of affected children.</p>\n\n<p>The Draft Maharashtra Child Labour (Prohibition and Regulation) (Amendment) Rules, 2025 represent a pivotal step in the state’s efforts to eradicate child labor. The success of these rules hinges on effective implementation, requiring adequate training, resources, and support for authorities, as well as a commitment from employers to prioritize compliance. The amendments should be viewed as a crucial milestone in the journey towards a child labor-free Maharashtra.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/maharashtra-draft-rules-2025-to-curb-child-labour.jpg"
  },
  {
    "title": "Legal Showdown in Online Gaming: Delhi HC Grants Injunction in favour of Gameskraft Against Rogue Websites",
    "description": "<p>The Delhi High Court ruled in favor of Gameskraft Technologies, granting an interim injunction against rogue websites infringing on its trademarks and copyrights. The decision protects Gameskraft's brands, including Rummy Culture and Ludo Culture, from unauthorized platforms mimicking their games.</p>\n\n<p>Gameskraft, a prominent online skill-based gaming company, alleged that numerous websites and applications were exploiting their trademarks and copyrighted content. These platforms misled users by offering fake versions of their games and posing risks to personal and financial data. The court observed clear instances of trademark infringement and misrepresentation.</p>\n\n<p>The court restrained the defendants from using Gameskraft's trademarks and copyrights. Several app stores, rogue websites, and social media accounts were ordered to remove infringing content. Social media platforms like Instagram and X (formerly Twitter) were directed to suspend accounts operated by entities like \"RummyVenture\". Domain registrars and web hosting services were instructed to suspend access to identified rogue domains. The Department of Telecommunications and the Ministry of Electronics and Information Technology were ordered to block access to the listed infringing websites.</p>\n\n<p>A subsequent compliance hearing ensured adherence to the interim injunction, with defendants directed to submit compliance reports. The case highlights the Delhi High Court's commitment to protecting intellectual property rights in the online gaming industry.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/delhi-hc-backs-gameskraft-blocks-rogue-gaming-sites.jpg"
  },
  {
    "title": "MSC Elsa 3 Fallout: Kerala High Court Moves to Secure Victims’ Claims Through Sister Ship Arrest",
    "description": "<p>Following the sinking of the container ship MSC Elsa 3 off the coast of Kochi in May 2025, the Kerala High Court has ordered the conditional arrest of its sister ship, MV MSC Palermo, to secure claims for damages. The MSC Elsa 3 incident, which involved the loss of over 640 containers, including hazardous materials, prompted legal action from local fishermen seeking approximately ₹2.6 crore for damage to their vessels and gear.</p>\n\n<p>The court invoked Rule 19 of the Kerala High Court Admiralty Rules, allowing the arrest despite the absence of a caveat against arrest by the vessel's owner. Simultaneously, the Kerala government filed a separate suit demanding ₹9,531 crore for environmental and economic damage. In response, Mediterranean Shipping Company (MSC) filed a suit seeking limitation of liability and contesting the state's jurisdiction and the extent of environmental damage.</p>\n\n<p>This action follows similar instances where the Kerala High Court previously sanctioned the arrest of other MSC sister vessels to secure claims from cargo owners. Beyond private claims, public interest litigations have also emerged, seeking investigations and the establishment of a Coastal Victims Compensation, Rehabilitation, and Environment Restoration Fund (CVCRERF). A petition seeking comprehensive compensation for affected communities has been admitted and is scheduled for further hearing. The arrest of MV MSC Palermo underscores the Kerala High Court's commitment to securing compensation for victims and the state while the legal battle surrounding jurisdiction, liability, and environmental responsibility continues.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/kerala-hc-arrests-msc-palermo-in-%e2%82%b92-6-cr-fishermen-claims.jpg"
  },
  {
    "title": "Delhi High Court Upholds Divorce Based on Cruelty and Long-Term Separation",
    "description": "<p>The Delhi High Court recently dismissed an appeal by Anita Sharma, affirming a divorce decree granted to her husband, Naresh Kumar Sharma, by the Family Court at Tis Hazari. The court found that the marriage, which took place in 1989, had irretrievably broken down after nearly 15 years of separation. The decision was based on findings of cruelty under Section 13(1)(ia) of the Hindu Marriage Act, 1955.</p>\n\n<p>The case originated from disputes including alleged abandonment, financial neglect, and the sale of the matrimonial home without the wife's consent. The husband filed for divorce citing cruelty due to defamatory complaints filed by his wife to various authorities, including his employer, Bharat Petroleum Corporation Limited (BPCL). Anita Sharma appealed the Family Court’s divorce decree, arguing that the allegations were vague and unsubstantiated, and her actions were pleas for assistance. She also challenged the admissibility of audio recordings presented as evidence.</p>\n\n<p>The High Court rejected her arguments, emphasizing that repeated complaints to the husband's employer with allegations of adultery and misconduct constituted mental cruelty intended to damage his professional reputation. The court also noted the significance of the prolonged separation, indicating a complete breakdown of the marital relationship. The judgment references precedents like *Joydeep Majumdar v. Bharti Jaiswal Majumdar* and *N.G. Dastane v. S. Dastane* to support the conclusion that the wife's conduct amounted to cruelty, justifying the dissolution of the marriage. The ruling highlights that such complaints to a spouse’s employer can be deemed mental cruelty, and long-term separation coupled with acrimony strengthens the case for divorce.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/delhi-hc-affirms-divorce-for-cruelty-15-year-separation.jpg"
  },
  {
    "title": "Kerala High Court Upholds Tata Tea's Right to Reclaim Munnar Property",
    "description": "<p>The Kerala High Court ruled in favor of Tata Tea Ltd. in a long-standing property dispute in Munnar, dismissing an appeal by a former licensee and affirming the company's right to reclaim possession of its building. The ruling upholds that a company's name change does not invalidate its legal rights or disrupt ongoing litigation. Additionally, it clarifies that disputes involving private property in Munnar do not fall under the jurisdiction of the defunct Munnar Special Tribunal, which primarily handled cases concerning government land.</p>\n\n<p>The case originated in 2002 when Tata Tea Ltd. filed a suit against Antony, a licensee who defaulted on payments and failed to renew his agreement. The defendant argued that the company no longer existed due to name changes (to Tata Global Beverages Ltd. and later to Tata Consumer Products Ltd.) and that the civil court lacked jurisdiction after the enactment of the Munnar Special Tribunal Act, 2010. Both the trial court and the first appellate court ruled in favor of Tata Tea.</p>\n\n<p>In the High Court, the appellant argued that the decree was invalid due to the company's name changes and that the Munnar Special Tribunal had exclusive jurisdiction. The Court rejected these arguments, stating that name changes under the Companies Act do not affect a company's legal continuity or ongoing proceedings. It also clarified that the Munnar Special Tribunal Act applied primarily to government land disputes and unauthorized constructions, not private contractual disputes. Furthermore, the Tribunal has since been abolished.</p>\n\n<p>The High Court upheld the lower courts' decisions, affirming Tata Tea Ltd.'s right to recover possession and seek damages. The ruling reaffirms key legal principles regarding corporate identity and jurisdictional scope, concluding a decades-long property dispute.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/kerala-hc-backs-tata-tea-in-long-running-munnar-property-row.jpg"
  },
  {
    "title": "Bombay High Court: Aadhaar, PAN, or Voter ID Not Proof of Citizenship; Bail Denied",
    "description": "<p>The Bombay High Court denied bail to a man accused of being a Bangladeshi national who allegedly entered India illegally and fraudulently obtained Indian identity documents. The Court clarified that documents like Aadhaar, PAN, or Voter ID do not, in themselves, establish citizenship, which is determined by the Citizenship Act, 1955.</p>\n\n<p>The case, *Babu Abdul Ruf Sardar V/s. The State of Maharashtra*, involves accusations that the accused illegally entered India, posed as a citizen, and secured Indian identity documents. Police investigations reportedly found birth certificates indicating Bangladesh as his and his mother's place of birth, along with communication records linking him to contacts in Bangladesh.</p>\n\n<p>The Court emphasized that possessing identification documents does not override the statutory requirements for citizenship and referenced Section 9 of the Foreigners Act, 1946, which shifts the burden of proof onto the individual to demonstrate lawful citizenship when credible evidence raises suspicion about their nationality.</p>\n\n<p>The Court cited concerns about the incomplete investigation, the seriousness of the allegations involving document fabrication and potential national security implications, and the risk of the accused fleeing or tampering with evidence. It also recognized the need for inter-agency collaboration, including foreign authorities, for verification. The court permitted the accused to reapply for bail if the trial extends beyond one year.</p>\n\n<p>The ruling reinforces the principle that citizenship is a legal status governed by the Citizenship Act, 1955, and not simply a matter of possessing identification documents. It underscores the need for seriousness in cases involving forged documents and cross-border connections, especially when national security is at stake, and prioritizes the broader public interest in assessing bail applications.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/aadhaar-pan-or-voter-id-not-proof-of-citizenship.jpg"
  },
  {
    "title": "Kerala HC Clarifies MSME Status for Wholesale/Retail Traders: Limited to Priority Lending, No QCO Exemption",
    "description": "<p>The Kerala High Court, in *M/s. Luxe Panel Distributors v. Additional Commissioner of Customs & Anr.*, has ruled that wholesale and retail traders registered as Micro Enterprises under the MSMED Act, 2006, are not entitled to exemption from BIS certification under the Plywood and Wooden Flush Door Shutters (Quality Control) Order, 2024 (QCO). The court clarified that their MSME recognition is limited to availing priority sector lending.</p>\n\n<p>The case arose after Customs officials denied clearance to a consignment of plywood imported by the petitioner, M/s. Luxe Panel Distributors, citing the lack of BIS certification mandated by the QCO. The petitioner argued that, as a registered Micro Enterprise, it was entitled to a deferred compliance period stipulated in the QCO.</p>\n\n<p>The court rejected this argument, emphasizing that the MSME benefits extended to wholesale and retail traders are specifically restricted to credit-related advantages. Citing Ministry of MSMEs Office Memoranda, the court held that the QCO exemption for Micro Enterprises must be strictly construed, and the petitioner's MSME registration did not confer eligibility for exemptions like the BIS certification requirement. The writ petition was subsequently dismissed.</p>\n\n<p>The judgment underscores that MSME registration for wholesale and retail traders does not automatically translate into exemptions under other regulatory frameworks. It serves as a cautionary precedent, advising businesses to thoroughly assess the scope of their MSME classification before claiming benefits under schemes like Quality Control Orders.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/kerala-hc-msme-status-no-shield-from-qco-for-traders.jpg"
  },
  {
    "title": "Bombay High Court Rules Maintenance Charges Must Be Proportional to Apartment Size",
    "description": "<p>The Bombay High Court, in the case of Sachin Malpani and Ors. vs. Nilam Patil and Ors., has ruled that maintenance charges for condominiums registered under the Maharashtra Apartment Ownership Act, 1970, must be levied proportionally to each apartment owner's undivided share in common areas and facilities. This decision emphasizes the Apartment Act's legal supremacy over internal resolutions or practices.</p>\n\n<p>The ruling arose from a dispute at the \"Treasure Park\" condominium where some owners challenged the previous practice of equal maintenance charges, regardless of apartment size. The petitioners argued that the Deputy Registrar of Co-operative Societies lacked jurisdiction and that common amenities should be funded equally by all residents. The respondents, however, cited government notifications and the condominium's Deed of Declaration to support proportional maintenance charges.</p>\n\n<p>The High Court upheld the Deputy Registrar's authority, citing government notifications delegating powers under the Maharashtra Co-operative Societies Act. The court then emphasized that Section 10 of the Apartment Act mandates that common expenses be shared according to the percentage of undivided interest in common areas, a provision that cannot be overridden. The Court reinforced this finding through an examination of the condominium's Deed of Declaration, which linked an owner's share of expenses to their contribution to the Maintenance Corpus Fund based on apartment size. The ruling establishes a fair and legally sound method for calculating maintenance fees, aligning financial responsibility with property share.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/maharashtra-apartment-ownership-act-hc-clarifies-charges.jpg"
  },
  {
    "title": "CAFE Norms Get Enforcement Powers: What the Draft Energy Conservation (Compliance Enforcement) Rules, 2025 Mean for India’s Auto Sector",
    "description": "<p>The Draft Energy Conservation (Compliance Enforcement) Rules, 2025, represent a significant shift in the enforcement of India's Corporate Average Fuel Economy (CAFE) standards. Previously reliant on data submissions and administrative follow-up, CAFE compliance is now being elevated to a legally binding obligation with defined penalties for non-compliance. The Bureau of Energy Efficiency (BEE) will administer these rules under the Energy Conservation Act, 2001.</p>\n\n<p>These rules directly affect all Original Equipment Manufacturers (OEMs) selling passenger vehicles in India, both domestic and foreign. Automakers are now subject to a clear, statutory process for identifying and penalizing CAFE non-compliance. This includes mandatory reporting and verification procedures. If found in violation, automakers face financial penalties and have the right to appeal, first to the Adjudicating Officer and then to the Appellate Tribunal for Electricity.</p>\n\n<p>The implementation of these rules will require automakers to prioritize both achieving fuel efficiency targets through product strategy and maintaining rigorous reporting systems. The shift from policy oversight to a statutory, penalty-backed regime transforms CAFE compliance from a peripheral corporate responsibility to a central element of risk management and governance within the automotive industry.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/cafe-norms-now-enforceable-draft-rules-signal-legal-shift.jpg"
  },
  {
    "title": "Conditional Divorce: Supreme Court Orders Alimony in the Form of Apartment and Arrears",
    "description": "<p>The Supreme Court of India recently adjudicated the case of *Anurag Vijaykumar Goel v. State of Maharashtra & Anr.*, dissolving a marriage on the grounds of irretrievable breakdown and addressing related criminal proceedings. The court aimed to deliver complete justice after years of marital discord where reconciliation proved impossible.</p>\n\n<p>The case originated from a second marriage between the appellant and respondent, which lasted only one year and nine months. Disputes arose, leading to allegations of harassment and domestic violence from both sides. The wife initiated criminal prosecution under the Domestic Violence Act, while the husband filed for divorce and alleged contempt after the wife withdrew from a mutual consent agreement. The Supreme Court appeal followed the High Court's refusal to quash the criminal proceedings.</p>\n\n<p>Exercising its power under Article 142, the Supreme Court dissolved the marriage, deeming it unworkable and beyond repair. The court also quashed criminal proceedings under Section 498-A of the IPC, citing the allegations as vague and disproportionate to marital disputes. As a condition of the divorce, the husband was ordered to settle outstanding apartment maintenance charges and execute a gift deed for the Mumbai apartment and parking spaces in favor of the wife, providing her with significant compensation and allowing both parties to move forward. This ruling offers valuable guidance for similar matrimonial cases in the future.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/supreme-court-grants-conditional-divorce-with-apartment-alimony.jpg"
  },
  {
    "title": "Locked Out of Equality: How One Provision of the Hindu Succession Act Bars Tribal Women",
    "description": "<p>The Hindu Succession Act (HSA) of 1956, despite a 2005 amendment aimed at gender parity, contains Section 2(2) which excludes Scheduled Tribe women from statutory inheritance rights unless specifically notified by the Central Government. This exclusion was challenged in *Manni Devi v. Rama Devi & Ors.* before the Rajasthan High Court, highlighting how legislative inaction perpetuates structural inequality.</p>\n\n<p>The case involved a Meena woman, Manni Devi, who contested a gift deed executed by her father that transferred ancestral land to another party, effectively denying her inheritance. Her claim was dismissed by the Board of Revenue based on Section 2(2) of the HSA. The Rajasthan High Court reviewed the matter to decide if the petitioner can contest the alienation of ancestral property given the exception stated in Section 2(2).</p>\n\n<p>Justice Anoop Kumar Dhand noted the exclusionary section and set aside the Board of Revenue's order, restoring Manni Devi's claim to be heard on its merits. The Court emphasized the need for urgent legislative reform or a central notification to extend the HSA's benefits to Scheduled Tribe women. Ultimately, the court restored Manni Devi's claim, and called for legislative action.</p>\n\n<p>The court recognized that inheritance rights are fundamental to economic empowerment and social equality. Amending Section 2(2) or issuing a central notification is necessary to ensure uniform property rights for all women in India, regardless of community status, transforming court pronouncements into lasting, uniform rights for all women in India. The *Manni Devi* verdict highlights the legal gap that deprives tribal women of their inheritance, emphasizing that equality and dignity should be unconditional and universally applied.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/rajasthan-hc-questions-st-womens-exclusion-from-hindu-succession-act.jpg"
  },
  {
    "title": "Estranged Since ’87, Still in Court: Septuagenarian Denied Interim maintenance as Husband’s Means Run Dry",
    "description": "<p>The Delhi High Court upheld a Family Court order denying interim maintenance to 74-year-old Yashwani Verma from her 73-year-old estranged husband, Virender Verma, in MAT.APP.(F.C.) 174/2023. The case highlights the court's approach to balancing genuine need against the proven capacity to pay, particularly when both spouses are past retirement age and have been separated for an extended period.</p>\n\n<p>Yashwani and Virender married in 1978 but separated in 1987. A joint divorce petition filed in 2003 lapsed when Yashwani withdrew her consent. In 2021, Yashwani filed a petition seeking to declare any second marriage by Virender as void and simultaneously sought interim maintenance of ₹60,000 per month.</p>\n\n<p>The Family Court rejected the maintenance plea, citing that both parties were of advanced age, living separately by choice, and that Yashwani was supported by her employed sons. It also invoked Section 125(4) Cr.P.C., which disallows maintenance for spouses living separately without sufficient cause.</p>\n\n<p>The High Court affirmed the Family Court's decision, emphasizing that Section 24 HMA serves to prevent destitution rather than equalize lifestyles. The court considered Yashwani's resources, including pension, tuition income, investments, and support from her sons, and found them adequate. Conversely, it noted Virender's unemployment, debt, and lack of retiral benefits. The court concluded that the maintenance plea appeared driven by the alleged second marriage and property dealings rather than genuine financial distress. The ruling clarifies that age does not guarantee entitlement and that courts will carefully assess need and capacity to pay in long-standing marital disputes.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/delhi-hc-denies-interim-alimony.jpg"
  }
]