[
  {
    "title": "Supreme Court Addresses Conflict Between Forest Rights Act and Forest Conservation Act on Tribal Housing",
    "description": "<p>In Sugra Adiwasi & Ors. v. Pathranand & Ors., the Supreme Court of India examined the intersection of the Forest Rights Act (FRA) and the Forest Conservation Act (FCA) concerning the construction of permanent housing for forest dwellers. The court acknowledged the conflict between recognizing the rights of tribal communities to adequate housing and the need to preserve forest ecology.</p>\n\n<p>The case arose from a dispute over whether forest dwellers could construct permanent homes on forest land without violating the FCA. Petitioners argued the FRA grants habitation rights, including durable housing, while the Union of India emphasized the FCA's role in forest preservation. The core legal issue was whether FRA-recognized construction could proceed despite FCA regulations.</p>\n\n<p>The Court analyzed both Acts, noting the FRA's limited \"notwithstanding\" clause doesn't explicitly authorize housing construction without FCA oversight. It reaffirmed that the FCA regulates, rather than prohibits, non-forest activities, emphasizing forest protection as a constitutional obligation. The court stressed the need for a \"convergent interpretation\" where both statutes coexist, protecting human and environmental interests.</p>\n\n<p>Acknowledging the State's duty to ensure minimum living conditions, the Supreme Court directed the Ministry of Environment, Forest and Climate Change and the Ministry of Tribal Affairs to formulate a regulatory mechanism enabling dwelling construction for forest dwellers, ensuring FCA compliance. This directive emphasizes inter-departmental coordination and a balanced approach, reflecting a commitment to both social justice and environmental stewardship.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/supreme-court-balances-forest-rights-and-conservation.jpg"
  },
  {
    "title": "Delhi High Court on Mental Cruelty: False Allegations, Vexatious Litigation and the Boundaries of Matrimonial Conduct",
    "description": "<p>The Delhi High Court in X v. Y upheld a divorce decree based on mental cruelty, reaffirming the definition of cruelty under Section 13(1)(ia) of the Hindu Marriage Act, 1955. The court dismissed the wife's appeal, emphasizing that a consistent pattern of false allegations, unsubstantiated criminal complaints, and vindictive litigation constitutes sufficient grounds for divorce due to the mental anguish inflicted on the other spouse.</p>\n\n<p>The case involved a marriage marred by extensive litigation, with the wife initiating numerous complaints, including those under Section 498A of the IPC and the Domestic Violence Act, most of which were later found to be baseless. The Family Court initially granted the divorce, citing the severe mental agony and social humiliation suffered by the husband due to the wife's actions.</p>\n\n<p>The High Court's decision highlighted that mental cruelty encompasses not only physical harm but also emotional distress caused by repeated baseless accusations, character assassination, and the misuse of legal provisions. While \"irretrievable breakdown of marriage\" is not a statutory ground for divorce, the court acknowledged that prolonged separation and loss of trust, in conjunction with demonstrated cruelty, support the dissolution of marriage. The judgment serves as a significant precedent, urging courts to recognize the psychological impact of relentless litigation and ensuring that legal remedies are not weaponized for personal vendettas within matrimonial disputes.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/delhi-hc-defines-mental-cruelty-in-matrimonial-disputes.jpg"
  },
  {
    "title": "Statutory Stop-Watch Re-Set: Section 17(5) SARFAESI Act Comes Alive",
    "description": "<p>The Supreme Court, in the case of Indian Overseas Bank v. M/s Radhey Infra Solutions (Pvt.) Ltd., addressed the issue of delays in debt recovery proceedings under the SARFAESI Act. The court emphasized that the statutory timelines mandated by Section 17(5) of the Act must be strictly adhered to by Debt Recovery Tribunals (DRTs).</p>\n\n<p>The case arose from a borrower's application under Section 17(1) of the SARFAESI Act, which remained pending before the DRT, Dehradun, for an extended period without any extension orders or recorded reasons. The Supreme Court underscored that Section 17(5) requires DRTs to dispose of such applications within 60 days, extendable by a maximum of four months with written justification for each extension. The Court criticized the High Court's previous order for not enforcing the timeline.</p>\n\n<p>The Supreme Court directed the DRT, Dehradun, to immediately comply with Section 17(5) of the SARFAESI Act and dispose of the pending application expeditiously. This ruling serves as a reminder to all DRTs that the statutory timelines are not merely suggestive but are crucial for ensuring timely debt recovery and adjudication of borrower grievances, thereby reinforcing the importance of time in commercial matters.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/supreme-court-revives-section-175-sarfaesi-timeline.jpg"
  },
  {
    "title": "No Shortcut on Stamp Duty – Supreme Court Says Security Bonds by Debtors Are Mortgage Deeds",
    "description": "<p>The Supreme Court of India, in M/s Godwin Construction Pvt. Ltd. v. Commissioner, Meerut Division & Anr., clarified the classification of instruments for stamp duty under the Indian Stamp Act, 1899. The Court ruled that when a party executes a deed to secure its own obligations, it is classified as a mortgage deed under Article 40, regardless of being titled a \"Security Bond cum Mortgage Deed.\" This is based on the principle that the substance of the transaction prevails over its form.</p>\n\n<p>The case originated from a dispute where M/s Godwin Construction Pvt. Ltd. executed a \"Security Bond cum Mortgage Deed\" to the Meerut Development Authority (MDA) to secure development obligations, paying stamp duty under the \"Security Bond\" category. Authorities later deemed it a mortgage deed, demanding additional stamp duty. The Supreme Court, upholding lower court decisions, emphasized that Article 57 (Security Bond) applies only when a third-party surety guarantees another's obligations, as per Section 126 of the Indian Contract Act, 1872. Because the developer mortgaged its own property and no surety was involved, Article 40 (Mortgage Deed) was deemed applicable.</p>\n\n<p>The judgment reinforces that the true legal character of a document is determined by its operative terms and recitals, not merely its title. Where a party mortgages their own property to secure obligations, it constitutes a mortgage deed. This ruling offers clarity for developers, lenders, and authorities, minimizing ambiguity and ensuring consistent stamp duty assessment in real estate and financing transactions. It also underscores the importance of precise legal language in security documents to avoid future disputes.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/supreme-court-security-bonds-by-debtors-are-mortgages.jpg"
  },
  {
    "title": "Understanding the Greenhouse Gases Emission Intensity Target Rules, 2025: A Comprehensive Overview",
    "description": "<p>The Greenhouse Gases Emission Intensity Target Rules, 2025, introduced by the Indian government, aim to curb greenhouse gas emissions across key industrial sectors. Aligned with frameworks like the Carbon Credit Trading Scheme, these rules enforce emission reduction targets by focusing on emission intensity, promoting efficiency improvements without hindering economic growth. The rules provide comprehensive definitions, including terms like \"banked\" carbon credits, \"compliance year,\" and specific measurements for \"greenhouse gases emission intensity targets.\" Definitions also reference related legislation like the Environment Protection Act, 1986 and the Carbon Credit Trading Scheme, 2023, ensuring consistency across environmental policies.</p>\n\n<p>The rules establish specific emission intensity targets for sectors like Aluminium, Cement, Chlor-Alkali, and Pulp and Paper. These targets, outlined in the Schedule, provide a trajectory for emission intensity reductions. For instance, entities in the Aluminium sector face baseline GHG emission intensities with specific reduction targets for subsequent years. This structured approach fosters accountability and progress tracking.</p>\n\n<p>Obligated entities must achieve the emission intensity targets specified in the Schedule. Shortfalls require entities to surrender banked carbon credit certificates or purchase new ones. Registration on the designated portal under the Indian Carbon Market Framework and submission of required documentation are also mandatory. The Bureau of Energy Efficiency manages the issuance of carbon credit certificates, providing an incentive for emission reductions. The number of certificates issued is based on the difference between achieved and target emission intensities, multiplied by production units. Entities can bank these certificates for future use.</p>\n\n<p>Environmental compensation is imposed on obligated entities failing to meet the requirements. The Central Pollution Control Board sets the compensation at twice the average price of carbon credit certificates traded during the relevant compliance year's trading cycle. Payment must be made within 90 days, with additional penalties under the Environment Protection Act, 1986 for non-compliance. Collected funds are used for initiatives aligned with the Carbon Credit Trading Scheme, 2023.</p>\n\n<p>In conclusion, the Greenhouse Gases Emission Intensity Target Rules, 2025, offer a framework for reducing emissions in India, balancing regulatory stringency with practical implementation. Effective enforcement and stakeholder collaboration are critical to achieving national and international environmental goals.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/greenhouse-gases-emission-intensity-target-rules-2025.jpg"
  },
  {
    "title": "Amazon Faces Consumer Commission Ruling Over Incorrect Laptop Delivery",
    "description": "<p>The District Consumer Disputes Redressal Commission (East Delhi) has ruled in favor of a consumer, directing Amazon Retail India Pvt. Ltd. and Appario Retail Pvt. Ltd. to issue a refund for delivering an incorrect and obsolete laptop model. This decision underscores the accountability of e-commerce platforms in ensuring accurate product delivery and transparent refund processes, emphasizing that internal \"Use Policy\" disclaimers cannot supersede consumer protections under the Consumer Protection Act, 2019.</p>\n\n<p>The case originated when Mr. Harjas Singh Sodhi ordered an HP Pavilion laptop from Amazon (sold by Appario Retail) but received an old IBM ThinkPad instead. Despite promptly reporting the issue, initiating a return, and complying with Amazon's procedures, his refund request was rejected under the claim that the returned item was \"lost in transit\" and that his account had exceeded refund limits per Amazon's internal policy.</p>\n\n<p>The Commission found Amazon Retail India Pvt. Ltd. and Appario Retail Pvt. Ltd. jointly and severally liable for deficiency in service. It directed them to refund ₹61,990 for the laptop, pay ₹10,000 in compensation for mental distress and inconvenience, and reimburse ₹5,000 for litigation costs, with an 11% annual interest on the total amount if compliance isn't met within 30 days. This ruling reinforces the responsibility of e-commerce platforms in managing logistics and refund processes and calls for transparent and verifiable systems to uphold consumer trust.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/delhi-consumer-court-orders-amazon-refund-for-wrong-laptop.jpg"
  },
  {
    "title": "Supreme Court Clarifies Singur Land Return: Industrial Units Cannot Claim Relief Reserved for Displaced Farmers",
    "description": "<p>The Supreme Court of India overturned a Calcutta High Court order, clarifying that industrial and commercial entities cannot seek restoration of acquired land under judicial directions intended for dispossessed farmers. The ruling emphasizes that the relief granted in Kedar Nath Yadav v. State of West Bengal, which restored land to cultivators, was a socially remedial measure to protect vulnerable agricultural communities displaced by state acquisition, and should not be extended to industrial undertakings.</p>\n\n<p>The case originated from the Singur Project, where the West Bengal government acquired land for Tata Motors' Nano plant, including land owned by M/s Santi Ceramics Pvt. Ltd. Santi Ceramics accepted compensation for its land but later sought restoration based on the Kedar Nath Yadav ruling, which quashed the acquisition. While the High Court allowed the petition, the Supreme Court reversed this decision, stating that the remedy in Kedar Nath Yadav was specifically for disadvantaged farmers and not for commercial entities.</p>\n\n<p>The Supreme Court dismissed the writ petition filed by Santi Ceramics but granted limited relief regarding its factory structures and machinery. This judgment reinforces that judicial directions aimed at protecting vulnerable sections cannot be expanded to include commercial entities that benefited from the acquisition process. It underscores the distinction between public welfare remedies and private commercial claims, while upholding principles of waiver, estoppel, and finality in acquisition proceedings.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/supreme-court-limits-singur-land-return-to-farmers.jpg"
  },
  {
    "title": "Guidelines Under Section 79(A) Held Directory, Not Mandatory in Redevelopment Cases",
    "description": "<p>The Bombay High Court addressed a writ petition filed by Devendra Kumar Jain, the former Chairman of Ramanuj Co-operative Housing Society Ltd., who opposed the Society's redevelopment project with Cunni Realty and Developer Private Limited. Jain argued that the Society failed to follow due procedure in issuing a Letter of Intent to the developer without a tender process.</p>\n\n<p>The Court ruled that the guidelines issued under Section 79(A) of the Maharashtra Co-operative Societies Act, 1960 are directory, not mandatory. Substantial compliance with these guidelines is sufficient, and minor procedural lapses do not invalidate the redevelopment. The Court noted that the Special General Body Meeting, where the redevelopment proposal was approved, was conducted with an Authorized Officer present and with the consent of the majority of members.</p>\n\n<p>Ultimately, the Court dismissed the writ petition, upholding the Society's decision to proceed with the redevelopment. The Court emphasized that the Society substantially complied with the procedural requirements, and the redevelopment decision was made in a properly convened meeting with majority approval. The Court also stated that the petitioner's allegations involved disputed questions of fact and, therefore, were not suitable for determination under writ jurisdiction.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/section-79a-guidelines-held-directory-in-redevelopment.jpg"
  },
  {
    "title": "Zero-Tolerance 2025: IRDAI’s New Fraud Rule-Book for Every Insurer and Intermediary",
    "description": "<p>Effective April 1, 2026, the Insurance Regulatory and Development Authority of India (IRDAI) will implement the \"Insurance Fraud Monitoring Framework Guidelines, 2025,\" a new set of legally binding instructions designed to combat fraud across the Indian insurance sector. These guidelines aim to establish a zero-tolerance ecosystem, shifting the perception of fraud from an operational risk to a strategic threat requiring proactive involvement from all stakeholders, including insurers, intermediaries, and related entities.</p>\n\n<p>The new framework repeals the 2013 guidelines and applies to all insurers and distribution channels, unless specifically exempted. It tightens definitions of \"insurance fraud\" and introduces concepts like \"red-flag indicators\" and \"cyber or new-age fraud.\" A standardized five-category taxonomy for classifying fraud (internal, distribution-channel, policy-holder/claims, external, and affinity/complex) is established for consistent reporting to the board and IRDAI, enabling industry-wide heat map creation.</p>\n\n<p>At the core of the regime is the Fraud Risk Management Framework, requiring a board-approved, entity-specific set of controls reviewed annually. This framework must include an anti-fraud policy, detailed procedures, defined turnaround times, designated responsible officers, and whistleblower protections. A dedicated Fraud Monitoring Unit is mandated, along with missed-detection reviews. The Fraud Monitoring Committee, composed of key management personnel, will oversee the framework's day-to-day operation, recommending controls, responding to suspicions, maintaining evidence, sharing intelligence, and conducting annual risk assessments.</p>\n\n<p>The guidelines emphasize scientific risk identification, requiring insurers to build libraries of red-flag indicators and incorporate them into workflows. Category-specific controls must address each fraud bucket. A central database of convicted or attempted fraudsters is to be maintained. Cyber fraud receives special attention, necessitating robust cybersecurity architectures and multi-factor customer authentication. The Insurance Information Bureau is designated as the industry's fraud intelligence hub, collecting data from insurers and providing real-time alerts.</p>\n\n<p>Re-insurers, both Indian and foreign, must adhere to the stricter of their home jurisdiction's anti-fraud standards or the IRDAI guidelines. Distribution channels face obligations based on their size, ranging from implementing their own fraud-risk frameworks to complying with insurers' anti-fraud codes. Training and awareness programs are mandatory for employees, management, partners, and the public. Reporting timelines are compressed, requiring prompt notification of law-enforcement and annual statutory returns, with immediate escalation to IRDAI in cases involving registered distribution channels.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/irdai-2025-guidelines-zero-tolerance-insurance-fraud.jpg"
  },
  {
    "title": "Allahabad High Court Sets Aside Order for Juvenile to Be Tried as Adult",
    "description": "<p>On October 10, 2025, the Allahabad High Court overturned decisions by a Juvenile Justice Board (JJB) and a Children’s Court that had mandated a juvenile (aged 16-18) be tried as an adult. The case was sent back to the JJB with specific instructions for conducting a preliminary assessment as required by Section 15 of the Juvenile Justice (Care and Protection of Children) Act, 2015.</p>\n\n<p>The High Court highlighted the ambiguity within Section 15(1) of the JJ Act, 2015, noting its lack of specific guidelines for conducting the preliminary assessment. Drawing upon the Supreme Court’s ruling in Barun Chandra Thakur vs Master Bholu (2022), the High Court stressed that the assessment demands a careful and individualized approach, examining the child’s physical, cognitive, emotional, and social development. The court reinforced the principle that maturity is a developmental process, and juveniles are particularly vulnerable to impulsivity and external factors.</p>\n\n<p>While the statute states that the Board \"may\" seek assistance from psychologists or psychosocial workers, the High Court mandated that such assistance should be compulsory unless the Board includes a qualified child psychologist or psychiatrist. If the Board opts not to utilize expert assistance, it must document the specific reasons for doing so.</p>\n\n<p>The Court identified several inadequacies in the initial assessment, including a lack of proper methodology, superficial questioning, and the absence of a comprehensive evaluation of the juvenile's psychological and social background. Because of these shortcomings, the High Court ruled that the original orders were unlawful and needed to be revoked.</p>\n\n<p>The High Court issued a set of binding guidelines for Juvenile Justice Boards and Children's Courts to follow when conducting preliminary assessments of juveniles accused of serious crimes, pending the development of more detailed rules by the legislature or higher authorities.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/allahabad-hc-juvenile-cant-be-tried-as-adult-without-proper-test.jpg"
  },
  {
    "title": "Reliance Industries Secures Injunction Against “Jiocabs.com” for Trademark Infringement",
    "description": "<p>Reliance Industries Limited, owner of the registered \"JIO\" trademark, filed a commercial intellectual property suit against Asif Ahmed, registrant of the domain www.jiocabs.com, and Usman, proprietor of Doon Taxi Service, alleging trademark and copyright infringement. Reliance asserted that the defendants were operating taxi services under the \"JIO\" name, utilizing deceptively similar logos and artwork, thereby passing off their services as associated with Reliance's well-known brand. The suit sought a permanent injunction, restraining the defendants from infringing the trademark, passing off goods and services, and using the domain name or similar artwork, along with a request to suspend and transfer the domain name.</p>\n\n<p>The court considered evidence including trademark registrations, side-by-side comparisons of the marks, and WhatsApp transcripts demonstrating the defendants' active use of the \"JIO\" name for taxi operations. The court also noted that the defendants altered their business name and website content after receiving a legal notice, which the court interpreted as an implicit acknowledgement of the infringement. Reliance further presented precedents recognizing \"JIO\" as a well-known trademark, reinforcing their claim.</p>\n\n<p>The court granted an ad-interim injunction restraining the defendants from using the domain name www.jiocabs.com, the \"JIO\" mark, or any deceptively similar mark in relation to taxi services, as well as prohibiting the use of similar artwork. The court found that Reliance established trademark infringement and passing off, with the balance of convenience favoring the plaintiff, who would suffer irreparable injury without the injunction. The defendants were granted the opportunity to apply for variation or vacation of the order, and the matter was scheduled for further consideration of interim relief at a later date.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/reliance-wins-injunction-against-jiocabs-com-domain-use.jpg"
  },
  {
    "title": "SEBI's AI/ML Reporting Framework: Evolution and Harmonisation Across Indian Stock Exchanges",
    "description": "<p>The Securities and Exchange Board of India (SEBI) introduced a structured reporting framework in 2019 to oversee the use of Artificial Intelligence (AI) and Machine Learning (ML) technologies in India's securities markets. This framework aims to balance technological innovation with regulatory oversight, ensuring transparency, auditability, and accountability in algorithmic trading and intermediary functions. The initiative is part of SEBI's broader Enhanced Supervision Programme, designed to strengthen technology governance and systemic risk management.</p>\n\n<p>Initially, SEBI directed all recognised exchanges to establish a uniform supervisory framework for tracking AI/ML systems used by intermediaries. The Metropolitan Stock Exchange (MSE) implemented this through half-yearly reporting obligations, requiring members to disclose details of AI/ML systems used for trading, risk management, or investor servicing, even mandating NIL declarations for those not using such systems. In 2023, the reporting framework was broadened to include predictive, analytical, and pattern-recognition algorithms used across various functions, with greater emphasis on auditability and documentation.</p>\n\n<p>In 2025, the National Stock Exchange (NSE) introduced a cross-exchange reporting mechanism, allowing trading members registered with NSE to make a single AI/ML disclosure filing shared with other exchanges. This harmonised model, adopted by MSE, reduces duplication and simplifies compliance for multi-exchange firms. The framework mandates that all algorithmic trading members report the use of AI/ML systems, whether developed in-house or procured from third-party vendors, and maintain comprehensive documentation for supervisory reviews. SEBI's approach emphasizes technological neutrality with regulatory accountability, ensuring that AI/ML tools operate within parameters that protect market integrity and investor trust.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/sebis-2025-ai-ml-framework-harmonising-market-oversight.jpg"
  },
  {
    "title": "Delhi High Court Clarifies: Delhi Government Can Regulate Private School Fees Only to Prevent Profiteering, Not to Control Fee Structure",
    "description": "<p>The Delhi High Court, in a ruling on LPA 213/2024, LPA 316/2024, and LPA 669/2024, affirmed that the Directorate of Education (DoE) of Delhi's power to regulate fees charged by recognized unaided private schools is limited. The Court clarified that this regulation can only be exercised to prevent profiteering, commercialization, or capitation fees, ensuring that collected fees are exclusively used for educational purposes, as mandated by the Delhi School Education Act, 1973 (DSEA) and the Delhi School Education Rules, 1973 (DSER).</p>\n\n<p>The judgment, delivered by a Division Bench, reaffirms the autonomy of private unaided institutions while protecting against exploitation. The case originated from writ petitions by Bluebells School International and Lilawati Vidya Mandir Senior Secondary School, challenging DoE orders restricting fee increases. A Single Judge previously quashed the orders, permitting DoE to act only against profiteering.</p>\n\n<p>The central legal issue was whether the DoE could control the fee structure or if its power was confined to preventing profiteering. The Court analyzed Sections 17, 18, and 24 of the DSEA and Rules 172-177 of the DSER, noting the statutory framework promotes transparency but doesn't empower DoE to dictate fee structures. The Court referenced precedents like T.M.A. Pai Foundation and Modern School v. Union of India, emphasizing the state's duty to prevent exploitation but not to micromanage finances.</p>\n\n<p>The High Court upheld that the DoE may regulate fees only to prevent profiteering, ensuring funds are used for educational purposes. While the court dismissed the appeals and affirmed the Single Judge's judgment, it granted the DoE the liberty to proceed against the schools if statutory violations are found, provided due procedure and natural justice are followed. This decision balances autonomy and accountability, empowering the State to prevent abuse while protecting institutional autonomy.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/delhi-hc-govt-can-regulate-private-school-fees-only-to-prevent-profiteering.jpg"
  },
  {
    "title": "Patna High Court Balances Discipline and Reform in Student Impersonation Case",
    "description": "<p>The Patna High Court, in Bhawesh Kumar Bhaskar v. State of Bihar & Others, delivered a significant judgment addressing the proportionality of punishment for medical students accused of impersonation. The court examined whether permanent expulsion was an appropriate disciplinary action, balancing the need for academic integrity with constitutional principles of fairness and the right to life and dignity.</p>\n\n<p>The case involved five MBBS students accused of impersonation during examinations. The University's Unfair Means Committee recommended their expulsion, which the Vice Chancellor approved. The students argued that permanent expulsion was excessively harsh and violated their fundamental rights, especially considering the discretionary powers available to the Vice Chancellor under the University Statute. They referenced precedents emphasizing proportionality in punishment and advocating for a reformative approach to discipline.</p>\n\n<p>The University defended its decision, citing the severity of impersonation and the need to maintain academic credibility. They argued that the \"Rules for Unfair Means\" were properly implemented and that students were bound by the University's disciplinary jurisdiction.</p>\n\n<p>The High Court held that while it respects academic autonomy, it can intervene in cases of arbitrary or disproportionate punishment. Justice Sinha found that the Vice Chancellor had mechanically accepted the Committee's recommendation without independent reasoning. The Court emphasized that permanent expulsion was excessively harsh for first-time offenders, preventing any chance of reform. Consequently, the court modified the punishments, emphasizing that this leniency should not be mistaken for condoning the misconduct. The decision serves as a precedent for balancing discipline and empathy in educational institutions to shape responsible citizens.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/patna-hc-upholds-reform-over-punishment-in-exam-cases.jpg"
  },
  {
    "title": "Kerala's Right to Disconnect Bill, 2025: A Step Towards Work-Life Balance",
    "description": "<p>The Kerala Right to Disconnect Bill, 2025, introduced by Dr. N. Jayaraj, aims to address the blurring lines between work and personal life due to hyper-connectivity. This private member's bill seeks to legally recognize an employee's right to disconnect from work-related communications after hours, mirroring similar initiatives in European countries.</p>\n\n<p>The bill arises from increasing employee burnout and the \"always-on\" work culture, exacerbated by the COVID-19 pandemic. It aims to provide statutory protections, ensuring employees can disengage without fear of retaliation. Key provisions include defining the \"Right to Disconnect,\" prohibiting punitive actions against employees who exercise this right, establishing grievance redressal committees, and enabling the Labour Commissioner to enforce compliance.</p>\n\n<p>The bill aligns with the Indian Constitution, particularly Article 21, which guarantees the right to life with dignity, and Articles 38, 39, and 43, which mandate humane working conditions. It addresses the statutory gap in existing labor laws concerning digital extension of labor beyond physical working hours. While facing challenges in enforceability and requiring consideration for sectoral flexibility, the bill catalyzes crucial discussions on redefining workplace rights in the digital age.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/kerala-introduces-right-to-disconnect-bill-for-employees.jpg"
  },
  {
    "title": "Food Safety or Competition Issue? CCI Draws the Line in Maggi Sauce Case",
    "description": "<p>The Competition Commission of India (CCI) dismissed a complaint against Nestle India Limited concerning alleged use of contaminated water in the production of Maggi Sauce at its Goa factory. The complaint, filed by Sarvesh M. Kolumbkar, accused Nestle of violating the Food Safety and Standards Act, 2006, and abusing its dominant position under Section 4 of the Competition Act. The informant sought an investigation into a purported \"Maggi Sauce scam\" and requested interim relief.</p>\n\n<p>The CCI found no prima facie contravention of the Competition Act, clarifying that the allegations centered on food safety, hygiene, and product labelling, issues under the jurisdiction of the Food Safety and Standards Authority of India (FSSAI). The Commission emphasized that the alleged use of dirty water and mislabelling did not constitute anti-competitive practices or demonstrate that Nestle exploited its market position to restrict competitors or harm consumers.</p>\n\n<p>The decision reinforces that unethical business practices do not automatically equate to abuse of dominance unless they directly impact market competition. The CCI underscored its role in ensuring market fairness and efficiency, distinct from addressing general consumer grievances or regulatory non-compliance related to food safety. The order clarifies the boundary between competition law and sectoral regulation, directing concerns regarding public health, product contamination, or deceptive labelling to appropriate authorities like the FSSAI.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/cci-clarifies-limits-in-maggi-sauce-dirty-water-case.jpg"
  },
  {
    "title": "Fake Licence Not Enough to Deny Insurance: Supreme Court",
    "description": "<p>The Supreme Court of India, in Hind Samachar Ltd. (Delhi Unit) v. National Insurance Company Ltd. & Ors., has clarified that a vehicle owner cannot be held liable solely based on the subsequent discovery of a fake driver's license. The court emphasized that an insurer must demonstrate a deliberate violation of policy conditions or substantial evidence of collusion to deny indemnification. This decision bolsters the legal framework surrounding \"pay and recover\" cases under the Motor Vehicles Act, reinforcing the principle that an insured owner's good faith is presumed unless proven otherwise.</p>\n\n<p>The case stemmed from a fatal road accident involving a truck owned by Hind Samachar Ltd. and a Matador van. The Motor Accident Claims Tribunal (MACT) initially ruled both vehicles negligent and directed the truck's insurer to indemnify the owner, despite allegations of a fake driver's license. The Delhi High Court reversed this, finding collusion and granting the insurer the right to recover compensation from the owner.</p>\n\n<p>The Supreme Court overturned the High Court's decision, emphasizing that the insurer failed to provide sufficient evidence of collusion or negligence on the owner's part. The court reiterated that the insurer bears the burden of proving the insured knowingly entrusted the vehicle to an unqualified driver or willfully breached policy conditions. The court found that the owner acted with reasonable diligence by verifying the driver's license and producing renewal records from the licensing authority.</p>\n\n<p>The Supreme Court concluded that without proof of willful breach or collusion, the High Court's direction allowing the insurer to recover compensation from the vehicle owner was legally unsound. The ruling reaffirms that vehicle owners are not expected to conduct exhaustive license verification unless there are specific reasons for suspicion. The decision reinforces the welfare intent of the Motor Vehicles Act to ensure victim compensation without unjustly burdening owners acting in good faith.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/fake-licence-no-ground-to-deny-insurance-supreme-court.jpg"
  },
  {
    "title": "Minors’ Rights Protected – Court Rules Suit Not Mandatory to Undo Guardian’s Unauthorized Sale",
    "description": "<p>The Supreme Court of India, in K.S. Shivappa v. Smt. K. Neelamma, clarified that a minor's repudiation of an unauthorized property sale by their guardian, without prior court permission under Section 8(2) of the Hindu Minority and Guardianship Act, 1956, does not necessarily require a formal lawsuit. Such a sale is voidable, not void, and repudiation can be effectively demonstrated through clear and unequivocal conduct, such as the subsequent sale of the property after attaining majority.</p>\n\n<p>The case involved a dispute over land originally purchased in the names of three minor sons and later sold by their father/guardian without the required court permission. After attaining majority, the sons sold the land to a different party, thus repudiating the original sale. The Supreme Court examined the legal implications of Section 8(2) and 8(3) of the Hindu Minority and Guardianship Act, 1956 and ultimately ruled in favor of the sons' right to repudiate the sale through their conduct, emphasizing that the Act does not explicitly mandate a civil suit for setting aside such transactions.</p>\n\n<p>The Court underscored that once a voidable transaction is avoided by the minor, it becomes void ab initio. The Supreme Court's decision highlights the importance of protecting minors' property rights while promoting fairness and clarity in property law and strengthens both substantive justice and transactional integrity.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/supreme-court-protects-minors-rights-in-property-sales.jpg"
  },
  {
    "title": "Husband Cannot Use Child as a Pawn to Prove Wife’s Adultery – DNA Test Plea Dismissed",
    "description": "<p>The Madurai Bench of the Madras High Court dismissed a husband's petition seeking a DNA test on his child to prove his estranged wife's alleged adultery. The court emphasized the importance of protecting the child's rights, privacy, and dignity, reinforcing constitutional safeguards under Articles 20(3) and 21. The ruling highlights that DNA testing should not be used intrusively in litigation without strong justification.</p>\n\n<p>The case arose from a maintenance petition filed by the wife after a divorce. The husband sought a DNA test, claiming his ex-wife had previously admitted the child was not his. The court ruled against this, citing the lack of a prima facie case, an inordinate delay since the divorce, and the potential harm to the child. The court referenced Section 116 of the Bharatiya Sakshya Adhiniyam, 2023, which presumes a child's legitimacy unless non-access is proven, a legal safeguard.</p>\n\n<p>Justice Shamim Ahmed underscored that forensic methods should not infringe upon fundamental rights or be misused. The court stated that ordering a DNA test in this situation would violate the child's right to privacy and potentially cause lifelong stigma. The court concluded that the husband’s plea lacked merit and appeared to be an attempt to humiliate the wife and prolong the litigation. The judgment reaffirms the judiciary's commitment to the best interests of the child, privacy, and human dignity, preventing the weaponization of technology for emotional harm in family disputes.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/husband-denied-dna-test-to-prove-wifes-alleged-adultery.jpg"
  },
  {
    "title": "Supreme Court Clarifies Limitation and Validity of Arbitration Clauses Post-Amendment",
    "description": "<p>In Offshore Infrastructures Ltd. v. Bharat Petroleum Corporation Ltd., the Supreme Court of India addressed the validity of arbitration clauses impacted by statutory amendments and the computation of limitation for applications seeking arbitrator appointments under Section 11(6) of the Arbitration and Conciliation Act, 1996. The ruling underscores the pro-arbitration stance of Indian courts and provides clarity on interpreting arbitration clauses in light of the 2015 Amendment.</p>\n\n<p>The dispute stemmed from a contract between Offshore Infrastructures and Bharat Petroleum, where Offshore Infrastructures sought arbitration due to outstanding dues. The original arbitration clause designated the Managing Director of Bharat Petroleum as the sole arbitrator, a provision rendered inconsistent with the 2015 Amendment to the Arbitration Act, which aims to ensure arbitrator neutrality. The High Court dismissed Offshore Infrastructures' application for arbitrator appointment as time-barred, calculating the limitation period from the date of the No Claim Certificate.</p>\n\n<p>The Supreme Court overturned the High Court's decision, holding that the ineligibility of a named arbitrator does not invalidate the entire arbitration clause. It affirmed that the parties' intent to arbitrate remains valid and that courts retain the power under Section 11(6) to appoint an independent arbitrator. The Court further clarified the limitation period, considering the Supreme Court’s COVID-19-related extension orders. It ruled that the application was within the prescribed limitation period when accounting for the exclusion of time between March 15, 2020, and February 28, 2022.</p>\n\n<p>The Supreme Court directed the matter to the Delhi International Arbitration Centre (DIAC) for the appointment of an independent arbitrator. This decision reinforces the principles of party autonomy, fairness, and the legislative intent behind the 2015 amendment, ensuring that technicalities do not undermine the fundamental goal of alternative dispute resolution.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/supreme-court-upholds-arbitration-clause-clarifies-limitation.jpg"
  },
  {
    "title": "Judicial Clarity on Environmental Impact Assessments: The Vanshakti Judgment",
    "description": "<p>The Supreme Court, in Vanshakti v. Union of India, upheld the Ministry of Environment, Forest and Climate Change’s (MoEF&CC) 2025 notification clarifying the application of general conditions to building and township projects under the 2006 Environmental Impact Assessment (EIA) Notification. The Court found that the 2006 notification never applied these conditions to projects under Entries 8(a) and 8(b), thus the 2025 clarification did not dilute environmental safeguards.</p>\n\n<p>However, the Court struck down Note 1 in Entry 8(a), which exempted industrial sheds, schools, colleges, and hostels from EIA requirements. The Court deemed this exemption arbitrary and contrary to the Environment (Protection) Act, 1986, arguing that large-scale construction, regardless of its purpose, has an environmental impact and cannot be shielded from assessment.</p>\n\n<p>The ruling reinforces the doctrine of sustainable development and provides interpretive clarity on the EIA regime. By upholding the 2025 notification (excluding Note 1), the Court balances effective environmental regulation with legitimate development, recognizing the role of State Environment Impact Assessment Authorities (SEIAAs) while preventing arbitrary exemptions. The judgment is likely to serve as a key precedent for future disputes regarding delegated environmental legislation and the limits of administrative clarification.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/supreme-court-clarifies-eia-rules-in-vanshakti-case.jpg"
  },
  {
    "title": "Artificial Intelligence and Competition Law: CCI’s Analysis of the Market Study on AI and Competition Report",
    "description": "<p>The Competition Commission of India (CCI) acknowledges the transformative influence of Artificial Intelligence (AI) on modern markets, highlighting its impact on pricing, consumer targeting, and digital ecosystems. The CCI's market study recognizes AI's potential to promote efficiency and innovation, but also its capacity to distort markets through opaque and exclusionary practices. The report serves as a foundation for aligning competition law, consumer protection, and data regulation in India's AI economy.</p>\n\n<p>The study identifies AI's growing influence in sectors like banking, e-commerce, and healthcare, leading to cost efficiency and predictive analytics. However, it also notes an imbalance, with a few large players dominating critical layers of the AI infrastructure, creating entry barriers for smaller competitors. This market concentration allows dominant firms to engage in \"ecosystem lock-in,\" challenging the goal of fair competition.</p>\n\n<p>The CCI recognizes that AI's self-learning abilities test traditional enforcement tools. AI can enable tacit collusion without explicit agreements, while dynamic pricing risks consumer harm through personalized pricing. Data-driven network effects also favor incumbents, raising barriers for smaller businesses. The study cautions that mergers and acquisitions in the AI industry require closer scrutiny by competition authorities.</p>\n\n<p>The CCI proposes a shift towards proactive ecosystem monitoring, encouraging AI deploying enterprises to conduct competition compliance audits. The report recommends disclosing key aspects of AI functioning to foster trust and contestability. It also plans to establish a Digital Markets and AI Think Tank and calls for inter-regulatory coordination to harmonize AI, data privacy, and consumer protection regulations. The CCI sets ethical boundaries for algorithmic conduct and emphasizes that AI must serve as a tool for competition, not a substitute. The CCI's report mirrors global trends and adapts them to the Indian digital ecosystem, balancing innovation incentives with legal oversight. It marks a turning point in India's regulatory evolution, emphasizing responsible innovation, algorithmic transparency, and regulatory coordination to ensure fair and competitive AI markets.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/cci-report-examines-ais-impact-on-competition-law.jpg"
  },
  {
    "title": "CCI Dismisses Allegations Against BSNL: Tender Disqualification Not Anti-Competitive",
    "description": "<p>The Competition Commission of India (CCI) addressed a case filed by M/s C.C.L. Optoelectronics Private Ltd. against Bharat Sanchar Nigam Ltd. (BSNL), alleging abuse of dominant position under Section 4 of the Competition Act, 2002. The informant contested BSNL's disqualification of its bid for a tender concerning Splice Closures for Optical Fiber Cables, arguing that the tender conditions were discriminatory and favored certain bidders.</p>\n\n<p>The CCI, upon examination, defined the relevant market as Telecommunication Services in India. It found that BSNL's market share (approximately 2.09%) was significantly smaller than those of its major competitors, such as Reliance Jio, Bharti Airtel and Vodafone Idea. The commission concluded that BSNL did not hold a dominant position. It also noted that the disqualification was based on past performance criteria, not turnover.</p>\n\n<p>Ultimately, the CCI determined that no prima facie case of contravention of Section 4 of the Act was established against BSNL. The Commission closed the matter under Section 26(2) of the Competition Act, 2002, dismissing the application for interim relief and concluding that BSNL's actions did not constitute abuse of dominance or restrictive trade practices.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/cci-clears-bsnl-tender-rejection-not-anti-competitive.jpg"
  },
  {
    "title": "Arbitral Award Must Be Within the Parameters of the Agreement Between the Parties",
    "description": "<p>Arbitration is rooted in party autonomy, where consent forms the basis of the tribunal's jurisdiction, scope, and authority. An arbitral award must adhere to the contract's parameters; deviations, either by disregarding terms or granting inconsistent relief, undermine the agreement's sanctity and the tribunal's jurisdiction, making the award vulnerable under the Arbitration and Conciliation Act, 1996.</p>\n\n<p>The Indian arbitration framework, particularly Section 28(3) of the Act, emphasizes contractual sanctity, mandating tribunals to decide per the contract's terms. Arbitrators interpret, but do not rewrite, contracts based on equity or fairness. The Supreme Court of India has consistently reinforced that tribunals are creations of the contract, unable to exceed their mandate. Awards violating express terms are deemed patently illegal and against public policy.</p>\n\n<p>Evidentiary discipline and procedural adherence are crucial, especially concerning contractual preconditions like notices or written approvals. Tribunals cannot waive these stipulations unless permitted by the contract. The Supreme Court has reinforced that commercial fairness cannot override contractual discipline, as seen in SEPCO Electric Power Construction Corporation vs. GMR Kamalanga Energy Ltd., where the court set aside a tribunal's decision for wrongly invoking equitable estoppel to overlook mandatory contractual notices.</p>\n\n<p>Judicial review under Sections 34 and 37 serves as a safeguard against arbitral excess, intervening when awards exhibit patent illegality or violate public policy, ensuring arbitration remains true to party consent. Contracting parties must draft precisely and adhere to performance requirements. Courts assess whether awards respect the agreement's boundaries, exercising restraint when faithful interpretations exist and correcting departures.</p>\n\n<p>Arbitration's strength lies in predictability and respect for autonomy. Tribunals upholding the agreement's integrity reinforce commercial certainty. Conversely, exceeding mandates undermines the process. Awards must be rooted in the contract, ensuring arbitration remains an extension of party autonomy governed by the rule of contract.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/arbitral-awards-must-adhere-to-contract-terms.jpg"
  },
  {
    "title": "CCI's Google Play Ruling: Key Insights On Competition Law And Digital Platforms",
    "description": "<p>The Competition Commission of India (CCI) dismissed allegations against Google related to the termination of Liberty Infospace Pvt. Ltd.'s developer account on the Google Play Store. The CCI, acting under Section 26(2) of the Competition Act, 2002, found no prima facie case of contravention. The case arose after Google terminated Liberty Infospace's account, citing violations of Developer Program Policies and association with previously banned accounts. Liberty Infospace alleged abuse of dominant position by Google, claiming unilateral termination and lack of due process.</p>\n\n<p>Liberty Infospace sought investigation, penalties, and structural changes to ensure transparent enforcement of Play Store policies. Google argued that the issue was an individual grievance related to policy enforcement, relying on prior CCI decisions that upheld the legitimacy of Play Store enforcement mechanisms. Google asserted that the enforcement was proportionate and consistent with global standards.</p>\n\n<p>The CCI framed issues to determine if Google abused its dominant position by terminating the account, if the termination had an appreciable adverse effect on competition (AAEC), and if interim relief should be granted. Ultimately, the CCI's order reinforces that competition law intervenes in digital platforms only when market-wide harm, exclusionary conduct, or unfair leveraging is evident. The Commission deemed Google's policy enforcement as reasonable, proportionate, and consistent with global standards, emphasizing that compliance with platform policies is necessary.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/cci-clears-google-in-play-store-dominance-case.jpg"
  },
  {
    "title": "Limits on Title Transfer: Supreme Court Clarifies Legal Effect of Agreement to Sell, General Power of Attorney, and Will",
    "description": "<p>In Ramesh Chand v. Suresh Chand, the Supreme Court addressed whether an agreement to sell, a general power of attorney (GPA), or a registered will can independently transfer title to immovable property. The Court reinforced that these instruments, particularly a will under suspicious circumstances, cannot establish title without strict legal proof. This decision solidifies existing jurisprudence against informal property transfers.</p>\n\n<p>The dispute arose between brothers over inherited property. One brother claimed ownership based on an agreement to sell, GPA, affidavit, and registered will, while the other contested the documents' validity. The Supreme Court, referencing prior rulings like Suraj Lamp, reiterated that under Section 54 of the Transfer of Property Act, an agreement to sell only grants a right to enforce specific performance, not ownership. A GPA is an agency instrument, not a conveyance, and requires explicit transfer language to pass title.</p>\n\n<p>The Court emphasized that a registered will is not self-proving and requires rigorous proof under the Indian Succession Act and Evidence Act. This includes attestation by two witnesses, with at least one testifying. In this case, the will, favoring one son without explanation and lacking examined attesting witnesses, was deemed unproven. The Supreme Court affirmed that while this ruling introduces no new doctrine, it underscores the need for proper conveyancing and heightened legal awareness in familial property matters where informal documents are often used to effect property transfers.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/supreme-court-clarifies-limits-on-property-title-transfer.jpg"
  },
  {
    "title": "Devolution of Self-Acquired Property under Pre-1956 Mitakshara Law: Exclusive Succession of Male Issue Affirmed",
    "description": "<p>The High Court of Kerala addressed the devolution of a Hindu male's self-acquired property under the Mitakshara School of Hindu Law before the Hindu Succession Act, 1956. The ruling affirms the principle that male issue exclusively succeeded to the separate property of the father if the death occurred prior to the Act's commencement, prioritizing the male line in succession and excluding daughters when a son was present.</p>\n\n<p>The case originated from a dismissed partition suit where the appellants, legal heirs of Rama Pai's daughter, contested a 1965 sale of Rama Pai's self-acquired property by his son, Hari Pai. The appellants argued that the property should have devolved jointly upon Hari Pai and Rama Pai's daughter. The respondents countered that Rama Pai died before 1956, making his son the sole heir. The court upheld the trial court’s finding that Rama Pai had died before 17.06.1956 based on the unchallenged oral testimony of a witness stating the death occurred in 1950.</p>\n\n<p>The court rejected the appellant's reliance on the Hindu Law of Inheritance (Amendment) Act, 1929, noting that it only introduced a limited set of female heirs and did not confer on a daughter the same status as a son when a son was present. Under the Mitakshara law applicable before 1956, the self-acquired property of a male devolved exclusively upon his male issue. This principle was supported by authoritative precedents.</p>\n\n<p>The Court concluded that since Rama Pai died before 1956, his self-acquired property devolved entirely upon his son, Hari Pai, who validly conveyed his rights to the defendants. Consequently, the court dismissed the appeal, upholding the judgment that the property was not partible. The decision restates the legal position concerning inheritance rights under the Mitakshara law before the Hindu Succession Act, 1956.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/kerala-hc-on-pre-1956-mitakshara-law-sons-sole-rights.jpg"
  },
  {
    "title": "Bombay High Court Upholds Mother’s Right To Custody After Father’s Death",
    "description": "<p>The Bombay High Court, Aurangabad Bench, in Parvati Swati v. Vyankat & Anr., reaffirmed a mother's right to custody following the father's death, emphasizing the paramount importance of the child's welfare under the Hindu Minority and Guardianship Act, 1956. The ruling underscores that while grandparents can provide love, the mother, as the natural guardian, holds the inherent right and responsibility unless proven unfit.</p>\n\n<p>The case arose after the father's death, where the paternal grandparents sought guardianship of the minor child, whose custody had been granted to the father in a prior divorce decree. The mother filed a counter-application seeking custody, which was initially rejected. The High Court addressed whether the grandparents could claim custody in preference to the mother, citing Section 6(a) of the Act, which favors the mother as the natural guardian after the father's death, especially for children below five.</p>\n\n<p>The Court considered arguments from both sides, including the mother's improved financial stability and the child's established relationship with the grandparents. Justice Chapalgaonkar, reiterating the child's welfare as paramount, ruled in favor of the mother, citing precedents that a natural parent's custody should only be denied if they are demonstrably unfit. The Court granted custody to the mother while providing visitation rights to the grandparents, balancing the child's legal right to maternal care with the importance of maintaining family bonds. This judgment reaffirms the principle that a mother's care is irreplaceable while emphasizing the need for compassion and justice in guardianship law.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/bombay-hc-upholds-mothers-right-to-child-custody.jpg"
  },
  {
    "title": "RBI's Draft Directions on Lending to Related Parties: A Summary",
    "description": "<p>The Reserve Bank of India (RBI) has released the Draft Reserve Bank of India (Lending to Related Parties) Directions, 2025, seeking public input by October 31, 2025. This draft aims to establish a unified, principle-based framework for transactions between regulated entities (REs) and their related parties, an area of long-standing concern regarding governance and prudential oversight.</p>\n\n<p>Currently, regulations on lending to related parties are fragmented across various regulatory frameworks, leading to potential arbitrage and ambiguity. The new draft directions intend to harmonize governance standards, enhance transparency in related-party exposures, and strengthen market discipline across all REs, including banks, NBFCs, and cooperative banks.</p>\n\n<p>Key provisions include a broad definition of \"related parties\" aligned with Indian Accounting Standards (Ind AS 24), materiality-based thresholds for Board or committee approval of transactions, and a principle-based exemption to Section 20(1)(b) of the Banking Regulation Act, 1949. The draft also mandates comprehensive reporting and disclosure obligations to align with international best practices.</p>\n\n<p>The proposed framework emphasizes ethical governance and conflict of interest management, requiring financial institutions to embed robust governance and risk management practices. Non-compliance may lead to regulatory action and reputational consequences. This initiative, part of broader reforms promoting uniformity and sound corporate governance, follows the Final Co-Lending Framework. The RBI invites stakeholder feedback before finalizing the directions, which will supersede existing circulars.</p>\n\n<p>Ultimately, the Draft Lending to Related Parties Directions, 2025, represent a crucial step toward promoting integrity, transparency, and uniform governance in India's financial system, balancing operational flexibility with prudential discipline to enhance resilience and credibility.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/rbis-draft-lending-rules-redefine-governance-standards.jpg"
  },
  {
    "title": "Allahabad High Court Clarifies Bank Liability in Cases of Alleged Unauthorized Electronic Transactions",
    "description": "<p>The Allahabad High Court, in Suresh Chandra Singh Negi and Another v. Bank of Baroda and Others, addressed the liability of banks in cases of alleged unauthorized electronic transactions, specifically when the customer's credentials and devices were used. The court examined the Reserve Bank of India’s 2017 Circular on customer protection and clarified the extent of customer and bank liability in digital banking operations.</p>\n\n<p>The case involved petitioners claiming unauthorized transfers from their accounts despite using internet banking facilities. They argued cyber fraud, citing a blocked SIM card preventing OTP receipt, and relied on the RBI circular mandating banks to restore debited amounts if notified within three days. The Bank of Baroda, however, presented evidence showing the transactions were initiated by the petitioners themselves using their login credentials, registered devices, and OTPs, with a password change following the transfers.</p>\n\n<p>The Allahabad High Court found that the evidence indicated the transactions were carried out by the petitioners, noting the use of their login, OTPs, and the addition of beneficiaries. The court also highlighted the delay in reporting the issue as inconsistent with genuine cyber fraud victims. Analysis of the RBI circular revealed that while the bank bears the burden of proof, the Bank of Baroda successfully demonstrated customer liability. The court also distinguished precedents cited by the petitioners, noting that those cases involved third-party fraud and prompt reporting, unlike the present case.</p>\n\n<p>Ultimately, the court ruled there was no unauthorized withdrawal and dismissed the petition, emphasizing that the RBI circular protects genuine cyber fraud victims, not those attempting to escape consequences of their own negligence. The decision reinforces that digital vigilance is a shared responsibility, and liability cannot be shifted to the bank when transactions are executed using the customer’s own credentials.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/allahabad-hc-clarifies-bank-liability-in-online-frauds.jpg"
  }
]