[
  {
    "title": "From Choice To Compliance: Regulating Live-In Relationships In India’s Emerging Legal Order",
    "description": "<p>Indian constitutional law previously treated live-in relationships as private matters, intervening only for protection, not permission, upholding adult autonomy under Article 21. Landmark judgments like Lata Singh and S Khushboo emphasized non-interference, refusing to criminalize cohabitation and warning against using criminal law for social morality. Legal protections, such as those \"in the nature of marriage,\" were welfare-driven, triggered by vulnerability, and did not mandate registration. This approach reflected a deliberate constitutional design focused on liberty through non-intervention.</p>\n\n<p>However, this judicial settlement is unravelling, marking a decisive shift towards state regulation. Uttarakhand’s Uniform Civil Code (2025) transforms live-in relationships into registrable legal events, requiring couples to notify the State, disclose personal details, and formally record termination, with criminal penalties for non-compliance. Justified as protection, this regime preemptively presumes risk, acting as a licensing mechanism for intimacy. This contravenes the Puttaswamy judgment's emphasis on decisional autonomy and proportionality; a right conditioned on disclosure becomes permission, not an inherent liberty.</p>\n\n<p>Further, Section 69 of the Bharatiya Nyaya Sanhita 2023 criminalizes sexual relations obtained by \"deceitful means,\" specifically including unfulfilled promises of marriage. This provision risks conflating emotional uncertainty with dishonest intent at a relationship's inception, a distinction Indian courts previously maintained. It invites retrospective reconstruction of intent, potentially converting private relational history and relationship breakdowns into penal liability, a task for which criminal law is ill-suited due to its demand for certainty.</p>\n\n<p>Ironically, existing welfare mechanisms like maintenance and domestic violence remedies continue to operate without requiring registration or criminal complaints, creating a \"constitutional schizophrenia\" where the State simultaneously trusts and distrusts adults. This emerging framework, though framed as protective, revives moral governance through bureaucratic and criminal means. It replaces autonomy with audit, recasts relational uncertainty as criminal deceit, and risks transforming personal failure into penal liability. This shift raises fundamental questions about privacy, proportionality, and the constitutional limits of state power, signaling that constitutional liberty might be quietly rewritten if intimacy requires declaration for protection and choice must be justified to avoid punishment.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/live-in-relationships-in-india.jpg"
  },
  {
    "title": "The Inalienability Of Ownership: A Jurisprudential Analysis Of Tenancy And Title Preservation In India",
    "description": "<p>Indian property law definitively establishes that long-term possession, such as tenancy, does not automatically confer ownership rights. This fundamental principle is upheld by the Transfer of Property Act (TPA) 1882, the Indian Evidence Act 1872, and consistent Supreme Court rulings. Ownership, defined as an exhaustive \"bundle of rights\" including disposal, is distinct from a lease, which merely grants a limited \"right to enjoy\" the property. Even a perpetual lease does not transfer absolute title, and tenants are legally obligated to return the property to the landlord.</p>\n\n<p>A crucial legal barrier to tenants claiming ownership is the doctrine of estoppel, codified in Section 116 of the Indian Evidence Act. This prevents tenants from denying their landlord's title during the tenancy. The maxim \"Once a tenant, always a tenant\" signifies that a tenant's status remains unchanged by the passage of time or non-payment of rent, unless legally altered by a new contract.</p>\n\n<p>Furthermore, the doctrine of adverse possession, which requires \"hostile, open, and continuous\" occupation for 12 years, does not apply to tenants, as their possession is \"permissive,\" not hostile. Recent Supreme Court judgments, including Jyoti Sharma v. Vishnu Goyal (2025), have unequivocally reaffirmed that decades of occupation do not convert tenancy into ownership, upholding the \"cardinal estoppel.\"</p>\n\n<p>While state Rent Control Acts provide statutory protections to tenants, these confer personal rights to occupy, not proprietary interests. The Model Tenancy Act, 2021, aims to formalize rental agreements and expedite landlord repossession. Indian jurisprudence consistently safeguards absolute ownership, ensuring that the contractual nature of tenancy remains a steadfast barrier to acquiring title through mere duration of stay.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/adverse-possession-title.jpg"
  },
  {
    "title": "Remand And The Duty Of Fresh Decision: Supreme Court Clarification",
    "description": "<p>In RattanIndia Power Limited vs MSEDCL (2025), the Supreme Court clarified crucial aspects concerning remand proceedings, appellate finality, and the computation of carrying costs, particularly regarding compounding interest. RattanIndia sought compensation for 'Change in Law' events under a Power Purchase Agreement (PPA), with the dispute centering on the application of Late Payment Surcharge (LPS) rates and whether compounding interest should apply.</p>\n\n<p>The Court held that a remand for fresh consideration does not freeze the legal position; adjudicatory bodies must apply prevailing law, as the \"lis\" remains active during the remand period. It deemed MSEDCL's failure to cross-appeal APTEL's grant of carrying costs at LPS rates as making that aspect final and unchallengeable.</p>\n\n<p>Regarding compounding interest, the SC clarified that while LPS rates applied, compounding is not automatic. It requires a specific factual assessment, such as whether the affected party incurred financing costs with monthly rests. The Court found APTEL erred by denying compounding on the erroneous assumption that the previous remand order precluded such consideration, rather than on factual merit.</p>\n\n<p>Consequently, the SC partly allowed the appeal, remanding the matter to APTEL for a fresh factual determination on compounding interest. This judgment reinforces that remand proceedings are not static, requiring adjudicatory bodies to consider evolving legal principles. It also underscores the finality of unchallenged appellate findings and adopts a nuanced approach to restitution, requiring a factual basis for compounding interest, rather than automatic application.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/remand-orders-duty-of-fresh-decision.jpg"
  },
  {
    "title": "The Delhi High Court Judgement On Domain Name Fraud: An Analysis Of Dabur India Limited V. Ashok Kumar",
    "description": "<p>The Delhi High Court, in Dabur India Limited v. Ashok Kumar, delivered a significant ruling against pervasive online domain name fraud and digital impersonation. The case exposed how weak identity verification mechanisms allow fraudsters to register domain names closely resembling well-known brands, like Dabur, and create cloned websites. These fraudulent sites deceive the public into paying \"registration fees\" for fake distributorships, franchises, or job opportunities, only to vanish and resurface with new, slightly altered domains, making traditional legal remedies ineffective.</p>\n\n<p>The court observed the widespread, organised nature of this fraud, affecting numerous companies beyond Dabur, with over 1,100 infringing domains identified where registrant details were often false or masked. Justice Pratibha M Singh acknowledged that domain names are critical commercial indicators and that such systematic deception, operating at scale and speed, necessitates structural solutions beyond isolated injunctions.</p>\n\n<p>To address these vulnerabilities, the Court mandated e-KYC verification for domain name registrants to introduce accountability and traceability. It also directed measures to tackle banking system weaknesses exploited by fraudsters. Crucially, the ruling granted Dabur a dynamic plus injunction, allowing the company to tackle future deceptive domain variants without instituting fresh lawsuits. This judgment marks a pivotal shift from reactive adjudication to preventive regulation, strengthening enforcement for rights holders and offering greater protection to consumers by addressing the fraud at its source: the domain registration process.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/domain-name-fraud-and-e-kyc-mandate.jpg"
  },
  {
    "title": "Unauthorized Promotion And Promoter Liability Under RERA: “Coming Soon” Is Still Advertising",
    "description": "<p>The Real Estate Regulatory Authority (RERA), Bihar, imposed a penalty on M/s Alphabet Infra Pvt. Ltd. for advertising its \"One World, Brahmapura Railway Colony\" project prior to obtaining statutory registration, a direct contravention of Section 3(1) of the Real Estate (Regulation and Development) Act, 2016. RERA initiated proceedings after promotional materials for the unregistered project appeared.</p>\n\n<p>The Authority affirmed that the Act’s comprehensive definition of \"advertisement\" (Section 2(b)) includes all promotional efforts, such as \"Coming Soon\" displays, intended to solicit interest. It dismissed the respondent's defense that \"Alphapet Infra\" was merely a brand label, not the promoter, and that the signs were for identification. RERA clarified that liability under Section 3 applies to any entity involved in promoting an unregistered project, regardless of such distinctions.</p>\n\n<p>RERA underscored that project registration is a mandatory, threshold obligation to ensure transparency and consumer protection, which cannot be negated by claims of preliminary registration steps or subsequent remorse. Consequently, a penalty of ₹1,00,000 was levied under Section 59(1). This ruling solidifies RERA's \"bright-line rule\" that no advertising or promotional activity is permissible before a project is duly registered, emphasizing the critical need for strict compliance from all real estate developers and their affiliates.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/rera-penalise-pre-registration-promo.jpg"
  },
  {
    "title": "IP Insights: How The DLI Scheme Is Shaping India’s Semiconductor IP Ecosystem",
    "description": "<p>The Design Linked Incentive (DLI) Scheme, a key initiative under India's Semicon India Programme by MeitY, strategically aims to bolster the domestic semiconductor ecosystem by fostering the creation, ownership, and commercialization of indigenous Intellectual Property (IP). Recognizing semiconductor design as the most IP-intensive segment of the chip value chain, the DLI Scheme ensures that valuable IP generated with public support remains anchored within India, reducing reliance on foreign technologies and advancing technological sovereignty.</p>\n\n<p>The scheme provides financial incentives, covering up to 50% of eligible design expenditure and 30% for product deployment, alongside crucial access to Electronic Design Automation (EDA) tools and prototyping infrastructure. It is open to Indian startups, MSMEs, domestic companies, and research institutions. While beneficiaries retain IP ownership, the scheme mandates IP generation and patent filings within India, balancing private rights with national accountability.</p>\n\n<p>Since its launch in 2021, the DLI Scheme has shown significant progress. It has supported over 50 beneficiaries, leading to the development of 28 IPs/SoCs, over 100 patent filings, and more than 10 silicon tape-outs. Success stories include Vervesemi Microelectronics with its motor-control chips and 10 patents, InCore Semiconductors developing indigenous RISC-V processor IPs, Netrasemi's indigenously designed 12nm AI SoC, Aheesa Digital Innovations' fiber-broadband solutions, and AAGYAVISION's radar-on-chip solutions. These achievements demonstrate the scheme's effectiveness in translating indigenous design capabilities into market-ready semiconductor products.</p>\n\n<p>In conclusion, the DLI Scheme represents a strategic shift towards IP-led semiconductor growth. By lowering entry barriers and mitigating financial risks for innovators, it significantly contributes to India’s objectives of technological self-reliance and enhanced competitiveness in the global semiconductor design landscape.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/indian-dli-scheme-for-semiconductor.jpg"
  },
  {
    "title": "From Builder Control to Resident Empowerment: The New Occupancy Certificate Framework",
    "description": "<p>The Maharashtra Government has enacted a significant reform, empowering housing societies to directly apply for Occupancy Certificates (OCs), addressing a critical issue where developers often failed to secure them. An OC is crucial for legal occupation, confirming a building's compliance with essential services. Historically, developers held exclusive rights to apply, frequently leading to misuse of power and leaving residents in Mumbai and MMR vulnerable to legal, financial, and redevelopment risks due to uncertified properties.</p>\n\n<p>Under the new initiative, over 25,000 buildings, including those under BMC, MHADA, and SRA, can now seek full or partial OCs, either jointly or independently. A six-month window offers penalty waivers for timely applications, though premiums apply for utilized additional FSI. This policy aims to simplify compliance for over 10 lakh residents by offering premium discounts and easing administrative hurdles. It fundamentally shifts control from developers to residents, acknowledging that many buildings are already occupied and tax-paying, while still upholding safety and structural integrity checks.</p>\n\n<p>This reform streamlines redevelopment for older properties, provides an alternative compliance route for projects outside RERA, and significantly boosts marketability and title certainty—factors vital for lenders, buyers, and insurers. Although it doesn't imply legal amnesty and applications may be rejected for major non-compliances, it empowers societies to collectively resolve long-standing issues. The move is expected to enhance buyer confidence, mitigate conflicts, and ultimately elevate housing standards across Maharashtra, marking a pivotal step towards lawful regularization and seamless urban development.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/maharshtra-new-occupancy-certificate.jpg"
  },
  {
    "title": "Financial Interest Is Not Consent: Limits on Impleading Non-Signatories in Arbitration",
    "description": "<p>The jurisprudence on impleading non-signatories in arbitration, especially post-Cox and Kings Ltd. v. SAP India Pvt. Ltd., emphasizes a balance between expanding arbitral jurisdiction and preventing its indiscriminate use. The Himachal Pradesh High Court, in Indian Institute of Technology, Mandi v. Central Public Works Department & Anr., reinforced that mere financial interest or project ownership does not constitute consent to arbitrate.</p>\n\n<p>The case involved IIT Mandi, which entered an MoU with CPWD for construction. CPWD then independently contracted a private contractor, with this contract containing an arbitration clause. When disputes arose between CPWD and the contractor, IIT Mandi sought impleadment in the arbitration, arguing a direct financial interest as any award against CPWD would ultimately be borne by IIT Mandi under their MoU. IIT Mandi contended that denial would violate natural justice and cited Supreme Court rulings on non-signatory binding. The contractor opposed, highlighting IIT Mandi's non-signatory status and lack of involvement in their contract.</p>\n\n<p>Both the arbitrator and the High Court rejected IIT Mandi's application. The High Court affirmed that arbitration is fundamentally consensual. IIT Mandi was not a signatory to the construction contract or its arbitration clause, and its MoU with CPWD was a distinct agreement. The Court ruled that financial consequences arising from a separate agreement do not automatically grant a non-signatory procedural rights in an unrelated arbitral proceeding. No express or implied consent by IIT Mandi to arbitrate with the contractor was found.</p>\n\n<p>This judgment signifies that the expansion of arbitration to non-signatories is an exception, not the rule. Courts will guard against transforming arbitration into multi-party civil litigation based solely on indirect financial implications. It cautions project owners and government bodies that downstream financial liability does not inherently confer arbitral procedural rights unless supported by clear contractual intent and conduct. Consent, whether express or implied, remains the cornerstone of arbitral jurisdiction; financial interest alone is legally insufficient.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/financial-interest-not-consent.jpg"
  },
  {
    "title": "Unjust Enrichment Post-Resolution: Justice Sundaresan Holds Award-Creditor Cannot Keep Money that No Longer Exists in Law",
    "description": "<p>The Bombay High Court, in a significant ruling by Justice Somasekhar Sundaresan in Reliance Naval & Engineering Ltd. v. Afcons Infrastructure Ltd., addressed the intersection of arbitration and insolvency law. The judgment held that an award-creditor, having withdrawn a court deposit, must return the funds if the underlying claim is subsequently extinguished by an approved resolution plan under the Insolvency & Bankruptcy Code (IBC), citing unjust enrichment.</p>\n\n<p>The case involved Reliance Naval, a corporate debtor, against whom an arbitral award of ₹49.11 crores was passed in favor of Afcons Infrastructure. While challenging the award, Reliance deposited ₹12.76 crores in court, which Afcons withdrew after furnishing a bank guarantee, thus making the withdrawal conditional. Subsequently, Reliance entered corporate insolvency resolution, and its approved plan reduced Afcons' claim to a symbolic Re. 1, extinguishing the original debt and providing a \"clean slate\" to the corporate debtor. Reliance then sought the return of the withdrawn amount.</p>\n\n<p>Reliance argued that the finality of the resolution plan extinguished Afcons' entitlement, making the money, as a corporate debtor's asset, revert to the resolution applicant. Afcons countered that the money ceased to be Reliance's asset post-withdrawal and that the bank guarantee protected its interest.</p>\n\n<p>Justice Sundaresan ruled that upon approval of the resolution plan, Afcons' claim, deemed a \"debt\" under IBC, stood statutorily expunged. Continued retention of the withdrawn sum would therefore constitute unjust enrichment. The Court clarified that the custodia legis principle merely regulates the fund's physical location, not its beneficial ownership. When the award's substratum vanished, the condition for withdrawal failed, necessitating restoration of the money. However, the Court rejected Reliance's claim for interest, deeming it a new cause of action beyond the scope of an interim application in an infructuous Section 34 petition.</p>\n\n<p>Consequently, Afcons was directed to re-deposit the sum, failing which its bank guarantee would be invoked. This decision reaffirms that an approved resolution plan overrides pre-existing adjudicatory labels, and funds held in court are not immune from the IBC's statutory waterfall mechanism, ultimately reverting to the corporate debtor's revitalized assets.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/unjust-enrichment-after-ibc-resolution.jpg"
  },
  {
    "title": "The Capture Of Nicolás Maduro And International Law: Sovereignty, Force, And The Limits Of Power",
    "description": "<p>The hypothetical capture of Venezuelan President Nicolás Maduro by United States forces would represent a profound challenge to international law, despite being framed as a domestic law-enforcement action. This operation would directly violate core principles of state sovereignty, the prohibition on the use of force, and the absolute personal immunity afforded to sitting heads of state under customary international law.</p>\n\n<p>Article 2(4) of the UN Charter prohibits states from using force against another's territorial integrity, a principle reaffirmed by the International Court of Justice (ICJ). Exceptions like self-defense or Security Council authorization would not apply, as transnational criminal conduct doesn't constitute an \"armed attack.\" Furthermore, customary international law, as affirmed by the ICJ in Arrest Warrant, grants heads of state absolute immunity from foreign criminal jurisdiction. A unilateral armed seizure on foreign soil is akin to extraordinary rendition, not legitimate law enforcement, creating international responsibility irrespective of domestic prosecution.</p>\n\n<p>Such an operation, involving the forcible capture of a sitting head of state, could be deemed an act of aggression, profoundly interfering with a state’s political independence. While not every unlawful use of force escalates into war, this could be classified as aggression, especially within a wider pattern of coercive conduct. Historical parallels, like the U.S. capture of Manuel Noriega, are not legal precedents; that invasion was widely condemned by the UN General Assembly for violating sovereignty. Isolated, condemned state actions do not establish new customary international law or justify future violations.</p>\n\n<p>Venezuela's legal avenues would include proceedings before the ICJ (facing jurisdictional hurdles without U.S. consent), engaging the UN Security Council or General Assembly for political condemnation, or implementing proportionate diplomatic and economic countermeasures. Ultimately, such an act fundamentally undermines the UN Charter and risks eroding the international legal order by normalizing unilateral assertions of power over established legal constraints, blurring the line between law enforcement and armed coercion.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/capture-of-nicolas-maduro.jpg"
  },
  {
    "title": "Landlord’s Bona Fide Need Prevails: Supreme Court Reins in Bombay HC’s Unwarranted Re-Appreciation of Evidence",
    "description": "<p>The Supreme Court of India, in Rajani Manohar Kuntha & Anr. v. Parshuram Chunilal Kanojiya & Ors., definitively clarified that the supervisory jurisdiction of High Courts under Article 227 is not a conduit for re-hearing appeals or undertaking a microscopic re-evaluation of evidence. The Court set aside a Bombay High Court judgment that had overturned concurrent eviction decrees.</p>\n\n<p>The case centered on a landlord seeking possession of non-residential premises for their daughter-in-law’s commercial venture. Both the Trial Court and the First Appellate Court found the need to be bona fide and decreed eviction. However, the Bombay High Court, exercising its revisional powers, re-examined the evidence extensively, concluding that the landlord’s case was insufficiently proven and that the tenant’s offer of alternative accommodation was not adequately considered.</p>\n\n<p>The Supreme Court emphasized that revisional powers are supervisory, reserved for instances where an inferior court's order is without jurisdiction or suffers from a glaring defect of law or procedure, not for delving deep into evidentiary terrain. It held that the High Court's actions amounted to an \"unauthorised re-trial,\" affirming that concurrent factual findings should not be disturbed unless perverse. The Court also reiterated that a tenant cannot impose alternative accommodation on a landlord and that a subsequent commercial electricity connection did not negate the landlord's genuine need for a property structurally suited for trade.</p>\n\n<p>Consequently, the SC allowed the appeal, restoring the judgments of the Trial Court and the First Appellate Court, thereby reviving the eviction decree. Recognizing the tenants' five-decade occupation, the Court granted an extended period until June 30, 2026, for vacant possession, subject to clearing arrears and providing an undertaking. This decision reinforces the limited scope of revisional jurisdiction, ensuring predictability for landlords while balancing substantive rights with equitable considerations.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/supreme-court-limits-eviction-cases.jpg"
  },
  {
    "title": "Landmark Judgments in Arbitration (2025)",
    "description": "<p>The year 2025 witnessed several significant rulings in arbitration law across Indian courts. The Supreme Court notably affirmed that parties' conduct and correspondence can bind them to an unsigned arbitration agreement, rejecting attempts to escape terms based on a lack of signature. It also clarified that High Courts cannot review their Section 11 orders appointing arbitrators once the process has substantially progressed, upholding the principle of minimal judicial interference. Regarding the determination of governing law for arbitration agreements without explicit choice, the Court adopted the \"closest and most real connection\" test, generally linking it to the underlying contract's governing law. Furthermore, the Supreme Court ruled against appointing an arbitrator for non-parties to a contract under Section 11 and established the maintainability of writ petitions against Micro, Small and Medium Enterprises Development Act (MSMED Act) orders if the council acts without jurisdiction or violates natural justice.</p>\n\n<p>The Bombay High Court held that disputes arising from an ancillary agreement, even without an arbitration clause, could be referred to arbitration if the main agreement contains one, and confirmed that bilateral fraud allegations are arbitrable. Conversely, it ruled that disputes concerning the enforcement of mortgage rights are non-arbitrable due to involving rights in rem. The Court also permitted the partial setting aside of an arbitral award, specifically removing personal liability imposed on Designated Partners of an LLP while affirming the award against the LLP itself.</p>\n\n<p>The Delhi High Court, in its rulings, clarified that an exclusive jurisdiction clause in an agreement prevails over subsequent communications merely designating a different arbitration venue, asserting that the designated seat governs jurisdiction. It also declined to re-refer a claim to arbitration under Section 11 when a previous tribunal had already found no evidence to support it, preventing re-agitation of conclusively decided matters. Crucially, the Delhi High Court granted an anti-arbitration injunction in a foreign-seated arbitration, emphasizing its power to intervene in \"blatantly vexatious, unconscionable, oppressive\" proceedings or those violating public policy, such as an arbitrator's non-disclosure of a conflict of interest.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/landmark-arbitration-judgements-2025.jpg"
  },
  {
    "title": "No Forced Possession in Delayed Projects: REAT Jaipur Clarifies Scope of Refund Rights",
    "description": "<p>The Real Estate Appellate Tribunal, Jaipur (REAT), in Satish Sharma v. VVA Developers Pvt. Ltd., has significantly clarified allottees' refund rights under the RERA Act. This pivotal ruling underscores that project delay, non-execution of an Agreement for Sale, and arbitrary unit substitution decisively favor the allottee, even when promoters claim partial project completion.</p>\n\n<p>The case originated from an allottee who booked a unit in 2013 and paid over 10% of the consideration, yet no Agreement for Sale was ever executed. Faced with prolonged delays and subsequent offers of different units after partial project completion, the allottee sought a full refund. The Regulatory Authority initially directed the promoter to either offer possession (with interest adjustment) or provide a refund minus 10% administrative charges if the allottee declined possession.</p>\n\n<p>REAT Jaipur modified this order, unequivocally stating that a promoter's failure to execute an Agreement for Sale (a breach of RERA Sections 13(1) and 13(2)) is a serious statutory violation, which prevents them from imposing contractual deductions like administrative charges. The Tribunal affirmed an allottee's unconditional right to a full refund with interest under Section 18(1) if possession is not delivered within the stipulated timeframe. Crucially, REAT ruled that refund rights are not diminished by partial project completion, belated possession offers, or unilateral substitution of units without the allottee's express consent. Allottees cannot be compelled to accept a unit never originally allotted to them.</p>\n\n<p>Consequently, the REAT directed the promoter to refund the entire deposited amount of ₹6,47,212 with applicable interest, without any deductions, within 45 days. This decision reinforces RERA's core objective to protect homebuyers from promoter non-compliance, strengthening the jurisprudence around remedies for delayed projects and statutory breaches.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/reat-jaipur-refund-rights-project.jpg"
  },
  {
    "title": "From Possession to Katha: KRERA Clarifies Developer’s Role in Title Completion",
    "description": "<p>The Karnataka Real Estate Regulatory Authority (KRERA) has issued a landmark ruling, directing a Bengaluru developer to facilitate katha (municipal property tax record) transfer to allottees within 30 days. This judgment, in Somashekar HG & Prakruti M v. Kavitha Ramreddy concerning project \"AQUATOWNN\", reinforces that post-sale title documentation is an enforceable obligation for promoters under the Real Estate (Regulation and Development) Act, 2016, not merely a formality.</p>\n\n<p>The dispute arose from buyers' grievance of undue delay in katha mutation, despite an express undertaking in the indemnity bond and sale deed. These contractual documents explicitly stipulated the developer's responsibility to transfer/mutate e-katha within 60 days of sale deed registration. KRERA held that these covenants established a positive duty on the promoter to facilitate the mutation process. The Authority clarified that Section 17(1) of RERA views \"title completion\" as a trinity encompassing registered conveyance, occupancy certificate, and katha in the allottee's favour.</p>\n\n<p>While mandating specific performance for katha transfer, KRERA rejected the buyers' plea for EMI compensation. The Authority stated that RERA's remedial architecture, though pro-consumer, cannot create liabilities for ancillary financial outgoings absent explicit contractual stipulations. The order thus crystallises three key propositions: an indemnity bond under RERA constitutes an enforceable undertaking, katha facilitation is integral to title completion, and compensation for monetary fallout must be rooted in explicit contractual terms. This ruling aims to standardize katha hand-over mechanisms, reinforcing promoter accountability and guiding both developers and buyers on contractual safeguards and regulatory expectations.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/krera-on-katha.jpg"
  },
  {
    "title": "My Face, My Voice: The Constitutional, Commercial, And Enforcement Dimensions Of AI-driven IP",
    "description": "<p>The Delhi High Court's interim order in Ranganathan Madhavan v G Filmz Studioz & Ors marks a landmark moment for personality rights, artificial intelligence, and platform liability in India. This ruling decisively reaffirms an individual's sovereign control over the commercial and moral value of their face and voice in the era of synthetic media.</p>\n\n<p>Actor R. Madhavan sued multiple defendants, including platforms like Meta and Google, for unauthorized exploitation of his name, image, likeness, and voice. These personal attributes, asserted as distinctive identifiers and valuable commercial assets, were used in AI-generated deepfakes, morphed pornographic content, and unauthorized merchandise. Platforms were included to facilitate enforcement.</p>\n\n<p>The court established Madhavan's persona as both a proprietary and dignitary interest, rooted in constitutional Articles 19 and 21, performers' moral rights under the Copyright Act, and common law. It protects these rights from unauthorized commercial gain and recognizes that obscene deepfakes infringe upon dignity.</p>\n\n<p>Crucially, the court distinguished AI-generated commercial exploitation from legitimate expressive uses. It ruled that AI-enabled personality cloning for deceptive advertising or pornographic content falls squarely outside fair dealing or free speech protections, considering AI an exacerbating factor in such infringements.</p>\n\n<p>The comprehensive interim relief restrains all identified and unknown infringers from using Madhavan's persona via any technology, including AI. A multi-layered enforcement strategy mandates video platforms to remove content, domain registrars to suspend infringing websites, merchandising platforms to delist products, and social media platforms to effect takedowns and disclose infringer details. This strategy assigns compliance costs to intermediaries and aids in identifying anonymous infringers.</p>\n\n<p>This judgment integrates personality rights as a robust economic interest, akin to a trademark, while firmly linking it to constitutional dignity. It offers a hybrid of property, privacy, and anti-defamation norms, establishing a technologically aware, commercially grounded, and constitutionally infused model for personality rights in India, setting a significant precedent for the digital self.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/my-face-my-voice-delhi-hc-on-ai-deepfakes-and-ip-rights.jpg"
  },
  {
    "title": "IBBI's Hybrid Regime for CIRP Compliance",
    "description": "<p>The Insolvency and Bankruptcy Board of India (IBBI) has introduced a hybrid regime for Corporate Insolvency Resolution Process (CIRP) compliance through its December 2025 circular. This follows the May 2025 update to CIRP forms and a temporary late fee exemption until December 31, 2025. The new circular operationalizes an OTP-authenticated \"Modification Utility\" on the IBBI portal, enabling Insolvency Professionals (IPs) to self-correct errors in previously filed forms without resorting to formal amendment routes. Corrections made before a form's statutory due date incur no penalty. However, modifications submitted after the due date are treated as new, delayed submissions, incurring a fee.</p>\n\n<p>Concurrently, the circular reactivates delayed filing levies from January 1, 2026, lifting the earlier suspension. For any form whose due date fell on or before December 31, 2025, but is ultimately submitted (whether original, corrected, or updated) on or after January 1, 2026, IPs must pay ₹500 per form per month of delay, exclusive of GST. This fee is automatically computed and collected electronically. An IP correcting a timely 2025 filing in 2026 will pay this fee, which attaches to the calendar month of the eventual re-upload. This regime combines procedural facilitation with economic deterrence, incentivizing early rectification and ensuring both accuracy and punctuality in CIRP filings.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/ibbi-allows-cirp-corrections-without-penalty-until-dec-31.jpg"
  },
  {
    "title": "Pending Criminal Case ≠ Passport Denial: Supreme Court on Renewal Rights under the Passports Act",
    "description": "<p>The Supreme Court, in Mahesh Kumar Agarwal v. Union of India, affirmed that pending criminal proceedings do not automatically lead to passport denial, underscoring the right to travel abroad as an intrinsic aspect of Article 21 personal liberty. This ruling clarifies that while the Passports Act, 1967, permits regulation, statutory restrictions must operate within defined legal and constitutional limits.</p>\n\n<p>The appellant, facing multiple criminal cases and a suspended sentence, secured permissions from trial courts for passport renewal, with conditions restricting foreign travel without prior judicial approval. However, the Regional Passport Office refused normal renewal, citing Section 6(2)(f) of the Act and demanding specific court permission for foreign travel for a defined period. This decision was upheld by the High Court, prompting an appeal to the Supreme Court.</p>\n\n<p>The Supreme Court comprehensively interpreted the Passports Act, harmonizing Section 6(2)(f) (mandating refusal during criminal proceedings) with Section 22, which enables the Central Government to grant exemptions. It emphasized the full effect of Notification GSR 570(E) of 1993, providing a conditional exemption for such persons, subject to court permission and necessary safeguards.</p>\n\n<p>The Court ruled that indefinite denial of passport renewal, particularly when criminal courts have already imposed safeguards to ensure the accused's presence, constitutes a disproportionate restriction under Article 21. It mandated administrative authorities to respect judicial permissions granted by competent courts. This judgment prevents procedural safeguards from becoming permanent disabilities, upholding judicial oversight and constitutional guarantees against rigid application of statutory provisions.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/pending-criminal-case-not-a-bar-to-passport-renewal.jpg"
  },
  {
    "title": "Pre-Agreed Online Dispute Resolution Clause Prevails – Amit Chaurasia v. ICICI Bank Limited",
    "description": "<p>The Bombay High Court, in Amit Chaurasia v. ICICI Bank Limited (December 2025), strongly affirmed party autonomy in online dispute resolution (ODR) arbitration while also encouraging consensual settlement. The case involved a borrower challenging a credit facility's ODR clause, which specified dispute resolution through the bank's Online Dispute Resolution Agency (ODRA) via a two-step process: mandatory conciliation followed by arbitration.</p>\n\n<p>The petitioner argued that there was no consensus on the arbitrator's identity and that the ODRA lacked statutory independence. However, the Court held that the petitioner's acceptance of the facility after receiving notice of the web-linked terms and conditions, coupled with a failure to object to ODRA intimations, constituted implied acceptance under Section 7 of the Arbitration and Conciliation Act, 1996. It further clarified that a pre-named institutional arbitrator, chosen contractually by parties, is not inherently biased or indicative of a lack of consent.</p>\n\n<p>Despite rejecting the challenge to the arbitration agreement, the Court, recognizing the modest monetary stakes and both parties' openness to settle, exercised its inherent powers to direct them to mediation. This ruling sends a clear message: courts will uphold commercial contracts incorporating institutionalized dispute resolution mechanisms, yet simultaneously facilitate negotiated resolutions when parties are amenable, demonstrating that party autonomy and access to justice can coexist effectively.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/online-dispute-resolution-clause.jpg"
  },
  {
    "title": "Arbitral Tribunal Alone Decides Who May Invoke Arbitration, Supreme Court Reiterates",
    "description": "<p>The Supreme Court dismissed appeals, reaffirming the arbitral tribunal's authority to decide substantive questions like whether a single consortium member may invoke arbitration. The Court held such questions fall under Section 16 of the Arbitration and Conciliation Act, 1996, limiting judicial scrutiny under Section 11(6) to merely confirming the prima facie existence of an arbitration agreement.</p>\n\n<p>The case stemmed from an APGENCO EPC tender, where Tecpro, a consortium member, unilaterally invoked arbitration after entering Corporate Insolvency Resolution Process (CIRP). Appellants APGENCO and VA Tech argued the arbitration agreement mandated collective invocation, citing Tecpro's insolvency and leadership change. Tecpro countered that the consortium wasn't a juristic person and its agreement allowed individual representation upon insolvency.</p>\n\n<p>The Supreme Court underscored the policy of minimal judicial intervention, clarifying that the appellants conflated the \"existence\" of an arbitration agreement with Tecpro's \"entitlement\" or \"capacity\" to invoke it individually. Substantive issues, including consortium survival, consent requirements, and liquidation impact, are exclusively for the arbitral tribunal. The Court dismissed the appeals, upholding the High Court's tribunal appointment and remitting all substantive objections to the arbitrator under Section 16, reinforcing the principle of kompetenz-kompetenz.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/tribunal-decides-arbitration-invoke.jpg"
  },
  {
    "title": "Arbitration At The Guillotine: Inside The Supreme Court’s 269 Page Judgement, UNCITRAL’s Evolution, SIAC-LCIA-HKIAC Perspectives, And The Road To The Arbitration And Conciliation Bill, 2024",
    "description": "<p>The Supreme Court's judgment in Harshbir Singh Pannu v. Jaswinder Singh critically examines how \"termination of arbitral proceedings\" has been weaponized in India. The Court's deep dive, tracing from the UNCITRAL Model Law to international institutional rules (SIAC, LCIA, HKIAC), reveals how India's fragmented statutory provisions in Sections 25, 30, 32, and 38 of the Arbitration and Conciliation Act, 1996, undermine the arbitral process.</p>\n\n<p>The case, stemming from a hospital partnership dispute, highlighted how fee recalibrations post-counterclaim, and subsequent termination orders under Section 38 for non-payment, can act as a \"procedural guillotine,\" effectively extinguishing valid claims without a merits adjudication. Unlike the clear, consolidated termination frameworks of international institutions, India's Act creates a fog of uncertainty regarding the tribunal's mandate and parties' recourse, diverging from UNCITRAL's intent for carefully delimited termination scenarios.</p>\n\n<p>Recognizing these systemic flaws, the Supreme Court, while partially vindicating the appellant, provided \"meaningful suggestions\" for legislative reform. The article argues the forthcoming Arbitration and Conciliation Bill, 2024, must: consolidate termination grounds into a single, comprehensive provision; establish a transparent, \"terms of reference\"-driven fee and deposit regime; and create an express statutory remedy against capricious termination orders.</p>\n\n<p>These reforms, supported by similar critiques in ASF Buildtech (jurisdiction) and Gayatri Balasamy (post-award control), are crucial to transform termination from a weapon into a calibrated safeguard. The Bill's success in translating these lessons will determine whether Indian arbitration achieves parity with leading global forums.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/arbitration-bill-2024.jpg"
  },
  {
    "title": "Centralising Religious Dietary Certifications: An Analysis of the Food Safety and Standards (Amendment) Bill, 2025",
    "description": "<p>The Food Safety and Standards (Amendment) Bill, 2025 represents a pivotal shift in India's regulation of faith-based dietary certifications, particularly Halal. Addressing long-standing concerns regarding a lack of legal oversight, inconsistent standards, and unchecked private certification practices, the Bill seeks to bring these under a statutory, government-controlled framework.</p>\n\n<p>The legislation expands the Food Safety and Standards Authority of India (FSSAI)'s mandate, empowering it to regulate, grant, and monitor religious dietary certifications exclusively through government-notified agencies under the Union Ministry of Health and Family Welfare. Crucially, the Bill prohibits private organizations, trusts, or societies from issuing Halal certifications or collecting associated fees, centralizing this authority with designated government agencies and directing all fees to the Consolidated Fund of India. The scope of such certifications is strictly limited to food products for human consumption, with stringent penalties for contravention.</p>\n\n<p>A dedicated Committee on Certification of Religious Dietary Food Items is established to formulate and periodically update uniform national standards for all forms of religious dietary certifications, encompassing Halal, Kosher, and Jhatka. This committee ensures a balanced approach incorporating scientific expertise and inter-ministerial coordination, covering aspects like slaughter, processing, packaging, and labelling. The overarching intent is to enhance consumer confidence, ensure transparency, and uphold accountability within India's food safety regime by balancing respect for religious practices with public health and regulatory integrity.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/religious-dietary-certifications.jpg"
  },
  {
    "title": "Digital Personal Data Protection Act 2025",
    "description": "<p>The Digital Personal Data Protection Act (DPDP Act) 2025, whose rules were notified on November 13, 2025, establishes a comprehensive framework for governing how organizations in India collect, use, store, and process the personal data of individuals, referred to as Data Principals. This legislation is crucial for enhancing data protection and privacy standards across the nation.</p>\n\n<p>The implementation of the DPDP Act is structured in phases. Following its notification as the effective date, subsequent stages will introduce the Consent Manager Ecosystem in Phase 2, culminating in full compliance and enforcement during Phase 3. To facilitate a smooth transition, the government has provided an 18-month lead time for most of the Act's provisions. The Act also specifies penalties for instances of non-compliance, reinforcing its commitment to robust data privacy.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/digital-personal-data-protection-act-2025-timelines-penalties.jpg"
  },
  {
    "title": "RERA’s Iron Grip Strengthened: Courts Redefine Allottee Rights in Mortgages, Leases & Insolvency",
    "description": "<p>The Real Estate (Regulation and Development) Act, 2016 (RERA), enacted to safeguard homebuyers, has seen its authority significantly fortified by recent judicial interventions. These rulings have consistently prioritized allottee rights, challenging contractual loopholes and traditional financial claims.</p>\n\n<p>Initially, developers attempted to bypass RERA by structuring transactions as long-term \"leases\" (e.g., 999 years) rather than sales, claiming their customers were merely \"lessees\" outside RERA's purview. In Lavasa Corporation Ltd. vs. Jitendra Jagdish Tulsiani, courts applied the \"substance over form\" principle. They ruled that such agreements, involving substantial upfront \"premiums\" and minimal \"rent,\" were essentially sales, thereby confirming buyers as \"allottees\" under RERA and closing this potential loophole.</p>\n\n<p>A more profound challenge emerged from the conflict between homebuyers and banks. Banks, as \"secured creditors\" under the SARFAESI Act, would seize projects upon developer default, often leaving allottees who had paid for their units with no recourse. The Supreme Court, in Union Bank of India vs. Rajasthan RERA, delivered a landmark decision. It held that when a bank takes control of a RERA-registered project, it becomes a \"statutory assignee\" and therefore a \"promoter\" under RERA, assuming the original developer's liabilities to allottees. This decision effectively elevated RERA-secured homebuyer rights above SARFAESI-secured lenders' recovery rights, compelling banks to become de facto monitors of project compliance.</p>\n\n<p>Further strengthening allottee protection, the judiciary addressed conflicts with the Insolvency and Bankruptcy Code (IBC). In Vishal Chelani v. Debashis Nanda, the Supreme Court rejected attempts to \"hyper-classify\" allottees, ensuring those seeking RERA refunds maintained their status as \"financial creditors\" under the IBC with equal priority. The Mansi Brar Fernandes v. Shubha Sharma ruling clarified that IBC protections are for \"genuine homebuyers\" seeking shelter, not speculative investors using assured return schemes. Crucially, this judgment also elevated the right to housing to a \"fundamental right\" derived from Article 21 of the Constitution, providing a robust constitutional foundation for allottee protection and advocating for \"project-by-project\" insolvency.</p>\n\n<p>These judicial interventions have profoundly redefined the homebuyer's status, transforming them from a mere contractual party to a beneficiary of a constitutionally protected \"fundamental right\" and a robust \"financial creditor\" in insolvency. This shift has imposed significant accountability on developers and financial institutions, fostering a more transparent and allottee-centric real estate ecosystem.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/rera-allottee-rights-2025.jpg"
  },
  {
    "title": "Madras High Court Partially Sets Aside Arbitral Award for Exceeding Jurisdiction in Applying ‘Alter Ego’ Doctrine",
    "description": "<p>The Madras High Court, in Sugesan Transport Pvt. Ltd. v. E.C. Bose & Company Pvt. Ltd., significantly clarified the limits of an arbitral tribunal's jurisdiction, particularly regarding the doctrines of lifting the corporate veil and alter ego, and the assessment of damages. The Court reaffirmed that arbitral awards must strictly adhere to the contractual framework and cannot extend obligations beyond the arbitration agreement.</p>\n\n<p>The dispute arose from a Memorandum of Understanding (MoU) where Sugesan Transport advanced ₹2.50 crores to E.C. Bose for a performance bank guarantee. E.C. Bose failed to repay the amount. During arbitration, E.C. Bose counter-claimed ₹75 crores, alleging a joint venture for a KOPT contract and Sugesan's failure to supply equipment. The Arbitrator partially accepted both claims, directing repayment of ₹2.50 crores to Sugesan but also awarding ₹6.51 crores as damages to E.C. Bose, imputing equipment supply obligations to Sugesan based on documents signed by a third entity (Collate Consultants Pvt. Ltd.) and applying the ‘alter ego’ doctrine.</p>\n\n<p>The High Court held that an arbitral tribunal is a creature of contract and cannot extend liability to non-signatories or pierce the corporate veil; these powers are exclusive to courts. It found the Arbitrator's reliance on Collate Consultants' documents to impose obligations on Sugesan without jurisdiction. The Court further noted that the NCLAT and Supreme Court had already ruled the MoU was a standalone financial transaction, independent of any equipment supply obligations. Regarding damages, the Court stressed that under Sections 73 and 74 of the Indian Contract Act, damages must be proven with actual loss and evidentiary basis, not speculative assumptions like the mere encashment of a bank guarantee.</p>\n\n<p>Consequently, the High Court partially set aside the arbitral award. It upheld the direction for E.C. Bose to repay ₹2.50 crores to Sugesan Transport but entirely eliminated the counter-claim award of ₹6.51 crores in favour of E.C. Bose, deeming it unsustainable. This judgment reinforces that arbitral tribunals must operate strictly within the arbitration agreement's contours, cannot apply doctrines like 'alter ego' to non-signatories, and damages must be strictly proven.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/madras-hc-tribunal-jurisdiction.jpg"
  },
  {
    "title": "Restoring Dignity and Property: SC Rules on Mahr and Marriage Gifts",
    "description": "<p>The Supreme Court, in `Rousanara Begum v. S.K. Salahuddin`, has decisively reaffirmed a divorced Muslim woman’s non-negotiable economic rights. This landmark decision ensures her entitlement to property, money, and jewellery received at marriage, aligning with the Muslim Women (Protection of Rights on Divorce) Act, 1986. The ruling prioritizes securing dignity, equality, and financial protection, moving beyond technicalities to address women's vulnerabilities post-divorce.</p>\n\n<p>The Court clarified that a woman's ownership rights over such assets persist even after marriage ends. These gifts often serve as a woman's sole financial resource, offering critical economic security and personal dignity. The judgment reinforces Section 3 of the 1986 Act, interpreting it as social justice legislation grounded in constitutional values of equality, dignity, and autonomy (Article 21). It challenges patriarchal assumptions that absorb a woman's property into the marital household, protecting her from post-divorce vulnerability.</p>\n\n<p>The ruling emphasizes that legal interpretation must consider social realities and legislative intent, ensuring women's claims are not dismissed due to minor inconsistencies. It clarifies that the 1986 Act covers assets received \"before or at the time of marriage or after her marriage,\" aligning with Daniel Latifi principles for long-term financial stability. The Court instructs lower courts to adopt interpretations favoring women's empowerment and dignity. Ultimately, the decision reframes women as rights-bearing individuals with enforceable claims to property, reinforcing that a woman's property remains her own before, during, and after divorce. The SC overturned the High Court, directing the respondent to return assets with interest.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/sc-reaffirms-mahr-and-marriage-gift-rights.jpg"
  },
  {
    "title": "Police Power versus Food Safety Officer Jurisdiction : Rajasthan High Court Clears the Air in Ravi v. State of Rajasthan",
    "description": "<p>The Rajasthan High Court, in Ravi v. State of Rajasthan, quashed an FIR and criminal proceedings involving food adulteration and misbranding under Sections 272, 273, and 420 of the Indian Penal Code (IPC) read with the Food Safety and Standards Act, 2006 (FSSA). The ruling re-established the primacy of the FSSA as a special law over general IPC provisions for identical conduct, emphasizing that once conduct is punishable under the more stringent FSSA, the general provisions of the IPC must yield.</p>\n\n<p>The petitioner argued that the FSSA, being a self-contained code with an \"over-riding effect\" under Section 89, supersedes IPC Sections 272 and 273 once an offence under FSSA Section 59 is made out. Furthermore, it was contended that only a qualified Food Safety Officer is authorized to investigate adulteration cases, not the police. The charge of cheating (IPC Section 420) was also contested due to the absence of allegations regarding inducement or wrongful loss to any purchaser. The State, conversely, argued that IPC offences retain independent identity and police are competent to investigate cognizable offences like IPC 420.</p>\n\n<p>Citing Supreme Court precedents (Ram Nath v. State of U.P. and Sushil Kumar Gupta v. State of West Bengal), the High Court affirmed that the FSSA, with its comprehensive and often more stringent provisions, overrides general IPC sections 272 and 273, thereby barring simultaneous prosecution. The court found no foundational facts for cheating under IPC 420 in the FIR, dismissing the charge. Crucially, it held that police investigation into adulteration contravenes the FSSA statutory scheme, which vests such powers exclusively in Food Safety Officers. Consequently, all proceedings from the FIR were quashed, though the competent food authority remains free to pursue remedies solely under the FSSA. This judgment reinforces that specific statutory codes with built-in safeguards take precedence over general criminal law for the same set of facts.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/rajasthan-hc-on-fssa-override-of-ipc-powers.jpg"
  },
  {
    "title": "Punjab & Haryana High Court Reaffirms Statutory Grace Period for Expired Driving Licences: Insurer Denied Recovery Rights",
    "description": "<p>The Punjab and Haryana High Court has reiterated that a formally expired driving license remains legally effective for the 30-day statutory grace period stipulated under Section 14(1) of the Motor Vehicles Act, 1988. This judgment, delivered on November 21, 2025, dismissed an appeal by National Insurance Company Limited, denying the insurer any right to recover compensation it had paid to accident victims.</p>\n\n<p>The dispute arose from an accident where the driver's license had expired on June 4, 2001, and the accident occurred on July 4, 2001, with renewal only on August 6, 2001. The insurer argued the driver was unlicensed, constituting a policy breach and entitling them to recovery. However, the vehicle owner contended that the accident, which happened at 10:45 a.m. on July 4, 2001, fell squarely within the 30-day grace period, which commenced on June 5, 2001, and expired at midnight on July 4, 2001.</p>\n\n<p>Justice Virinder Aggarwal, examining the provision's plain language, affirmed that the legislature explicitly defers the cessation of an expired license by thirty days. Citing precedents like State of Haryana & Anr. v. Karkor & Ors. and Oriental Insurance Co. Ltd. v. Smt. Santosh Kumari, the Court concluded that the driver was legally licensed at the time of the accident. Consequently, no breach of policy conditions occurred, and the insurer's plea for recovery was dismissed, affirming the Motor Accident Claims Tribunal's original award. This ruling emphasizes that the 30-day extension is a substantive continuation of license validity, necessitating insurers to factor this legislated continuum into their risk assessments.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/high-court-upholds-30-day-grace-for-expired-licences.jpg"
  },
  {
    "title": "Behaviour-Based Safety: The Leadership Strategy India Needs to Prevent Industrial Accidents",
    "description": "<p>India confronts a disturbing rise in industrial accidents, despite modern equipment and regulatory frameworks like the OSH Code 2020, which often foster administrative compliance over genuine safety leadership. The article underscores that true safety is a lived culture, not merely a presented metric, illustrated by an executive's silent gesture conveying, \"Safety is not something you present, it’s something you live.\"</p>\n\n<p>Behaviour-Based Safety (BBS) is posited as the critical strategy to transform safety from a compliance exercise into a core leadership value and shared organizational habit. Inspired by DuPont's pioneering 1960s BBS program, which evolved from over a century of safety commitment, the author shares personal success implementing BBS in India. BBS moves beyond rules and checklists to foster a robust safety culture.</p>\n\n<p>While effective BBS implementation requires thorough understanding, as many companies prematurely abandon efforts, it yields significant benefits. Tangible improvements manifest in production, quality, delivery, sustainability, and morale within 10-15 months. Intangible gains include a vibrant culture, increased employee ownership, teamwork, and a harmonious workplace.</p>\n\n<p>Ultimately, safety is presented as a fundamental leadership mindset. Leaders' visible commitment—demonstrated through curiosity on the shop floor, appreciation of safe behavior, and coaching—builds an \"invisible shield\" protecting people and assets. This shift from prescribed rules to lived practice, where leaders' actions shape belief, cultivates a culture of excellence, trust, and pride, making safety synonymous with effective leadership.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/behaviour-based-safety-leadership-to-prevent-accidents.jpg"
  },
  {
    "title": "Don’t Sell Me This Pen: RBI Prohibits Lending Service Providers From Playing Salesmen",
    "description": "<p>The Reserve Bank of India (RBI) issued comprehensive Digital Lending (DL) Directions, 2025 (effective May 8, 2025), to mitigate severe consumer protection risks like opaque pricing, aggressive collection, and data misuse in India's growing digital lending sector.</p>\n\n<p>A central reform is the \"salesman ban\" for Lending Service Providers (LSPs) from November 1, 2025. LSPs are now barred from biased promotions for preferred Regulated Entities (REs). Multi-lender platforms must display all matching loan offers objectively, avoiding \"dark patterns.\" REs assume full responsibility for fair market conduct. Lenders must provide complete upfront information, including a prominent Key Fact Statement (KFS) detailing APR and all charges for informed consent.</p>\n\n<p>The Directions formalize RE-LSP relationships via mandatory contracts, requiring REs to perform enhanced due diligence and periodic reviews. Crucially, REs remain entirely responsible and liable for all LSP actions, affirming that financial duty of care cannot be delegated. All customer complaints related to Digital Lending Applications (DLAs) must be handled directly by the RE.</p>\n\n<p>Strict data norms enforce minimization and explicit consent. DLAs cannot access sensitive mobile data (contacts, call logs); any temporary access, e.g., camera for KYC, needs explicit, audited consent. Borrowers can withdraw consent and request data deletion. All borrower data must be stored on Indian servers, with data processed abroad deleted and repatriated within 24 hours to enhance supervisory control.</p>\n\n<p>These DL Directions represent a significant shift toward a governance-heavy model, increasing compliance burdens and operational costs for both REs and LSPs. REs must invest in robust internal systems, while LSPs face marketing restrictions and strict data practices. The overarching goal is to boost consumer confidence and transparency by ensuring LSPs act as neutral aggregators, firmly embedding digital innovation within India's consumer protection framework.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/rbi-bans-lsp-sales-practices-under-digital-lending.jpg"
  },
  {
    "title": "CG-RERA Circular 139/2025: “Notarised” Contract Term Variations and the Sole Collection Account",
    "description": "<p>Chhattisgarh Real Estate Regulatory Authority (CG-RERA), through Circular No. 139 dated November 14, 2025, has translated Supreme Court's disapproval of opaque builder-buyer paperwork into practical directives. These immediate, transversal instructions apply to all project documentation and are framed as conditions precedent for lawful execution and registration.</p>\n\n<p>The circular introduces a \"notarisation\" protocol: any clause or deviation from the statutory Agreement for Sale (AFS) template (Rule 9's Annexure-A) must be \"notarised\" by the competent Revenue Authority before execution. This compulsory step ensures that additional covenants (e.g., penal interest, construction milestones, amenities promises) or bespoke riders, whether pre- or post-registration, are publicly attested. This closes the loophole of promoters later inserting supplementary sheets. Non-compliance will lead to penalties, including refusal or revocation of project registration.</p>\n\n<p>Parallel to this, the circular mandates that only the RERA Collection Account number must be displayed across all project documentation—including sale deeds, allotment letters, brochures, and website banners. Any reference to alternative bank accounts (escrow, partnership, or group company accounts) is strictly prohibited. This aims to funnel all payments into the Authority’s dashboard-integrated account, permitting real-time reconciliation and enhancing transparency. Promoters marketing inventory must purge alternative account numbers within seven days.</p>\n\n<p>By making every deviation publicly attested and every monetary destination uniquely identifiable, Circular 139 converts the AFS into a tightly scripted instrument. This directive serves as both a compliance accelerator for promoters and a consumer shield, giving practical teeth to RERA's promise of transparency and protection.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/cg-rera-circular-139-new-notarisation-account-rules.jpg"
  }
]