[
  {
    "title": "Balancing Disclosure Requirements and Unintentional Errors in Passport Applications",
    "description": "<p>The Punjab and Haryana High Court recently addressed the complexities surrounding passport revocation in the case of *Navpreet Kaur v. Union of India & Ors.*, emphasizing the need for a nuanced approach by passport authorities when dealing with potential errors in applications. The case involved a petitioner, Navpreet Kaur, whose passport was revoked for allegedly suppressing material information regarding her marital status.</p>\n\n<p>The Regional Passport Office (RPO) revoked Kaur's passport after she applied to change her spouse's name, citing that she had previously mentioned her former husband's name on prior applications despite their divorce. The High Court analyzed whether mentioning a previous spouse's name constituted suppression of material information under the Passports Act, 1967, and whether revocation was justified.</p>\n\n<p>The court ruled that the suppression or misinformation must be *material*, meaning it would have led to the passport's refusal under Section 5(2)(c) of the Act if disclosed correctly. Drawing on precedent, the court determined that inadvertent mistakes regarding marital status do not warrant revocation under Section 10(3)(b). The court found Kaur's explanation plausible—that the error was an oversight during renewal—and emphasized that incorrect disclosure without intent to misuse does not trigger penal provisions. The court allowed Kaur's petition, nullified the revocation, and instructed authorities to issue a new passport with accurate details. This judgment serves as a reminder that passport authorities must exercise caution and consider the nuances of each case before resorting to revocation.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/hc-rules-on-passport-revocation-for-unintentional-errors.jpg"
  },
  {
    "title": "No Receipts, No Problem: Supreme Court Clarifies Enforceability of Cash in Promissory Notes",
    "description": "<p>The Supreme Court has addressed a common problem in recovery suits involving cash components in financial transactions, particularly when receipts are absent. The core issue revolves around whether courts should enforce the full amount acknowledged in a written instrument, like a promissory note, even if a portion was paid in cash without independent proof, or discount the cash element.</p>\n\n<p>The court case *Georgekutty Chacko v. M.N. Saji* served as the backdrop. The Kerala High Court had previously reduced the decreed amount of a promissory note, only accepting bank transfers and rejecting the cash component. The Supreme Court overturned this decision, emphasizing that a promissory note acts as sufficient acknowledgment of the entire debt. The absence of cash receipts does not invalidate the claim. Once liability is acknowledged in writing, the burden shifts to the borrower to disprove it, reinforcing the evidentiary weight of such instruments.</p>\n\n<p>The ruling underscores that while courts acknowledge the challenges in tracing cash payments, they recognize them as a legitimate part of financial dealings. The court seeks to balance protecting lenders from unfair denial of debt and ensuring borrowers are not burdened by unsubstantiated claims. This approach preserves confidence in financial dealings by upholding the reliability of promissory notes while allowing for valid defenses.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/sc-upholds-cash-validity-in-promissory-note-debt-recovery.jpg"
  },
  {
    "title": "Family Property Dispute Settled: Supreme Court Clarifies What Truly Constitutes Ownership",
    "description": "<p>The Supreme Court of India has reiterated that property ownership requires a registered sale deed and cannot be validly claimed through documents like Agreements to Sell, General Power of Attorney (GPA), or affidavits. In *Ramesh Chand (D) Thr. LRs. v. Suresh Chand & Anr.*, the Court emphasized the necessity of strict proof for Wills, particularly when surrounded by suspicious circumstances. This ruling reverses the prior decisions of the Trial Court and High Court, establishing a cautionary precedent for family property disputes where informal transfers and unproven documentation are prevalent.</p>\n\n<p>The case originated from a dispute between two brothers, Suresh Chand and Ramesh Chand, over property previously owned by their deceased father, Kundan Lal. Suresh claimed sole ownership based on a 1996 Agreement to Sell, GPA, affidavit, receipt, and registered Will. Ramesh contested these documents, asserting that the property had been orally gifted to him in 1973.</p>\n\n<p>The Supreme Court determined that the property remained with Kundan Lal until his death and, given the failure to properly prove the Will, would devolve upon all Class-I legal heirs under succession law. The Court clarified that Ramesh Chand's sale of a portion of the property would only be valid to the extent of his rightful share, safeguarding the purchaser's interests without infringing on the rights of other heirs. Consequently, the prior judgments were overturned, the plaintiff's suit was dismissed, and the parties were directed to resolve their respective rights through succession law.</p>\n\n<p>This ruling underscores the critical importance of complying with statutory requirements for property transfers. By emphasizing the need for formal, registered instruments, the Court aims to promote transparency in property dealings and prevent disputes arising from informal transfers. While potentially affecting litigants who relied on less formal documentation, the decision ultimately reinforces the rule of law and aims to reduce manipulation in succession disputes.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/registered-sale-deed-key-for-property-ownership-sc-ruling.jpg"
  },
  {
    "title": "Immigration Rules 2025: What Foreign Nationals, Carriers, and Businesses Need to Know",
    "description": "<p>On September 1, 2025, India's Ministry of Home Affairs (MHA) implemented the Immigration and Foreigners Rules, 2025, under the new Immigration and Foreigners Act, 2025. This Act and its Rules consolidate and modernize India’s immigration laws, creating a comprehensive framework governing the entry, stay, movement, and exit of foreign nationals, as well as outlining the responsibilities of carriers and immigration authorities.</p>\n\n<p>Previously, India's immigration framework was a fragmented system of statutes and executive orders, including the Foreigners Act, 1946. The new Act and Rules aim to address duplication, ambiguities, and compliance challenges by establishing a single, comprehensive code. The Bureau of Immigration (BoI) is formally designated as the nodal body for implementing and enforcing the Act, standardizing procedures and documentation nationwide.</p>\n\n<p>Key changes include enhanced responsibilities for airlines, shipping companies, and other carriers. They are now required to provide Advance Passenger Information (API), Passenger Name Record (PNR) data, and a General Declaration prior to departure, subject to verification by an Immigration Officer. Non-compliance can result in significant penalties. The system also incorporates technology-driven measures, such as biometric verification, digitized records, and centralized databases, to improve border security and streamline passenger processing.</p>\n\n<p>The new Rules impact foreign nationals, carriers, employers, and legal practitioners. Foreign nationals must maintain valid travel documents to avoid penalties or deportation. Carriers must upgrade their systems to comply with mandatory data-sharing requirements. Employers must reassess their immigration compliance protocols, and legal practitioners can anticipate increased disputes related to immigration enforcement. Overall, the Immigration and Foreigners Rules, 2025 represent a fundamental shift in how immigration law is administered in India, emphasizing secure, transparent, and efficient management through centralized authority, mandated carrier compliance, and technology-driven oversight.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/indias-immigration-rules-2025-key-compliance-updates.jpg"
  },
  {
    "title": "When Screenshots Aren’t Enough: NCLAT Slams Bid-Rigging Allegation in Atlas Alloy Liquidation Auction",
    "description": "<p>The National Company Law Appellate Tribunal (NCLAT) dismissed an appeal alleging bid-rigging in the liquidation auction of M/s Atlas Alloy (India) Private Limited. The case, *Jai Agarwal v. Satyendra Prasad Khorania & Ors.*, centered on accusations of collusion and technical sabotage after the appellant, Jai Agarwal, lost the auction for a Beawar plot by a narrow margin.</p>\n\n<p>The auction, conducted on the government-mandated portal, saw Novelty Textiles emerge as the highest bidder. Agarwal alleged that Novelty was a \"straw man\" bidder inserted at the last minute, and further claimed bribery, confidentiality breaches, and technical obstruction. The NCLT Jaipur Bench initially dismissed Agarwal's plea, prompting the appeal to the NCLAT.</p>\n\n<p>The NCLAT scrutinized Agarwal's claims against the portal's audit logs, bank statements, and time-stamped entries. The tribunal found no evidence to support the allegations of collusion, bribery, or technical manipulation. It emphasized that while Regulation 33 of the IBBI (Liquidation Process) Regulations, 2016, mandates transparency and value maximization, accusations of fraud must be distinctly alleged and strictly proven. The NCLAT upheld the NCLT's order, emphasizing that the e-auction was fair, transparent, and compliant with the law. The case serves as a reminder that suspicion and screenshots are insufficient substitutes for hard data in insolvency proceedings, and highlights the importance of fair participation and documented transparency in e-auctions.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/nclat-dismisses-bid-rigging-claim-in-atlas-alloy-auction.jpg"
  },
  {
    "title": "From Undervaluation to Justice: Supreme Court’s Ruling on Motor Accident Compensation",
    "description": "<p>The Supreme Court of India, in *Hitesh Nagjibhai Patel v. Bababhai Nagjibhai Rabari & Anr.*, has emphasized the need for \"just and fair compensation\" in motor accident cases, particularly those involving minors with permanent disabilities. The Court criticized lower courts for undervaluing the claim and failing to adhere to established legal principles. The ruling aims to prevent delays and unnecessary appeals in future claims.</p>\n\n<p>The case involved an eight-year-old boy who suffered severe injuries in 2012 due to a motor accident, resulting in 90% permanent functional disability. The boy filed a claim petition seeking ₹10 lakh in compensation. The Supreme Court assessed whether the compensation awarded by lower courts was adequate, considering the permanent disability.</p>\n\n<p>Ultimately, the Supreme Court significantly increased the compensation to ₹35,90,489 with 9% interest from the claim petition date, highlighting the necessity of just and fair compensation, especially when minors suffer permanent disabilities. This judgment serves as a precedent for future motor accident claims, ensuring that courts apply settled law vigilantly and that procedural lapses leading to undervaluation of claims are not overlooked, reinforcing the protection of claimants.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/sc-enhances-compensation-for-minor-in-motor-accident-case.jpg"
  },
  {
    "title": "Delay in Challenging an Award: When Does the Clock Start for the Government?",
    "description": "<p>The Supreme Court of India, in *M/s Motilal Agarwala v. State of West Bengal*, addressed the crucial question of when the 90-day limitation period under Section 34 of the Arbitration and Conciliation Act, 1996, commences for government entities. The court reaffirmed that the limitation period begins only when a signed copy of the arbitral award reaches the officer competent to decide on challenging the award, not merely upon receipt by any government official.</p>\n\n<p>The case arose from a 2013 arbitral award in favor of M/s Motilal Agarwala. Although an Assistant Engineer received a copy of the award shortly after it was issued, the State of West Bengal claimed they only became aware of it much later during execution proceedings. The State then filed a Section 34 application to challenge the award, which was initially dismissed by the District Court as time-barred. The Calcutta High Court reversed this decision, holding that service on an unauthorized officer did not trigger the limitation period.</p>\n\n<p>The Supreme Court upheld the High Court's judgment, emphasizing that for large government organizations, the award must reach the individual with knowledge of the proceedings and the authority to decide whether to challenge it. The Court noted that delivery of the award is not a mere formality and that diluting the \"competent authority\" rule would create uncertainty in government litigation. Consequently, the Supreme Court dismissed the contractor's appeal and directed the District Court to decide the Section 34 application on its merits. The ruling clarifies that limitation starts only when the competent departmental head receives a signed copy, aiming to balance the strictness of limitation with the realities of bureaucratic structure.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/limitation-period-in-arbitration-for-government-clarified.jpg"
  },
  {
    "title": "Strengthening India’s Arbitration Regime: SC on Unsigned Arbitration Agreement",
    "description": "<p>The Supreme Court of India, in *Glencore International AG vs. Shree Ganesh Metals & Anr*, has ruled that the absence of a signature on an arbitration clause does not automatically invalidate it. The Court emphasized that the key factor is the demonstrable intention of the parties to submit disputes to arbitration, which can be evidenced through written communication, conduct, or other documentation. This decision reinforces the principle of party autonomy in arbitration, prioritizing substance over form and aligning India with global arbitration standards.</p>\n\n<p>The case stemmed from a commercial dispute where one party challenged the validity of an arbitration agreement due to the lack of formal signatures. While previous contracts between Glencore and Shree Ganesh Metals were signed, the contract in question was confirmed via email exchanges but not physically signed. The Supreme Court clarified that Section 7 of the Arbitration and Conciliation Act, 1996, requires an arbitration agreement to be \"in writing\" but does not mandate signatures for validity. The Court emphasized that the intention to arbitrate is the crucial element.</p>\n\n<p>The ruling has significant implications for India's arbitration regime. It provides reassurance to businesses and investors by clarifying that the clear intention of the parties to arbitrate, rather than the presence of a signature, is paramount. This decision diminishes the potential for technical objections based solely on missing signatures, enhancing certainty and reliability in commercial transactions. It reinforces confidence in arbitration as an efficient and business-friendly dispute resolution mechanism, solidifying India's pro-arbitration stance.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/sc-unsigned-arbitration-agreements-still-enforceable.jpg"
  },
  {
    "title": "Authority by Designation: NCLAT Clarifies Power of Attorney Execution in Indian Bank v. Aman Hospitality",
    "description": "<p>The National Company Law Appellate Tribunal (NCLAT) in *Indian Bank v. M/s Aman Hospitality Pvt. Ltd.* addressed the validity of a Power of Attorney (POA) executed by officers nominated by designation rather than by name. The case arose from the dismissal by the NCLT of Indian Bank's application to amend particulars of debt, due to concerns over the validity of the POA held by the Chief Manager filing the application.</p>\n\n<p>Indian Bank argued that its Board of Directors had established a Uniform Power of Attorney System, authorizing General Managers or a General Manager along with a Deputy/Assistant General Manager nominated by the CMD or Executive Director, to execute POAs on behalf of the Bank. The bank emphasized that delegation by designation is legally valid. Aman Hospitality contended that only individual nominations by name were sufficient.</p>\n\n<p>The NCLAT ruled in favor of Indian Bank, setting aside the NCLT's order. The Tribunal found that the Board resolution allowed for officer nomination, and designations provided sufficient certainty regarding authorized incumbents. Drawing from the Supreme Court's judgment in *United Bank of India v. Naresh Kumar*, the NCLAT cautioned against hyper-technical objections that could impede substantive justice. The matter was remanded back to the NCLT for reconsideration on its merits. The decision reinforces that substance prevails over form in corporate litigation, validating POAs executed by officers holding specified designations authorized by the Board.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/power-of-attorney-validity-clarified-by-nclat-in-2025-judgment.jpg"
  },
  {
    "title": "Delhi High Court Upholds Annulment Over Hidden Divorce and Inflated Income",
    "description": "<p>The Delhi High Court has affirmed that concealing a prior marriage and misrepresenting one's income on matrimonial platforms constitutes fraud, providing valid grounds for marriage annulment. The ruling in *Sameer Pareek vs. Shweta Pareek* (MAT.APP. (F.C.) 87/2024) emphasizes that consent obtained through such deception is neither free nor informed, undermining the marital contract's foundation.</p>\n\n<p>The case originated on “www.shaadi.com,” where Shweta Pareek relied on Sameer Pareek's profile, which falsely stated he was \"Never Married\" despite being a divorcee with a child and inflated his income from approximately $120K-$130K to \"USD 200K and above.\" Feeling deceived, she sought annulment under Section 12(1)(c) of the Hindu Marriage Act, 1955. The Family Court ruled in her favor, a decision Sameer Pareek appealed.</p>\n\n<p>Before the High Court, Sameer Pareek argued he disclosed his prior marriage orally, the petition was filed late, and his parents created the profile. Shweta Pareek countered that the misrepresentations were material and directly influenced her consent. The High Court dismissed the appellant's arguments, deeming the \"Never Married\" claim unambiguous and emphasizing the significance of suppressing a prior marriage and the existence of a child.</p>\n\n<p>Referencing *Anurag Anand v. Sunita Anand*, the court also recognized misrepresenting financial status as material fraud, given the importance of financial stability. The High Court concluded that Sameer Pareek engaged in fraud under Section 12(1)(c) of the Hindu Marriage Act, upholding the decree of nullity. The judgment serves as a warning against dishonesty on matrimonial websites and reinforces the need for complete transparency for free and informed consent.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/delhi-high-court-marriage-annulment-over-profile-fraud.jpg"
  },
  {
    "title": "Supreme Court Clarifies Landowners' Rights in Slum Rehabilitation",
    "description": "<p>The Supreme Court's ruling in *Tarabai Nagar Cooperative Housing Society v. State of Maharashtra* addresses the complex issue of slum redevelopment in Mumbai, specifically concerning the acquisition of slum-encroached land under the Maharashtra Slum Areas (Improvement, Clearance and Redevelopment) Act, 1971. The central question was whether landowners have a preferential right to redevelop slum-affected land before the State or Slum Rehabilitation Authority (SRA) can intervene.</p>\n\n<p>The case involved land owned by Indian Cork Mills Pvt. Ltd. (ICM), a portion of which was declared a slum area. While the Tarabai Nagar Cooperative Housing Society (representing slum dwellers) sought land acquisition for redevelopment, ICM asserted its right to redevelop the land independently. The State of Maharashtra issued an acquisition notification, prompting ICM to challenge the decision in the Bombay High Court, which ruled in favor of the landowner, granting them the initial opportunity to propose a redevelopment scheme.</p>\n\n<p>The Supreme Court upheld the Bombay High Court's decision, affirming that landowners possess a primary and preferential right to redevelop land designated as a Slum Rehabilitation Area. The SRA is obligated to notify the landowner, inviting them to submit a redevelopment proposal before the State can proceed with acquisition. This ruling ensures procedural fairness, safeguards property rights, and necessitates that the government provide landowners a fair opportunity to redevelop before resorting to compulsory acquisition. However, the court also acknowledged the rights of slum dwellers to initiate redevelopment if landowners fail to act within a reasonable timeframe. This decision clarifies the roles of landowners and the SRA, impacting future slum rehabilitation projects in Maharashtra by promoting transparency, reducing disputes, and ensuring a balance between private property rights and social welfare.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/supreme-court-upholds-landowners-in-slum-rehabilitation.jpg"
  },
  {
    "title": "Understanding the Aadhaar (Sharing of Information) Amendment Regulations, 2025",
    "description": "<p>The Unique Identification Authority of India (UIDAI) has implemented the Aadhaar (Sharing of Information) First Amendment Regulations, 2025, effective August 22, 2025. This amendment modifies the sharing of Aadhaar numbers for young children and clarifies compliance obligations for entities dealing with deactivated Aadhaar numbers.</p>\n\n<p>Rooted in the Aadhaar Act, 2016, the regulatory framework empowers UIDAI to govern all aspects of the Aadhaar ecosystem. These amendments align with the Digital Personal Data Protection Act, 2023 (DPDP Act) which emphasizes consent, purpose limitation, data minimization, and accountability in personal data processing. The 2025 amendments aim to integrate Aadhaar with civil registration records (births and deaths) while adhering to evolving data protection standards.</p>\n\n<p>Key changes include a new provision in Regulation 3 enabling UIDAI to share the Aadhaar number of a child under five (issued based on a birth certificate without biometrics) with the Registrar General of India or the State Chief Registrar with explicit consent. Additionally, an amendment to Regulation 5 clarifies that responsibilities imposed on entities handling Aadhaar numbers do not apply when the Aadhaar has been deactivated due to the holder's death.</p>\n\n<p>In conclusion, the Aadhaar (Sharing of Information) First Amendment Regulations, 2025, represent a significant stride towards enhancing Aadhaar record accuracy and defining responsibilities for entities managing Aadhaar data. The introduction of consent requirements for sharing child Aadhaar data and the exemption for deactivated Aadhaar numbers demonstrate a regulatory evolution that integrates Aadhaar with civil registries while aligning with broader data protection principles.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/aadhaar-sharing-of-information-amendment-2025.jpg"
  },
  {
    "title": "No Public View, No Offence: Telangana HC Clarifies Limits of SC/ST Act in Marital Disputes",
    "description": "<p>The Telangana High Court, in *Smt. K. Swathi v. The State of Telangana & Another*, clarified the scope of the Scheduled Castes and Scheduled Tribes (Prevention of Atrocities) Act, 1989. The court ruled that caste-based insults exchanged privately between spouses do not constitute an offense under the Act unless made in \"public view.\" Justice E.V. Venugopal emphasized that the humiliation must be public, exposing the victim to social disgrace, to be considered an atrocity under the law.</p>\n\n<p>The case originated from a marital dispute involving an inter-caste marriage. The husband, a member of a Scheduled Caste, alleged that his wife subjected him to caste-based slurs and harassment after their separation. The court, however, quashed the proceedings, citing the lack of public view and a significant delay in filing the complaint, which raised questions on the credibility of the accusations.</p>\n\n<p>The ruling aligns with established judicial precedents, including *Hitesh Verma v. State of Uttarakhand*, which emphasize that the SC/ST Act is intended to address systemic and public humiliation, not private quarrels. The Telangana High Court's decision reinforces the importance of the \"public view\" requirement and prevents the misuse of the Act in personal disputes, ensuring it serves its intended purpose of protecting SC/ST communities from public discrimination.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/telangana-hc-sc-st-act-not-for-private-marital-dispute.jpg"
  },
  {
    "title": "Lakshadweep Administration Notifies Welfare Measures for Transgender Persons",
    "description": "<p>On July 29, 2025, the Lakshadweep Administration issued a notification to implement welfare measures for transgender individuals within the Union Territory. This action aligns with the Transgender Persons (Protection of Rights) Act, 2019, and adheres to directives from the Ministry of Social Justice & Empowerment (MSJE) and the Ministry of Home Affairs.</p>\n\n<p>The notification follows landmark Supreme Court rulings, including *National Legal Services Authority v. Union of India* (2014) recognizing transgender persons as a \"third gender\" with the right to self-identify, and *Navtej Singh Johar v. Union of India* (2018) decriminalizing consensual same-sex relations. These decisions established a constitutional framework promoting dignity, autonomy, and equality. The 2019 Act further prohibits discrimination against transgender persons in key areas like education, employment, and healthcare, while mandating the creation of support systems at the state and UT level.</p>\n\n<p>Between 2023 and 2025, the MSJE and Ministry of Home Affairs issued directives urging all States and Union Territories to implement the Act. The Lakshadweep Administration's notification directly responds to these central directives by designating a Nodal Officer and implementing welfare provisions, ensuring institutional preparedness even in the absence of formally identified transgender residents. This proactive measure aligns the Union Territory with the national framework for inclusion, guaranteeing immediate access to support mechanisms as needed. The initiative signifies a crucial advancement in extending constitutional rights and welfare protections to transgender persons, reflecting India's dedication to inclusive governance, dignity, and equality for all citizens.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/lakshadweep-notification-on-transgender-welfare-measures.jpg"
  },
  {
    "title": "Supreme Court Mandates Replenishment Studies for Valid District Survey Reports in Sand Mining",
    "description": "<p>In a landmark judgment, the Supreme Court of India has ruled that a District Survey Report (DSR) lacking a proper replenishment study is legally invalid for granting environmental clearances for sand mining activities. This decision, stemming from the case of *Union Territory of Jammu and Kashmir & Ors. v. Raja Muzaffar Bhat & Ors.*, emphasizes scientific assessment and environmental sustainability over administrative expediency.</p>\n\n<p>The case originated from proposed sand mining activities for a road construction project in Jammu and Kashmir. An environmental activist challenged the environmental clearance granted based on a DSR that was initially rejected due to over-exploitation and lack of replenishment data. Despite the initial rejection, the project was later approved even though the DSR remained deficient.</p>\n\n<p>The National Green Tribunal (NGT) overturned the environmental clearance, asserting that no legal provision allows for dispensing with DSR and replenishment study requirements, regardless of mining depth. The Supreme Court upheld the NGT's decision, emphasizing that a DSR is only valid when supported by a proper replenishment study. The court highlighted the detrimental impacts of mining on river ecosystems and the necessity of understanding replenishment rates to ensure sustainable mining limits.</p>\n\n<p>The Supreme Court underscored that DSR preparation is mandatory and that replenishment studies are an integral part of valid DSRs. The court criticized the regulatory authorities for compromising environmental integrity by granting clearance based on a deficient DSR. This decision sets a strong precedent, ensuring that environmental guidelines are strictly followed and that environmental protection is not sacrificed for administrative ease.</p>\n\n<p>The judgment reinforces the precautionary principle, requiring scientific rigor in environmental decision-making, and strengthens administrative accountability. By mandating replenishment studies, the court aims to protect riverine ecosystems from over-exploitation and promote sustainable development, setting a precedent that will guide future environmental clearance decisions in India.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/sc-dsr-replenishment-study-mandatory-for-sand-mining.jpg"
  },
  {
    "title": "What Happens When an Employee Dies in Harness? Rights under Employees Compensation Act, 1923",
    "description": "<p>The death of an employee during employment is a significant event with both human and legal dimensions. The Employees Compensation Act, 1923 (EC Act) in India, aims to provide financial support to the dependents of a deceased employee, irrespective of their employment status (permanent, probationary, or trainee). This legislation underscores the importance of worker and family security within labor welfare laws.</p>\n\n<p>Under the EC Act, the term \"employee\" is broadly defined to include trainees and probationers. This ensures that compensation and benefits are applicable regardless of whether the deceased was a confirmed employee, probationer, or trainee.</p>\n\n<p>The Act mandates statutory compensation to the dependents of a deceased employee. The compensation amount is calculated based on a formula involving the employee's monthly wages and a relevant factor determined by age, as specified in Schedule IV.  Additionally, the employer is required to deposit a fixed sum towards funeral expenses. Failure to deposit the compensation within 30 days can result in penalties and interest charges.</p>\n\n<p>The EC Act establishes a clear procedure for disbursing compensation to legally recognized dependents, safeguarding against private settlements and disputes. Employers are obligated to promptly notify the Commissioner of Employee’s Compensation, conduct an internal inquiry, preserve records and evidence, and facilitate the claim process. Non-compliance can lead to legal repercussions.</p>\n\n<p>In conclusion, the EC Act is a crucial social welfare law designed to protect the dependents of employees who die during employment, ensuring they are not left financially insecure. The Act protects all employees and requires employers to adhere to statutory timelines and procedures, balancing compassion with accountability.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/compensation-for-employee-death-under-ec-act-1923.jpg"
  },
  {
    "title": "RBI Issues Draft Circular on Counterparty Credit Risk and Potential Future Exposure",
    "description": "<p>On August 20, 2025, the Reserve Bank of India (RBI) released a draft circular addressing Counterparty Credit Risk (CCR) and Potential Future Exposure (PFE), inviting public comments until September 10, 2025. This revision updates the existing framework outlined in the Master Circular on Basel III Capital Regulations, aiming to align domestic capital adequacy rules with international standards set by the Basel Committee on Banking Supervision (BCBS) while adapting to the evolving Indian derivatives market.</p>\n\n<p>The draft circular focuses on the Current Exposure Method (CEM) for calculating PFE, a key component of the Basel III framework designed to ensure adequate capital coverage against counterparty defaults in financial contracts. The RBI's actions are grounded in its statutory powers derived from the Banking Regulation Act, 1949, and the Reserve Bank of India Act, 1934.</p>\n\n<p>Key implications for banks include the potential need to hold additional capital against CCR, particularly for those acting as clearing members of SEBI-recognized exchanges. While this may impact short-term profitability, it is intended to bolster the stability of the banking system. The alignment with BCBS guidelines will enhance the credibility and competitiveness of Indian banks in cross-border transactions and reduce regulatory arbitrage.</p>\n\n<p>In conclusion, the draft circular signifies a crucial regulatory update in India's prudential capital framework. By clarifying obligations and revising add-on factors to align with Basel III, the RBI aims to maintain financial stability, ensure international consistency, and address emerging risks in the derivatives market. Banks and market participants are urged to assess the draft's impact and provide feedback during the consultation period.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/rbi-draft-on-counterparty-credit-risk-basel-iii-alignment.jpg"
  },
  {
    "title": "Rajasthan High Court Reinforces Citizens' Right to Safe Roads: No Place for Illegal Occupations",
    "description": "<p>The Rajasthan High Court addressed the persistent issue of encroachments on public roads and pedestrian pathways in the case of *Vijay Kumar Boyat & Ors. Versus Vaibhav Galriya*. Recognizing the widespread nature of the problem and the failure of previous directives, the Court revived a pending Public Interest Litigation (PIL) filed in 2022 and issued stringent new directions to identify, remove, and prevent illegal encroachments statewide. The court emphasized that public spaces belong to the community and cannot be usurped for private interests.</p>\n\n<p>The case originated from a PIL highlighting encroachments obstructing traffic and endangering pedestrians in Jaipur. Despite earlier court orders to remove these obstructions, inaction prompted a civil contempt petition. The Court clarified that contempt proceedings are exclusive to the Court and the directed parties, dismissing attempts to include additional contemnors. Subsequently, the court reactivated the original PIL to ensure effective action against encroachments.</p>\n\n<p>The High Court stressed that encroachments, which often evolve from temporary stalls into permanent structures, threaten public safety and erode urban infrastructure efficiency. The Court stated that no local authority or court order could legitimize these illegal occupations. It reinforced that public interest supersedes private encroachment, and roads and pedestrian pathways must remain unobstructed. The Court mandated that encroachment assessments must align with Master Plans and Zonal Development Plans to prevent arbitrary enforcement. Drawing support from the Supreme Court’s decision in *In Re: Manoj Tibrewal Akash*, the bench highlighted the urgent need to remove unauthorized structures from public spaces to safeguard civic infrastructure and public rights.</p>\n\n<p>The judgment underscores the broader challenge of managing urban growth while protecting public spaces, exposing systemic weaknesses in enforcement, monitoring, and potential collusion between authorities and violators. The Court's statewide directives indicate a need for a uniform and accountable enforcement mechanism to protect public land, reinforcing that sustainable urban development requires consistent enforcement of planning laws and zero tolerance for encroachments.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/rajasthan-hc-orders-statewide-crackdown-on-road-encroachments.jpg"
  },
  {
    "title": "Telangana Government Exempts Persons with Disabilities from Routine Transfers and Postings",
    "description": "<p>The Government of Telangana has issued G.O.Ms. No. 34, effective August 7, 2025, exempting government employees with disabilities and caregivers of dependents with disabilities from routine transfers and postings. This order operationalizes safeguards outlined in the Rights of Persons with Disabilities Act, 2016 (RPwD Act).</p>\n\n<p>The RPwD Act, 2016, aligns with the UN Convention on the Rights of Persons with Disabilities (UNCRPD), emphasizing equality of opportunity, non-discrimination, and reasonable accommodation. While Section 20(5) of the RPwD Act primarily focuses on job security, courts have interpreted it to include protection from arbitrary transfers. The Telangana order institutionalizes this principle by providing a policy-level exemption.</p>\n\n<p>The order, issued by the Department for Women, Children, Disabled and Senior Citizens, and with the concurrence of the Finance (HRM.I) Department, is binding on all state government departments. This initiative aligns with judicial precedents and policy directions emphasizing equal treatment and reasonable accommodation in employment for persons with disabilities. The Telangana order goes further by extending the exemption to caregivers, recognizing the potential for indirect discrimination. This progressive move strengthens workplace inclusivity, ensures stability for employees, and furthers the objectives of the RPwD Act, 2016.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/telangana-grants-exemption-from-routine-transfers-to-pwds.jpg"
  },
  {
    "title": "Aadhaar Not Mandatory: Labour Ministry Clarifies Authentication Rules for ESIC Beneficiaries",
    "description": "<p>On August 19, 2025, the Ministry of Labour and Employment issued Notification S.O. 3792(E) authorizing the Employees’ State Insurance Corporation (ESIC) to use Aadhaar authentication for identifying beneficiaries, superseding the notification dated January 13, 2023. The authorization aligns with the Aadhaar Act, 2016, and the Aadhaar Authentication for Good Governance Rules, 2020, with prior approval from MeitY and UIDAI.</p>\n\n<p>The notification aims to enhance transparency, prevent benefit leakage, and improve governance within the ESI scheme. While it allows ESIC to use Aadhaar for authentication, it emphasizes that such authentication is voluntary and requires explicit consent from the Aadhaar holder. Alternative identification methods, including Passport, PAN card, and Driving License, must be accepted, ensuring no beneficiary is denied benefits for not possessing or choosing not to use Aadhaar.</p>\n\n<p>This update balances digital governance with individual rights, adhering to Supreme Court directives on Aadhaar's usage. Employers and beneficiaries should be aware that while Aadhaar can streamline processes, it is not a mandatory requirement for accessing ESI benefits. ESIC is obligated to inform beneficiaries of alternative identification options.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/aadhaar-authentication-for-esic-clarified-as-voluntary.jpg"
  },
  {
    "title": "RPs Declared ‘Public Servants’: High Court Ruling Boosts Accountability in IBC",
    "description": "<p>The Madras High Court, in the case of Anil Kumar Ojha v. The State & Others, has ruled that Resolution Professionals (RPs) appointed under the Insolvency and Bankruptcy Code (IBC) qualify as \"public servants\" under Section 2(c) of the Prevention of Corruption Act, 1988. This decision resolves conflicting views among High Courts and has far-reaching implications for accountability within the insolvency ecosystem.</p>\n\n<p>The central legal issue before the court was whether an RP, appointed by the National Company Law Tribunal (NCLT), falls within the definition of a \"public servant\" due to their functions in managing debtor affairs, preserving assets, collating claims, and submitting reports to the NCLT, therefore performing duties connected with the administration of justice. The court emphasized the administrative and supervisory nature of an RP's duties, highlighting their centrality to the integrity of the insolvency process.</p>\n\n<p>The ruling clarifies the legal status of RPs, subjecting them to the anti-corruption framework of the Prevention of Corruption Act and requiring sanction for prosecution. This enhances the accountability framework for insolvency proceedings, prevents investigations into financial misconduct from being stalled, and strengthens the integrity of the insolvency system to better protect the interests of creditors. While awaiting a potential Supreme Court review, the judgment provides a vital check on the powers of RPs.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/madras-hc-resolution-professionals-are-public-servants.jpg"
  },
  {
    "title": "Finality Of Orders Vs. Master Plans: Allahabad Hc Draws Line On Ghaziabad Development Authority’s Powers",
    "description": "<p>The Allahabad High Court, in *Pheasant Infrastructure Private. Limited. v. State of U.P. & Others*, ruled that subordinate authorities cannot revisit a matter based on fresh grounds once an appellate authority's order has achieved finality. The case involved Pheasant Infrastructure's sanctioned group housing map in Ghaziabad, which the Ghaziabad Development Authority (GDA) initially cancelled and later refused to release, citing the Master Plan 2021 despite the project's 2006 sanction date.</p>\n\n<p>The court emphasized that the Commissioner's order setting aside the cancellation revived the original sanction, making reliance on the subsequent Master Plan impermissible. The court noted the original cancellation was uncommunicated, and thus legally ineffective. Furthermore, the court deemed that the GDA could not supplement its reasons for rejection in a counter affidavit, especially since they admitted the developer's compliance with the original sanction conditions. The court also cited the principle of parity, as another developer was granted approval under similar circumstances.</p>\n\n<p>The High Court quashed the GDA's orders and mandated the release of the sanctioned map within four weeks, asserting that final appellate orders must be respected. This ruling reinforces that vested rights, established through valid sanctions and completed formalities, are protected against retrospective application of master plans, thus promoting fairness and predictability in urban development.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/allahabad-hc-gda-cant-deny-sanction-citing-master-plan-2021.jpg"
  },
  {
    "title": "Judicial Intervention in Corporate Affairs: High Court Clarifies Scope of Interim Injunctions",
    "description": "<p>The Delhi High Court has delivered a significant judgment clarifying the limitations of judicial intervention in a company’s internal affairs, specifically regarding the granting of interim injunctions. The court set aside an interim injunction that had prevented Drharors Aesthetics Private Ltd. from convening board and general meetings to consider the removal of two directors. This decision underscores the principle that courts should avoid unduly interfering with a company's statutory right to manage its own affairs.</p>\n\n<p>The dispute originated from a business relationship between Drharors Aesthetics Private Ltd. and two former directors, Debulal Banerjee and Rahul Shawel. The respondents alleged denial of access to official email, withheld salaries, and short notice for board meetings concerning their removal, without sufficient supporting documentation. They claimed violations of Section 173(3) of the Companies Act, 2013, regarding adequate meeting notice. The Appellant Company countered that the proposed removal was necessary due to financial irregularities, breach of fiduciary duties, and acts of sabotage by the Respondents.</p>\n\n<p>The High Court's decision was based on a rejection of the District Judge’s rationale and an affirmation of established corporate law principles. The court found that the interim injunction was legally flawed as it stalled a lawful statutory process and disrupted the company’s corporate governance. The court directed the parties to pursue their remedies through arbitration or under the Companies Act, 2013, if necessary.</p>\n\n<p>In conclusion, the Delhi High Court's judgment sets a precedent against judicial overreach into a company’s internal affairs. By overturning the interim injunction, the court affirmed that the right to hold statutory meetings for the removal of directors is a fundamental aspect of corporate governance. The ruling clarifies that equitable relief is intended to preserve the subject matter of a dispute, not to paralyze a company’s operations or pre-emptively halt a lawful statutory process.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/delhi-hc-on-corporate-governance-limits-on-interim-relief.jpg"
  },
  {
    "title": "Supreme Court Upholds Sanctity of Arbitration, Bars Non-Signatories from Confidential Proceedings",
    "description": "<p>The Supreme Court of India, in *Kamal Gupta vs M/s. L.R. Builders Private Limited*, ruled that arbitration proceedings are strictly limited to signatories of the arbitration agreement. This decision reinforces party autonomy and confidentiality, asserting that non-signatories, even those with potentially affected interests, lack the right to attend arbitration proceedings. This ruling overturned Delhi High Court orders that had permitted non-signatories to attend proceedings after initially denying their request.</p>\n\n<p>The case stemmed from a family settlement, formalized in a Memorandum of Understanding (MoU), containing an arbitration clause. Non-signatories to the MoU sought permission to attend the arbitration proceedings, which was initially dismissed by the Delhi High Court. However, the High Court later allowed their attendance, a decision challenged by the signatories in the Supreme Court.</p>\n\n<p>The Supreme Court clarified that while doctrines might bind non-signatories in certain circumstances, being bound by an arbitral award does not automatically grant the right to participate in the proceedings. The Court emphasized arbitration as a consensual process, with participation rights limited to signatories. Allowing non-signatories would violate the confidentiality mandated by Section 42A of the Arbitration & Conciliation Act, 1996, which requires the arbitrator, arbitral institution, and parties to maintain confidentiality.</p>\n\n<p>The Court stated that non-signatories have limited remedies, primarily the ability to challenge the enforcement of an arbitral award against them under Section 36. Once an arbitrator is appointed under Section 11(6), the High Court loses jurisdiction, and subsequent applications from non-signatories constitute judicial overreach. This decision reinforces arbitration as a self-contained, party-driven process with minimal judicial intervention. In conclusion, the Supreme Court’s ruling reinforces that arbitration in India is a private, consensual, and confidential dispute resolution mechanism, strictly reserved for signatories. The Court imposed costs of ₹3,00,000 on the respondents (non-signatories), payable to the Supreme Court Advocates-on-Record Association within two weeks.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/supreme-court-on-confidentiality-in-arbitration-in-india.jpg"
  },
  {
    "title": "IBBI Continuing Professional Education Guidelines 2025: Enhancing Professional Excellence for Insolvency Professionals",
    "description": "<p>The Insolvency and Bankruptcy Board of India (IBBI) issued the Continuing Professional Education (CPE) Guidelines (Amendment) 2025 on August 13, 2025, updating the professional development framework for Insolvency Professionals (IPs). This amendment introduces mandatory in-person learning requirements and revises the CPE credit structure, reinforcing the objective of ensuring professional competence in insolvency practice under the Insolvency and Bankruptcy Code, 2016 (IBC).</p>\n\n<p>The IBC provides the legal framework for insolvency resolution. Section 196 empowers the IBBI to regulate IPs, Insolvency Professional Agencies (IPAs), and Information Utilities. This authorization allows the IBBI to set codes of conduct, professional standards, and continuous education requirements for IPs, ensuring their competence in statutory functions such as acting as Resolution Professionals (RPs), Liquidators, and Insolvency Professional Entities (IPEs). The 2025 amendment builds upon the original 2019 CPE Guidelines by introducing structured in-person learning and additional compliance requirements.</p>\n\n<p>The CPE Guidelines Amendment 2025 strengthens the regulatory framework for IPs in India. By mandating structured in-person learning and expanding the scope of relevant subjects, the amendment ensures that insolvency professionals remain equipped to handle the complexities of corporate and personal insolvency, thereby supporting the effective implementation of the IBC.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/ibbi-issues-updated-cpe-guidelines-2025-for-ips.jpg"
  },
  {
    "title": "IFSCA Clarifies Opening of Foreign Currency Accounts by Indian Residents in IFSCs",
    "description": "<p>On August 13, 2025, the International Financial Services Centres Authority (IFSCA) released a circular clarifying that Indian residents can now open and maintain foreign currency accounts with International Banking Units (IBUs) in International Financial Services Centres (IFSCs) without needing prior approval. This update harmonizes regulations with India's Foreign Exchange Management Act (FEMA) and related regulations, facilitating easier access to offshore-equivalent banking services within India.</p>\n\n<p>This clarification is a strategically important move for India's financial system. By allowing residents to hold foreign currency accounts in IBUs within IFSCs, the IFSCA effectively brings offshore banking capabilities into Indian jurisdiction. This provides exporters, corporations, and individuals with simpler access to foreign currency management tools, reinforcing GIFT City's position as a competitive global financial hub.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/ifsca-allows-foreign-currency-accounts-in-ifscs.jpg"
  },
  {
    "title": "Strengthening Investor Protection: SEBI’s Master Circular on Debenture Trustees (2025)",
    "description": "<p>On August 13, 2025, the Securities and Exchange Board of India (SEBI) released a Master Circular for Debenture Trustees (DTs), consolidating and updating the regulatory framework governing them. This circular replaces numerous prior circulars with a single, comprehensive document, streamlining compliance and reinforcing investor protection within India's debt markets.</p>\n\n<p>Debenture Trustees, appointed under the SEBI (Debenture Trustees) Regulations, 1993, safeguard the interests of debenture holders. They serve as fiduciaries, ensuring issuers adhere to debenture terms, trust deeds, and relevant SEBI regulations. This Master Circular compiles existing directives into a unified resource for DTs, issuers, and investors. Key areas covered include trustee obligations, compliance requirements, and standardised procedures.</p>\n\n<p>Effective immediately from August 13, 2025, the Master Circular supersedes all previous SEBI circulars on the subject. It represents SEBI's commitment to strengthening India's corporate bond market by standardising trustee responsibilities and consolidating compliance requirements. This initiative enhances regulatory clarity and standardization, ultimately bolstering investor protection and corporate debt governance. Corporate entities should review existing debenture structures, compliance frameworks, and trustee arrangements to align with the new guidelines.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/sebi-issues-master-circular-for-debenture-trustees-2025.jpg"
  },
  {
    "title": "India’s First Digital Connectivity Rating System for Properties Unveiled by TRAI",
    "description": "<p>On August 13, 2025, the Telecom Regulatory Authority of India (TRAI) launched the Manual for Assessment of Digital Connectivity in Properties, operationalizing the Rating of Properties for Digital Connectivity Regulations, 2024. This framework marks the first national effort to evaluate digital infrastructure quality in residential, commercial, and institutional properties, addressing a significant gap in India’s connectivity ecosystem. The move aims to ensure indoor digital experiences align with increasing reliance on online services.</p>\n\n<p>The manual, issued under Section 36 of the TRAI Act, establishes uniform parameters for assessing a property's digital connectivity readiness and performance. These parameters result in a digital connectivity rating, similar to energy efficiency ratings, empowering buyers and tenants to make informed decisions. This transparent and standardized rating system reinforces consumers' right to information, aligning with the Consumer Protection Act, 2019, and the Real Estate (Regulation and Development) Act, 2016 (RERA).</p>\n\n<p>The framework implicitly acknowledges digital connectivity as essential infrastructure, building on the National Digital Communications Policy, 2018, and judicial recognition of internet access as a fundamental right. It provides state governments and municipal authorities with a legal instrument to integrate digital connectivity standards into regulatory processes, including Building Codes and Development Control Regulations.</p>\n\n<p>The framework's non-binding nature and potential cost implications pose challenges. The system will require regular updates to remain relevant amid rapid advancements in network technology. Despite these challenges, TRAI's manual represents a pioneering step towards a structured and legally supported approach to digital connectivity assessment. Integration into real estate regulation, consumer protection frameworks, and urban planning codes could significantly influence buyer behavior, developer practices, and state-level legislative amendments, furthering India's goal of universal digital access.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/trai-launches-indias-first-digital-connectivity-rating.jpg"
  },
  {
    "title": "Modernizing India’s Maritime Sector: The Coastal Shipping Act, 2025",
    "description": "<p>The Coastal Shipping Act, 2025, passed by the Indian Parliament and assented to on August 9, 2025, marks a significant legislative reform for India's maritime sector. Replacing Part XIV of the Merchant Shipping Act, 1958, this Act aims to consolidate and amend laws governing coastal shipping, promote domestic participation, and ensure a nationally owned and operated coastal fleet for security and commercial needs, aligning India with global standards. It is designed to unlock the potential of India’s 11,098 km coastline and support the “Viksit Bharat” and “Aatmanirbhar Bharat” initiatives.</p>\n\n<p>The Act is a strategic enabler for economic growth, employment, and logistics efficiency, with a goal to increase coastal cargo share to 230 million metric tonnes by 2030. It simplifies the legal framework, reduces regulatory burdens, and enhances the competitiveness of Indian vessels, minimizing dependence on foreign vessels and bolstering supply-chain security.</p>\n\n<p>Key provisions include Chapter II, which regulates coasting trade through a licensing system administered by the Director-General, considering factors such as applicant history, crew nationality, and national security. Chapter III mandates the creation of a National Coastal and Inland Shipping Strategic Plan and a publicly accessible National Database for Coastal Shipping. Chapter IV governs the licensing of chartered vessels operated by Indian citizens or entities. Chapter V outlines penalties for offenses, including imprisonment and fines for operating without a license or providing false information. Chapter VI grants the Central Government authority to issue policy directions and create implementing rules, and it repeals Part XIV of the Merchant Shipping Act, 1958, with a savings clause to ensure a smooth transition.</p>\n\n<p>The Coastal Shipping Act, 2025, is a decisive step towards a modern, efficient, and self-reliant maritime ecosystem, enhancing supply chain resilience and driving economic growth. This legislation is part of a comprehensive package including the Merchant Shipping Bill, 2025, and the Carriage of Goods by Sea Bill, 2025, demonstrating a commitment to transforming India into a global maritime hub. The focus now shifts to the practical implementation of these reforms, guided by the National Coastal and Inland Shipping Strategic Plan.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/modernizing-indias-maritime-sector-the-coastal-shipping-act-2025.jpg"
  },
  {
    "title": "Supreme Court Upholds Insurer Liability in Incomplete Vehicle Transfer Case",
    "description": "<p>The Supreme Court of India overturned a High Court decision, reaffirming an insurance company's liability for compensation awarded by the Motor Accidents Claims Tribunal (MACT) following a motor vehicle accident. The case centered on a dispute between the insurer, seeking to avoid liability, and the driver/ostensible owner of the vehicle, with key issues including the status of the injured parties as gratuitous passengers and the legal transfer of vehicle ownership.</p>\n\n<p>The insurance company argued that the injured were gratuitous passengers and that the vehicle ownership had been transferred to the driver, thus voiding their obligation. The Supreme Court rejected both arguments. It determined that the injured, petty hawkers carrying goods, were not gratuitous passengers under Section 147(1)(b)(i) of the Motor Vehicle Act, 1988, and were therefore covered under the policy. Furthermore, the Court found that the vehicle's ownership transfer was incomplete as a final payment was pending and the transfer of registration had not occurred as per Section 50 of the Motor Vehicle Act, 1988.</p>\n\n<p>The Supreme Court emphasized a purposive interpretation of the Motor Vehicle Act, 1988, to protect accident victims. The ruling reinforced the principle that the registered owner remains liable for compensating accident victims, and this liability must be indemnified by the insurer. The Court allowed the appeals, directing the insurer to satisfy the compensation awards as originally determined by the MACT, highlighting a victim-centric approach to motor accident claims.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/financial-vs-operational-leases-under-ibc-2016.jpg"
  },
  {
    "title": "Born Abroad, Raised in India: Legal Protection for Children of Indian Citizens in Transnational Families",
    "description": "<p>The Rajasthan High Court addressed the complex legal issues surrounding a child born abroad to Indian parents in *Seher Gogia v. FRRO & Ors.* The case involved a five-year-old Australian citizen, Seher Gogia, whose visa extension was jeopardized due to a matrimonial dispute between her Indian parents. This situation placed her at risk of being declared an illegal migrant, despite both parents being Indian citizens.</p>\n\n<p>The court emphasized that the child's best interests are the paramount consideration and referenced the UN Convention on the Rights of the Child (UNCRC). It held that Seher could not be deported solely because her mother refused to provide a No Objection Certificate (NOC) for the visa extension, particularly as the child resided with her father and no custody order favored the mother. The Foreigners Regional Registration Officer (FRRO) was directed to extend the visa without the mother's NOC.</p>\n\n<p>While Seher had not applied for an Overseas Citizenship of India (OCI) card, the court noted that children born abroad to Indian citizens could acquire Indian citizenship by descent under Section 4 of the Citizenship Act, 1955. The court directed the Ministry of Home Affairs (MHA) to revisit Indian laws and policies to address transnational child citizenship issues, advocating for harmonization with international child rights norms and a flexible approach in cases involving minor children of Indian citizens.</p>\n\n<p>The judgment reaffirms child-centric justice in immigration matters, protecting children from becoming collateral damage in marital disputes or victims of administrative rigidity. It bridges the gap between citizenship law, immigration regulation, and constitutional rights, applying a humanitarian and rights-based approach. The case sets a precedent for flexible, welfare-first solutions in cross-border family situations and demonstrates the importance of aligning domestic law with international conventions to protect vulnerable children.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/born-abroad-raised-in-india-transnational-child-citizenship-law.jpg"
  }
]