[
  {
    "title": "Simplifying Green Clearances in Goa: Self-Declarations, Empaneled Inspectors and Perpetual Renewals under Water-Air-Environment Acts",
    "description": "<p>The Goa State Pollution Control Board (GSPCB) issued Circular No. 8/25/2025-PCB/Tech/7452 on July 1, 2025, to streamline environmental clearances for small and medium enterprises in Goa. The circular leverages the Water Act (1974), Air Act (1981), and Environment Act (1986) to introduce a graduated compliance system, utilizing self-certification for smaller units, third-party certification for larger operations, and automatic three-year renewals. The aim is to reduce delays and costs while maintaining environmental standards through targeted oversight.</p>\n\n<p>The circular differentiates regulatory oversight based on capital investment, using ₹50 lakh as the threshold. Businesses investing less than this amount can obtain Consent to Establish (CTE) and Consent to Operate (CTO) through an online application and self-certification, eliminating physical inspections. Larger projects must use accredited environmental auditors for their applications.</p>\n\n<p>Irrespective of capital investment, CTEs can be auto-renewed for three-year terms with a simple online requisition. CTOs also benefit from automatic three-year extensions, with smaller units using self-certification and larger ones submitting third-party inspection reports. These auto-renewals are withheld from units facing closure orders or ongoing litigation, ensuring accountability. The reforms aim to strike a balance between promoting ease of doing business and maintaining environmental accountability.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/goa-simplifies-green-clearances.jpg"
  },
  {
    "title": "Streamlining Insolvency Administration: The Final Demise of Form IP-1 and the New Assignment-Module Regime",
    "description": "<p>On July 14, 2025, the Insolvency and Bankruptcy Board of India (IBBI) officially withdrew Form IP-1, a mandatory filing for Insolvency Professionals (IPs) accepting assignments under the Insolvency and Bankruptcy Code, 2016. This action, formalized through Circular No. IBBI/CIRP/86/2025, is part of a broader digital transformation initiated with the Assignment Module in February 2025 and the introduction of forms CP-1 to CP-5 in May 2025, marking a shift towards dynamic, portal-driven governance.</p>\n\n<p>Form IP-1, introduced in August 2019, served as a reporting mechanism for IPs accepting various roles under the Code. Its purpose was to enable the IBBI to monitor assignments, detect conflicts of interest, prevent forum shopping, and gain a comprehensive view of the insolvency ecosystem.</p>\n\n<p>However, the static nature of Form IP-1 proved insufficient for the fast-paced environment of insolvency proceedings. The Assignment Module, mandated in February 2025, provided a real-time reporting system for IP appointments, resignations, and replacements. This Module functions as a dynamic ledger, timestamping events, triggering compliance alerts, and interfacing with other modules.  The Assignment Module applies to all types of insolvency proceedings ensuring comprehensive oversight.</p>\n\n<p>The introduction of forms CP-1 through CP-5 in May 2025 further streamlined the process by replacing both the previous CIRP Forms 1-8 and Form IP-1.  These new forms, integrated within the same portal as the Assignment Module, provide the IBBI with end-to-end visibility throughout the entire insolvency process.</p>\n\n<p>This transition establishes a two-tiered reporting system: the Assignment Module for real-time updates and forms CP-1 to CP-5 for detailed information. By consolidating multiple filings into an integrated workflow, the IBBI has reduced redundancy and simplified compliance without compromising disclosure. The withdrawal of Form IP-1 signals the IBBI's emphasis on technology as a key component in achieving the Code's objectives, setting a precedent for other regulators.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/ibbi-replaces-form-ip-1-with-new-assignment-module.jpg"
  },
  {
    "title": "India Progresses Towards Enforcing Data Protection Law After MeitY Completes Review of Public Feedback",
    "description": "<p>The Ministry of Electronics and Information Technology (MeitY) announced on July 28, 2025, that it has completed the public consultation process for the draft rules under the Digital Personal Data Protection Act, 2023 (DPDP Act). This signals India's transition towards enforcing data privacy and cybersecurity governance. MeitY received 6,915 responses from various stakeholders and is now finalizing the regulatory framework to implement the law.</p>\n\n<p>The DPDP Act, enacted in August 2023, provides the framework for lawful processing of digital personal data. MeitY is developing standardized formats for privacy notices, consent mechanisms, and breach reporting, and preparing to establish the Data Protection Board of India. Additionally, MeitY is developing a National Cybersecurity Strategy to enhance cyber resilience and strengthen institutions like CERT-In and NCIIPC. Public awareness initiatives, including tools like Cyber Swachhta Kendra (CSK) and the website www.safeonline.in, are also being promoted. Until the DPDP Act is notified, the Information Technology Rules, 2011, will continue to govern data security obligations.</p>\n\n<p>This update marks a crucial point for compliance in India, urging businesses in sectors like e-commerce, finance, healthcare, and social media to prioritize internal readiness, especially those involved in profiling or cross-border data processing. The impending enforcement requires entities handling digital personal data to align with the new requirements, including reviewing data flows, updating privacy policies, implementing breach response protocols, and ensuring board-level oversight of data governance. MeitY's update signifies the move from legislative intent to enforceable statute, demanding swift action from businesses to comply with the upcoming ecosystem.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/india-rollout-of-data-protection-law.jpg"
  },
  {
    "title": "‘Unreliable Evidence’: Supreme Court Frees Man from Death Row, Reforms DNA Procedure Nationwide",
    "description": "<p>In a landmark ruling, the Supreme Court of India acquitted a man previously sentenced to death in the Kattavellai @ Devakar v. State of Tamil Nadu case, citing unreliable evidence and significant procedural lapses in the handling of DNA evidence. This judgment is not only a victory for the accused but also a watershed moment for Indian jurisprudence due to the Supreme Court's issuance of binding, nationwide guidelines for the collection, preservation, and use of DNA evidence.</p>\n\n<p>Prior to this ruling, India lacked uniform standards for DNA handling, leading to inconsistencies and breaks in the chain of custody. This made DNA evidence questionable or inadmissible, particularly in high-stakes cases. The case involved the rape and murder of a couple in 2011, where the prosecution's case relied heavily on circumstantial evidence and DNA reports linking the accused to the crime.</p>\n\n<p>The Supreme Court identified critical lapses in the prosecution's case, including unreliable testimonies, vague confessions, unsubstantiated theories, and a broken DNA chain of custody. Recognizing the systemic risks posed by a lack of procedural uniformity, the Court issued detailed and binding directions for handling DNA evidence that must be followed across the country. This ruling and the associated guidelines are expected to have a transformative effect on the evidentiary landscape of criminal law in India.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/dna-evidence-in-death-penalty-cases.jpg"
  },
  {
    "title": "Delhi High Court Mandates Pre-Institution Mediation for Commercial Counter-Claims",
    "description": "<p>In *Aditya Birla Fashion and Retail Ltd. v. Mrs. Saroj Tandon*, the Delhi High Court clarified that pre-institution mediation under Section 12-A of the Commercial Courts Act, 2015, is mandatory for commercial counter-claims, even if they do not contemplate urgent relief. The case involved a dispute over a lease agreement and the refund of a security deposit, where the defendant filed a counter-claim without undergoing pre-institution mediation.</p>\n\n<p>The High Court overturned the Trial Court's decision, emphasizing that a counter-claim is treated as a distinct and independent suit under the Code of Civil Procedure. Therefore, it must comply with Section 12-A of the Act. The court referenced the Supreme Court's decision in *Patil Automation Pvt. Ltd. v. Rakheja Engineers Pvt. Ltd.*, which established the mandatory nature of Section 12-A, effective prospectively from August 20, 2022. The High Court highlighted the legislative intent behind pre-institution mediation, which aims to reduce the burden on courts and promote early settlements.</p>\n\n<p>While agreeing that Section 12-A applied to the counter-claim, the Court acknowledged that the counter claim was filed before the cut-off date of August 20, 2022 and therefore directed that it ought not to be rejected on the ground of non-compliance with the mandatory Pre-Institution Mediation. The judgment clarifies that counter-claims in commercial suits are procedurally the same as suits and must adhere to the same requirements, including pre-institution mediation, reinforcing the importance of this process for early dispute resolution in commercial matters.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/pre-institution-mediation-mandatory.jpg"
  },
  {
    "title": "Corporate Identity and Defamation in the Digital Age: Analyzing Google India Private Limited. v. Nayana Krishna, Karnataka High Court (2025)",
    "description": "<p>The Karnataka High Court's decision in *Google India Pvt. Ltd. v. Nayana Krishna* clarifies the boundaries of civil liability in defamation suits involving multinational tech companies and their Indian subsidiaries. The case addresses the crucial intersection of defamation law, intermediary liability, and corporate identity in the digital age.</p>\n\n<p>The suit was originally filed against 21 defendants, including Google India, alleging the dissemination of defamatory content. Google India sought to be removed from the suit, arguing the absence of specific allegations or evidence linking it to the defamatory acts. The trial court rejected this application, leading to Google India's appeal to the High Court.</p>\n\n<p>The High Court framed the key issues as whether Google India was a necessary party, whether the plaint contained sufficient detail to establish defamation, and whether Google India's corporate structure justified its inclusion given the content was hosted on platforms operated by distinct foreign entities. The court emphasized the need for specific pleadings detailing the defamatory material, context, and responsible entity. It reiterated that generalized claims are insufficient, especially concerning digital platforms.</p>\n\n<p>The court distinguished Google India from its parent company, Google LLC, noting Google India's role as a non-exclusive reseller of online advertising and provider of technical support. Absent evidence of direct involvement, the court rejected the assumption that shared branding equated to liability. The High Court ultimately allowed Google India's petition, setting aside the trial court's order and removing Google India from the suit, reasoning that its inclusion represented an abuse of process.</p>\n\n<p>The judgment reinforces the need for detailed pleadings in defamation cases and respects the distinct legal identities of domestic subsidiaries. It also aligns with global trends aimed at protecting intermediary platforms from unwarranted litigation, unless their role in unlawful acts is clearly substantiated under statutory frameworks. This decision serves as a vital precedent in the evolving landscape of digital defamation law and the limits of civil liability for online services and their regional affiliates.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/corporate-defamation-in-digital-age.jpg"
  },
  {
    "title": "Market Value on Execution Date Controls Stamp Duty, Rules High Court",
    "description": "<p>The Punjab and Haryana High Court, in a recent decision, has clarified that stamp duty on sale deeds should be assessed based on the market value prevailing on the date of execution and registration of the sale deed, not the date of the earlier agreement to sell. This ruling addresses a recurring issue under the Indian Stamp Act, 1899, which governs stamp duty on property transactions.</p>\n\n<p>The Court's analysis centered on the interpretation of the Indian Stamp Act, 1899, particularly Section 3, emphasizing that the duty is imposed on the instrument of conveyance itself. It relied heavily on the Supreme Court decision in *State of Rajasthan v. Khandaka Jain Jewellers*, which established that the relevant market value is that on the execution date of the conveyance deed. The Court distinguished precedents dealing with assignment deeds, finding them inapplicable to conveyances by sale.</p>\n\n<p>The High Court explicitly overruled a prior conflicting judgment, *Harvinder Pal Singla v. State of Haryana*, which had assessed stamp duty based on the market rate at the time of the agreement to sell. The Court reiterated that Section 3, in conjunction with Section 17, mandates that the sale instrument must be duly stamped at the time of execution, reflecting the then-prevailing market value. This decision provides clarity and ensures consistency in stamp duty application, aligning with Supreme Court precedent and serving as authoritative law within its jurisdiction.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/hc-stamp-duty-based-on-execution-date-market-value.jpg"
  },
  {
    "title": "Jet Airways Ratio Re-affirmed: Liquidator Need Not Honour Post-liquidation PF Penalties",
    "description": "<p>The National Company Law Tribunal (NCLT), Kochi Bench, ruled on July 9, 2025, that the liquidator of Raihan Healthcare Private Limited is not obligated to honor penalties assessed by the Employees’ Provident Fund Organisation (EPFO) after the company entered liquidation. The case originated from a corporate insolvency resolution process (CIRP) initiated against the hospital chain in March 2019, followed by a liquidation order in February 2020, appointing a liquidator.</p>\n\n<p>The EPFO initially filed a claim of ₹1.73 crore for unpaid PF dues, which the liquidator admitted and subsequently paid ₹1.90 crore, treating employer and employee contributions as exempt from the liquidation estate. A revised claim of ₹4.72 crore was later submitted by the EPFO in 2023, including additional dues, damages, and interest based on post-liquidation assessments. The liquidator rejected this additional demand, prompting the EPFO to file an application under Section 60(5) of the Insolvency and Bankruptcy Code, 2016, seeking priority payment of the balance ₹2.82 crore.</p>\n\n<p>The NCLT sided with the liquidator, holding that assessments conducted after the liquidation order are void due to the moratorium under Sections 14 and 33(5) of the Code. While basic contributions remain protected, penal damages and interest arising from post-liquidation orders are not entitled to priority or exemption. The Tribunal dismissed the EPFO's application, limiting their claim to the ₹1.90 crore already disbursed, effectively ending the dispute.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/jet-airways-ratio-re-affirmed-liquidator-need-not-honour-post-liquidation-pf-penalties.jpg"
  },
  {
    "title": "BBMP Advertisement Bye-Laws, 2024: A New Legal Framework for Bengaluru’s Outdoor Advertising",
    "description": "<p>The Bruhat Bengaluru Mahanagara Palike (BBMP) introduced the Advertisement Bye-Laws, 2024, effective July 17, 2025, under the Greater Bengaluru Governance Act, 2024. This comprehensive framework replaces the 2006 and 2018 bye-laws, aiming to standardize advertising practices, protect urban aesthetics, prevent unauthorized displays, and ensure transparent commercial exploitation of advertising spaces.</p>\n\n<p>Key regulatory features include structured licensing and registration for advertisers, with licenses valid for five years and subject to renewal. The allocation of advertising rights on notified roads and areas is conducted through public auction or tender via e-procurement, governed by the Karnataka Transparency in Public Procurement Act, 1999. Spatial restrictions and density norms are enforced, with minimum spacing requirements between hoardings and restrictions based on road width.</p>\n\n<p>The bye-laws also address ownership, taxation, and ground rent, stipulating that payment of advertisement fees to BBMP does not confer land rights and that advertisers must secure agreements with landowners. Environmental and safety compliance is mandated, requiring biodegradable materials and prohibiting plastic or PVC flexes, diesel generators, and disruptive illumination. Legacy advertisements are temporarily protected, while infrastructure advertisements are subject to separate tendering. Certain self-advertisements and advertisements by public utilities are exempt from fees under defined conditions.</p>\n\n<p>Enforcement mechanisms are codified, including penalties for non-compliance and removal of unauthorized displays. An Advertisement Regulatory Committee (ARC) oversees implementation, resolves disputes, and hears appeals. The bye-laws advance consumer protection by preventing misleading claims and ensuring public safety through structural stability requirements. Overall, the BBMP Advertisement Bye-Laws, 2024, represent a significant step toward structured commercialization of outdoor advertising, embedding transparency, environmental accountability, and public safety principles.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/unknown-id.jpg"
  },
  {
    "title": "Supreme Court Cancels Bail in Shelter Home Abuse Case: Reaffirming Victim Rights and Institutional Accountability",
    "description": "<p>The Supreme Court of India, in *Victim ‘X’ v. State of Bihar & Anr.*, overturned the bail granted to a shelter home superintendent accused of facilitating immoral trafficking and sexual exploitation of women inmates. The ruling, delivered on July 21, 2025, underscores the importance of considering the gravity of the offense, societal impact, and victim participation in bail decisions, particularly under the Scheduled Castes and Scheduled Tribes (Prevention of Atrocities) Act, 1989.</p>\n\n<p>The case stemmed from systemic abuse at a government-run women's shelter home, where the superintendent allegedly administered intoxicating injections to inmates, enabling their sexual exploitation. The High Court granted bail to the accused, citing a lack of specific allegations, without impleading or hearing the victim, violating Section 15A(3) of the SC/ST Act. The Supreme Court emphasized that the High Court's order lacked adequate reasoning and breached procedural safeguards.</p>\n\n<p>The Supreme Court held that the High Court erred in granting bail and highlighted the gravity of the allegations, the violation of the victim's right to be heard, the lack of reasoning in the bail order, and the threat to a fair trial posed by the accused's release. The Supreme Court cancelled the bail, ordering the accused to surrender and instructing the Trial Court and District Administration to protect victims and witnesses. This decision fortifies victim rights under the SC/ST Act, demands reasoned bail orders in cases of institutional abuse, and reinforces institutional accountability, advancing gender justice and social equity.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/sc-cancels-bail-in-shelter-home-abuse-case.jpg"
  },
  {
    "title": "Caste Abuse, Water Inequality, and the Law: A Tenkasi Woman’s Fight for Dignity",
    "description": "<p>The Madurai Bench of the Madras High Court addressed a case, *Thirumalaisamy v. State of Tamil Nadu*, involving a man convicted under the SC/ST Act for caste-based abuse of a Dalit woman. The case highlighted the persistent issue of caste discrimination in rural India, specifically concerning access to drinking water.</p>\n\n<p>Thirumalaisamy was convicted for using caste-based slurs against the victim during an altercation on her land and sentenced to one year of rigorous imprisonment. Justice R.N. Manjula granted a suspension of the sentence but expanded the scope of the case in response to the victim's testimony regarding water inequality, where Dalit households were forced to wait until dominant castes finished using a public tap. The Court emphasized that access to clean water is a fundamental right integral to the right to life guaranteed by the Constitution, decrying the rule of the mighty over the rule of law.</p>\n\n<p>The Court issued specific directives to the District Collector of Tenkasi to ensure the prevention of caste-based discrimination in Thalaivankonttai village. These directives included the installation of adequate public water taps with equitable access for all communities, prohibiting any single community from claiming exclusive control over public water sources. A compliance report is due by July 31, 2025. The ruling underscores the judiciary's role in addressing social injustice beyond legal technicalities, recognizing that caste discrimination extends beyond overt acts of violence to include subtle denials of basic necessities.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/tenkasi-womans-legal-battle-for-water-and-dignity.jpg"
  },
  {
    "title": "Intermediary Liability in the Digital Age: Judicial Enforcement and the Ramkumar Decision",
    "description": "<p>The expansion of India's digital ecosystem brings challenges regarding online harm, necessitating clarity on intermediary liability, specifically the extent to which digital platforms are accountable for hosted content. The Madras High Court's decision in *Ramkumar v. Union of India (2025)* offers insights into judicial expectations of intermediaries and the government in preventing access to child sexual exploitation content.</p>\n\n<p>Indian law, particularly Section 79 of the Information Technology Act, 2000, provides a \"safe harbor\" to intermediaries, protecting them from liability for third-party content if they exercise due diligence and act upon knowledge of unlawful content. The Supreme Court's decision in *Shreya Singhal v. Union of India* clarified that intermediaries are obligated to remove content only upon receiving a court order or notification from a government agency. The Information Technology (Intermediary Guidelines and Digital Media Ethics Code) Rules, 2021 further operationalize intermediary responsibilities.</p>\n\n<p>The *Ramkumar* case involved a film teaser allegedly depicting child pornography hosted on YouTube. The Madras High Court directed the Ministry of Electronics and Information Technology (MeitY) to remove the content, emphasizing the social responsibility of intermediaries and the urgency of child protection. The court prioritized the state's duty to act in cases of ongoing online harm, even without impleading YouTube LLC. This decision highlights a shift in judicial reasoning, prioritizing harm prevention over procedural technicalities in digital safety matters.</p>\n\n<p>This trend is mirrored in the Supreme Court's order in *X v. Union of India*, where the court addressed the circulation of non-consensual intimate images and directed the government to establish a centralized takedown mechanism. This ruling complements *Ramkumar* by underscoring that constitutional rights to privacy and protection from digital abuse should guide intermediary responsibilities. Overall, intermediary liability jurisprudence in India is evolving from a passive safe-harbor approach toward a responsibility-driven framework, with courts interpreting statutory protections in light of fundamental rights and public interest. The *Ramkumar* judgment emphasizes that intermediaries cannot remain neutral conduits in cases of serious violations like child exploitation, and government agencies cannot abdicate their duty to act.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/intermediary-liability-and-the-ramkumar-judgment.jpg"
  },
  {
    "title": "‘May’ Does Not Mean ‘Must’: Supreme Court Refuses Arbitration Reference",
    "description": "<p>The Supreme Court of India, in *BGM AND M-RPL-JMCT (JV) v. Eastern Coalfields Ltd.*, reinforced the requirements for a valid arbitration agreement under Section 7 of the Arbitration and Conciliation Act, 1996. The Court clarified that permissive language in a dispute resolution clause, such as \"may be sought through arbitration,\" does not constitute a binding agreement to arbitrate. This ruling aligns with precedents like *Jagdish Chander v. Ramesh Chander* and *Mahanadi Coalfields Ltd. v. IVRCL AMR JV*, emphasizing the need for a clear consensus ad idem (mutual agreement) to arbitrate.</p>\n\n<p>The case involved a commercial contract between BGM AND M-RPL-JMCT (JV) and Eastern Coalfields Ltd., where a dispute arose. The appellant sought arbitration based on Clause 13 of the contract, which stated that disputes \"may be sought through Arbitration and Conciliation Act, 1996.\" The Calcutta High Court rejected the application, deeming the clause insufficient as a valid arbitration agreement. The Supreme Court upheld this decision, stating that the language indicated a possibility rather than a mandatory commitment to arbitration.</p>\n\n<p>The Court emphasized that while Section 11(6A) limits judicial review to the \"existence\" of an arbitration agreement, this necessitates a prima facie reading of the contract. A clause suggesting arbitration as a potential step does not fulfill the requirements of Section 7. The decision underscores the importance of using mandatory language, such as \"shall be referred to arbitration,\" to create a binding agreement. The ruling reaffirms that courts can scrutinize vague or tentative clauses early, preventing unnecessary arbitration referrals and enhancing the credibility of arbitration in India.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/sc-clarifies-may-vs-must-rejects-arbitration-plea.jpg"
  },
  {
    "title": "Dark Pattern in E-Commerce: Flipkart, Seller Ordered to Refund for Misrepresented Nokia Phone",
    "description": "<p>The District Consumer Disputes Redressal Commission in Gurugram ruled in favor of a consumer, Vedant Verma, who was sold a second-hand Nokia phone on Flipkart misrepresented as new. The Commission found both Flipkart and its seller, M/s Dhayal Trading, guilty of deficiency in service and unfair trade practice, ordering them to refund the purchase amount with interest and compensate for harassment and litigation expenses.</p>\n\n<p>The dispute arose after Verma purchased a Nokia 6310 via Flipkart and received a malfunctioning device. Upon inspection at an authorized service center, it was discovered that the phone was an older model (Nokia 3310), had been activated in Pakistan in 2017, and was not new as advertised. Despite attempts to resolve the issue with Flipkart and the seller, Verma received no assistance, leading him to file a formal complaint under the Consumer Protection Act, 2019.</p>\n\n<p>The seller and Nokia India did not appear before the Commission, and Flipkart's defense was struck off due to failure to file a written statement. Verma's claim was supported by documentary evidence, which the Commission accepted. The Commission concluded that selling a previously used or misidentified phone as new constituted a deficiency in service, fraud, and a deceptive trade practice, labeling it a \"dark pattern.\"</p>\n\n<p>The Commission directed Flipkart and the seller to refund ₹2,999 with 9% interest, provide ₹15,000 for mental harassment, and ₹11,000 for litigation expenses. Non-compliance may result in execution proceedings and potential penalties under the Consumer Protection Act, 2019, including imprisonment and fines. This case serves as a reminder of the accountability expected from e-commerce platforms and sellers, highlighting the role of consumer forums in addressing fraud in digital marketplaces.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/flipkart-seller-fined-for-misleading-nokia-phone-sale.jpg"
  },
  {
    "title": "Decades-Old Property Feud Resolved: SC’s Judgment on Will and Succession",
    "description": "<p>The Supreme Court of India's judgment in *Metpalli Lasum Bai (Since Dead) and Others Versus Metapalli Muthaiah (D) By LRs* provides insights into Hindu personal law, specifically concerning adoption, property devolution, and the validity of wills and family arrangements. This case resolved a decades-long property feud by scrutinizing the validity of a registered will and an oral family arrangement. The judgment emphasizes the heavy burden of proof required to dispute such instruments, particularly when factual evidence and consistent possession support their legitimacy.</p>\n\n<p>The case revolves around a property dispute over land originally owned by Metpalli Ramanna. His heir, Metpalli Rajanna, had two children, Muthaiah and Rajamma, from his first marriage, and was later married to Lasum Bai. Lasum Bai claimed ownership based on a registered will executed by Rajanna and an oral family arrangement. Muthaiah contested this, claiming the properties were joint ancestral properties and Rajanna died intestate. The trial court initially favored Lasum Bai, affirming the will and arrangement, but the High Court partially reversed this decision.</p>\n\n<p>The Supreme Court overturned the High Court's decision, restoring the trial court's original judgment. It emphasized the evidentiary value of the registered will, reinforced by Muthaiah's admission of his father's signatures and Lasum Bai's consistent possession of the property. The court underscored that a registered will carries a strong presumption of genuineness, placing a heavy burden on those challenging its authenticity and rejected Muthaiah's claim that he was entitled to inherit the property as an adopted son. The Supreme Court's verdict serves as a precedent, emphasizing that property rights are determined by sound appreciation of evidence and strict adherence to legal principles, particularly regarding properly executed testamentary documents.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/sc-on-decades-old-property-feud.jpg"
  },
  {
    "title": "Justice in Time: Allahabad High Court Orders Six-Month Limit on Maintenance Cases",
    "description": "<p>The Allahabad High Court, in *Smt. Anjali Singh vs. State of U.P. and Another*, has directed the Family Court, Gautam Budh Nagar, to conclude a pending maintenance case within six months, emphasizing the urgency of financial relief for deserted wives under Section 125 of the Cr.P.C. Justice Nalin Kumar Srivastava stressed the need for swift resolution in such cases, given the economic hardship faced by abandoned women, and underscored the responsibility of all actors in the justice system to avoid unnecessary delays.</p>\n\n<p>Maintenance under Indian law, primarily through Section 125 Cr.P.C., ensures financial support to spouses, minor children, or dependent parents unable to support themselves, irrespective of religion. To claim maintenance, a wife must demonstrate her husband's sufficient means and refusal to provide support; \"wife\" includes legally wedded and, in some cases, divorced, non-remarried women. Besides the Cr.P.C., maintenance claims can also be pursued under personal laws and special legislation like the Hindu Adoption and Maintenance Act and the Domestic Violence Act.</p>\n\n<p>The case involved Anjali Singh, who filed a maintenance case in the Family Court of Gautam Budh Nagar, contending that her husband's delaying tactics prolonged the proceedings. Her counsel argued that the repeated adjournments amounted to judicial harassment, as she had no independent source of income and depended on the litigation's outcome.</p>\n\n<p>The Court observed that Section 125 Cr.P.C. cases directly concern the dignity and well-being of vulnerable women and children and should be handled with compassion and urgency. It emphasized that delays in maintenance matters deny justice and amplify the emotional and financial distress of women. The Family Court was directed to decide the case within six months, granting no unnecessary adjournments, conditional on the applicant's full cooperation.</p>\n\n<p>Recent trends in Indian maintenance law reflect increased judicial recognition of women's financial insecurity post-separation or divorce. Courts are increasingly setting time limits for resolution, proactively issuing interim maintenance orders, and using measures like salary attachment to ensure enforcement. Courts have also clarified that women can pursue maintenance under multiple legal frameworks simultaneously, provided there is no double recovery.</p>\n\n<p>This judgment matters because it recognizes that maintenance litigation is about restoring dignity and fairness, mandating a six-month deadline to aid similarly situated women nationwide. It broadens judicial responsibility to include all stakeholders, acknowledging that prolonged procedures can further victimize already suffering parties and promoting judicial accountability in family law litigation.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/time-limit-set-for-maintenance-under-indian-law.jpg"
  },
  {
    "title": "Bombay High Court Acquits All 12 in 7/11 Mumbai Train Blasts Case",
    "description": "<p>The Bombay High Court acquitted all twelve accused in the 2006 Mumbai train blasts case on July 21, 2025, reversing a 2015 trial court conviction. The ruling, delivered nearly two decades after the attacks that killed 189 and injured over 820, cited severe evidentiary and procedural flaws in the prosecution's case.</p>\n\n<p>The court found that the Maharashtra Anti-Terrorism Squad (ATS) had \"utterly failed\" to establish guilt beyond reasonable doubt. Key issues included unreliable witness testimony and questionable investigative procedures. The High Court emphasized that guilt must be proven unequivocally, even in terror cases, and that coerced confessions and procedural lapses are unacceptable.</p>\n\n<p>The acquittal raises significant questions about the ATS's investigative methods and the potential wrongful imprisonment of innocent individuals for nearly two decades. The State of Maharashtra is expected to appeal the judgment in the Supreme Court. The case highlights the urgent need for police reforms, independent review of terror investigations, and accountability mechanisms to prevent wrongful prosecutions, particularly where allegations of torture are involved. The judgment underscores the importance of upholding the rule of law, even when public sentiment presumes guilt.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/mumbai-train-blasts-hc-acquits-all.jpg"
  },
  {
    "title": "No Fresh Notice to Heirs Needed after Section 13(2), SARFAESI Served: Srinagar Bench Clarifies",
    "description": "<p>The Srinagar Bench of the High Court of Jammu & Kashmir and Ladakh recently addressed a case regarding the Securitisation and Reconstruction of Financial Assets and Enforcement of Security Interest (SARFAESI) Act, 2002, specifically concerning the necessity of issuing a fresh Section 13(2) notice to the legal heirs of a deceased borrower. The case arose after Jammu & Kashmir Bank Ltd. initiated proceedings under Section 14 of the Act to take possession of a mortgaged property following the death of the borrower, Abdul Aziz Sofi, after a Section 13(2) notice had already been served to him during his lifetime.</p>\n\n<p>The legal heirs challenged the bank's action, arguing that a fresh Section 13(2) notice should have been issued to them, asserting that the proceedings violated principles of natural justice. The bank countered that Section 14 is a summary remedy focused on the secured asset and not a personal action against the borrower, emphasizing that the initial Section 13(2) notice was validly served.</p>\n\n<p>The Court ruled in favor of the bank, dismissing the writ petition. It clarified that the death of the borrower does not extinguish the bank's right to proceed against the mortgaged property, as the liability transfers to the estate. The Court emphasized that Section 14's provisos only require affirmation of compliance with Section 13(2) as it stood during the borrower's lifetime and do not mandate a second round of notices to the successors. While dismissing the petition, the judges added that the bank would consider any One-Time Settlement scheme application by the petitioners. The ruling underscores that SARFAESI focuses on the secured asset rather than the borrower's continued existence.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/section-132-sarfaesi.jpg"
  },
  {
    "title": "Supreme Court Reinforces SARFAESI Shield: No Stay on Bank Possession Without Demonstrated Pre-Existing Tenancy",
    "description": "<p>The Supreme Court, in *PNB Housing Finance Ltd. v. Manoj Saha & Anr.*, reversed a Calcutta High Court order, reaffirming the primacy of the Securitisation and Reconstruction of Financial Assets and Enforcement of Security Interest Act (SARFAESI Act), 2002. The case involved a tenant who failed to adequately demonstrate a pre-existing, protected tenancy prior to a property's mortgage and subsequent action under SARFAESI.</p>\n\n<p>The dispute arose when PNB Housing Finance initiated SARFAESI proceedings against a borrower who had mortgaged the property. A tenant on the property asserted rights under the West Bengal Premises Tenancy Act, 1997, after the bank took possession. The High Court initially restored possession to the tenant, but the Supreme Court overturned this decision.</p>\n\n<p>The Supreme Court emphasized that the 2016 amendment to SARFAESI provides a complete code, requiring tenants aggrieved by Section 13(4) measures to apply to the Debt Recovery Tribunal (DRT) under Section 17(4A), and if necessary, appeal to the Debt Recovery Appellate Tribunal. The Court found that the tenant's evidence of continuous possession prior to the Section 13(2) notice was lacking. The court also cited *Bajarang Shyamsunder Agarwal*, clarifying protections for tenants under oral or unregistered agreements are limited to one year from the Section 13(2) notice.</p>\n\n<p>The ruling reinforces the statutory framework of SARFAESI, highlighting that High Court intervention under Article 227 is inappropriate when an effective statutory remedy exists. The Supreme Court directed the DRT to promptly resolve the pending application, confirming PNB Housing Finance's possession of the secured asset and underscoring the importance of adhering to the established SARFAESI process.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/sc-upholds-sarfaesi-shield.jpg"
  },
  {
    "title": "India's FSSAI Notifies First Amendment to Food Products and Additives Standards: New Norms Effective February 2026",
    "description": "<p>The Food Safety and Standards Authority of India (FSSAI) has announced the Food Safety and Standards (Food Products Standards and Food Additives) First Amendment Regulations, 2025, effective from February 1, 2026.  These amendments, finalized after extensive stakeholder consultation following the draft publication on October 31, 2022, are issued under the Food Safety and Standards Act, 2006.</p>\n\n<p>Key technical changes include updated refractive index values for certain food products to enhance analytical precision in quality assessment. A new standard for meat sausages has been introduced, defining classifications, compositional criteria, and preparation processes, aiming to ensure uniformity and consumer safety.  Similarly, a new standard is set for dehydrated tarragon, prescribing detailed specifications for both whole and powdered forms, ensuring consistency and purity.</p>\n\n<p>Regulations for packaged drinking water have been updated, revising permissible packaging sizes for better consumer transparency.  The amendment omits certain safety-related footnotes regarding synthetic colors, streamlines regulatory text, and revises specifications for synthetic food color preparations, defining acceptable diluents and specifying labeling and dye content requirements.</p>\n\n<p>The FSSAI has removed steviol glycosides as an approved additive in specific beverage categories and updated Appendix C concerning processing aids. Furthermore, the amendment approves several new enzymes derived from genetically modified microorganisms for use in food processing, subject to stringent safety limits.  This comprehensive amendment reinforces India's commitment to scientific regulation, consumer protection, and alignment with international norms in the food industry.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/fssai-amends-food-products-and-additives-standards.jpg"
  },
  {
    "title": "Registered Deeds Now Mandatory Under RajRERA: A New Compliance Precedent",
    "description": "<p>RajRERA has issued Order No. F1(31) RJ/RERA/2019/1078, mandating that only registered partnership deeds and LLP agreements will be accepted for real estate project registration. This directive signifies a commitment to stricter promoter verification and legal enforceability. The order invokes Regulation 4(1)(B)(i) of the Rajasthan Real Estate Regulatory Authority (General) Regulations, 2017, requiring submission of identity and registration certificates relevant to the promoter's legal status.</p>\n\n<p>This new requirement necessitates that promoters seeking to register projects in Rajasthan under a partnership or LLP must ensure their partnership deeds or LLP agreements are duly registered with the relevant Registrar of Firms or Registrar of Companies. Non-compliance can lead to rejection or delay of project registration applications.</p>\n\n<p>The rationale behind this directive includes enhancing legal certainty, facilitating enforceability, and ensuring greater promoter accountability. While most State RERAs require submission of partnership or LLP deeds, Rajasthan uniquely demands registered deeds as a precondition for project registration, setting a new compliance benchmark. This move by RajRERA may serve as a model for future procedural tightening by other State RERAs.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/rajrera-mandates-registered-deeds.jpg"
  },
  {
    "title": "Delhi Transgender Rules, 2025: Legal Recognition Procedures and State-Wide Enforcement Mechanisms Notified",
    "description": "<p>On July 11, 2025, the Government of the National Capital Territory of Delhi notified the Delhi Transgender Persons (Protection of Rights) Rules, 2025, to implement the Transgender Persons (Protection of Rights) Act, 2019 within Delhi. These rules establish procedural and institutional frameworks for legal recognition, welfare entitlements, and accountability for transgender persons. They operationalize provisions of the 2019 Act, which recognizes the right to self-perceived gender identity and prohibits discrimination in various sectors.</p>\n\n<p>A key feature of the Delhi Rules is the establishment of a Transgender Welfare Board as the apex coordinating body for safeguarding the rights and welfare of transgender persons in Delhi. The board's responsibilities and composition are defined within the rules.</p>\n\n<p>The rules also outline duties for stakeholder departments, obligating them to implement and report on transgender-inclusive measures and adapt existing schemes to ensure non-discrimination and effective participation of transgender persons across various sectors like health, education, and employment. Grievance redressal mechanisms and safeguards are also addressed.</p>\n\n<p>Effective from July 11, 2025, the rules set a two-year timeline for the government to establish necessary infrastructure and procedures, including public awareness campaigns and training programs. The Delhi Rules represent a progressive step towards inclusion and legal empowerment of transgender persons in Delhi.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/delhi-transgender-rules-2025.jpg"
  },
  {
    "title": "Partnership Continuity Upheld: Supreme Court Rejects IOCL’s Arbitrary Interpretation of Dealership Terms",
    "description": "<p>The Supreme Court's ruling in *Indian Oil Corporation Limited & Ors. v. M/s Shree Niwas Ramgopal & Ors.* affirms the importance of well-drafted partnership deeds and fair conduct from state instrumentalities. The case arose from IOCL's decision to halt kerosene supplies to M/s Shree Niwas Ramgopal, a partnership firm, following the death of one of its partners, citing a rigid interpretation of its internal guidelines.</p>\n\n<p>The court emphasized that Section 42 of the Indian Partnership Act, 1932, regarding dissolution upon a partner's death, primarily applies to two-partner firms, especially when the partnership deed explicitly states continuity is maintained. The court found IOCL's actions arbitrary and in violation of Article 14, as they disregarded the partnership deed's provisions and imposed unreasonable demands on the firm to include all of the deceased's heirs, despite internal disputes.</p>\n\n<p>The Supreme Court upheld the Calcutta High Court's mandamus, directing IOCL to resume kerosene supplies. This decision reinforces the supremacy of partnership agreements and mandates a more pragmatic, fair approach from state entities when dealing with their commercial partners, favoring business continuity over bureaucratic inflexibility. The ruling serves as a reminder for public sector undertakings to act fairly and avoid unnecessary litigation that disrupts established businesses.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/sc-rejects-iocls-dealership-terms.jpg"
  },
  {
    "title": "Madras HC Sets Landmark Precedent Against Online NCII Abuse",
    "description": "<p>The Madras High Court, in *X v. Union of India & Ors.*, delivered a groundbreaking judgment addressing the proliferation of Non-Consensual Intimate Images and Videos (NCII) online. The ruling, prompted by the case of a young advocate whose intimate moments were recorded and circulated without her consent, emphasizes the violation of Article 21 of the Constitution, specifically the Right to Privacy and Dignity.</p>\n\n<p>The court established a concrete framework for addressing NCII abuse. It mandates the Ministry of Electronics and Information Technology (MeitY) to act within 48 hours of receiving complaints, requiring swift removal of content. Digital intermediaries and law enforcement agencies are legally bound to act within 24 hours of notification. The framework requires victims to submit detailed affidavits, sensitized grievance officers across platforms, and a multilingual and accessible National Cybercrime Reporting Portal. Furthermore, it imposes obligations on search engines to employ hash-matching technology to prevent the reappearance of removed content and envisions a government-backed encrypted platform for registering and hashing NCII content.</p>\n\n<p>Justice N. Anand Venkatesh reinforced the message that digital abuse will face swift legal consequences, and victims will not be left to fight alone. The judgment marks a turning point in India's battle against online sexual exploitation and lays a roadmap for reclaiming digital dignity.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/law-on-ncii-abuse-and-victim-rights.jpg"
  },
  {
    "title": "High Court Clarifies Locus Standi for Section 138 NI Act Complaints",
    "description": "<p>The Himachal Pradesh High Court's decision in *Shirgul Filling Station v. Kamal Sharma* emphasizes the strict procedural requirements for cheque dishonor cases under Section 138 of the Negotiable Instruments Act, 1881. The court upheld the dismissal of a complaint filed by a sole proprietorship due to a failure to adequately prove the proprietorship and the legal standing of the person initiating the proceedings.</p>\n\n<p>The Trial Court found that the complainant, Shirgul Filling Station, failed to provide conclusive proof that Shivani Gupta was the proprietor. The authority letter provided by Ankur Aggarwal was deemed invalid as it was issued after the legal notice was sent and the complaint filed, and was not a valid power of attorney. Furthermore, as the cheque was issued to Shirgul Filling Station, and Ankur Aggarwal failed to prove the proprietorship, he could not be considered the \"payee\" as required by Section 138.</p>\n\n<p>The High Court affirmed the Trial Court's decision, dismissing the criminal appeal and upholding the acquittal of Kamal Sharma. The judgment underscores the importance of adhering to procedural requirements, establishing clear locus standi with valid authorization, and ensuring authorization timeliness. This ruling serves as a reminder for litigants, especially those representing sole proprietorships, to ensure proper legal representation and meticulous observation of procedural formalities before initiating action under Section 138 of the NI Act. Failure to do so can result in dismissal, regardless of the underlying financial dispute.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/locus-standi-under-section-138-of-the-ni-act-clarified.jpg"
  },
  {
    "title": "Delhi High Court Quashes FIR in Live-In Relationship Dispute, Imposes Cost for Casual Use of Criminal Law",
    "description": "<p>The Delhi High Court, in a ruling on July 15, 2025, quashed an FIR registered under Sections 69 and 351(2) of the Bharatiya Nyaya Sanhita, 2023, highlighting the misuse of criminal proceedings in disputes arising from a live-in relationship. The case involved Anil Verma, the petitioner, and Respondent No. 2, who had been in a 15-year relationship and cohabitating since 2019.</p>\n\n<p>The initial FIR, filed by the Respondent No. 2 due to misunderstandings, led to allegations of criminal offences. However, the parties subsequently reached an amicable settlement, with the complainant admitting the complaint was filed during a period of emotional distress and no longer wished to pursue the matter. Despite the State's opposition, arguing against setting a compromising precedent in cases involving alleged sexual exploitation, the Court recognized the complainant's autonomy and the personal nature of the dispute.</p>\n\n<p>Justice Swarana Kanta Sharma emphasized that forcing a trial after reconciliation would be counterproductive. However, acknowledging the severity of initiating criminal proceedings based on misunderstandings, the Court imposed a cost of ₹20,000 on the complainant, payable to the Delhi High Court Legal Services Committee, to discourage the casual use of criminal law. Consequently, FIR No. 154/2025 and all related proceedings were quashed. The Court cautioned against using criminal law as a tool for emotional leverage in personal relationships, particularly given the severe legal and reputational consequences.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/live-in-relationship-dispute.jpg"
  },
  {
    "title": "Overpricing Beyond MRP Violates Consumer Law: Thrissur Forum Orders Refund and Compensation",
    "description": "<p>The Consumer Disputes Redressal Commission in Thrissur has reaffirmed the significance of the Legal Metrology Act and consumer rights, ruling that charging even a single rupee over the Maximum Retail Price (MRP) on pre-packaged goods constitutes an unlawful and unfair trade practice. This decision reinforces the protection afforded by the Consumer Protection Act, emphasizing the importance of adhering to the MRP displayed on product packaging.</p>\n\n<p>The case originated when a consumer, Lenish V.R., was charged Rs. 800 for a brandy bottle with an MRP of Rs. 740 at a Kerala State Beverages Corporation (KSBC) outlet. Despite KSBC acknowledging the overcharge, they failed to provide evidence justifying the additional amount. The Commission found that the consumer successfully demonstrated the violation, shifting the burden of proof to KSBC, which they could not fulfill.</p>\n\n<p>The Commission emphasized that as per the Legal Metrology Act, 2009, and the Packaged Commodities Rules, 2011, retailers are prohibited from selling pre-packaged commodities above the MRP, except in cases of valid tax revisions within a specific timeframe, which KSBC could not prove. The Commission also noted that, as a government-owned entity, KSBC has a responsibility to act as a model vendor, upholding consumer rights and statutory norms without exception.</p>\n\n<p>The Commission directed KSBC to refund the excess amount of Rs. 60, provide Rs. 5,000 in compensation for mental distress, and cover Rs. 10,000 in litigation costs, all with interest. Additionally, KSBC was instructed to immediately cease the practice of overcharging for pre-packaged commodities. This ruling serves as a clear warning to retailers, particularly government-owned establishments, regarding the sanctity of MRP and empowers consumers to actively protect their rights against unfair trade practices.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/overpricing-beyond-mrp-violates-consumer-law.jpg"
  },
  {
    "title": "Stamp Duty and Registration Fee Exemption Notified for Life Mission Housing in Kerala",
    "description": "<p>The Government of Kerala has issued an order, effective from July 14, 2025, granting a two-year exemption from stamp duty and registration fees for beneficiaries of the Life Mission housing scheme acquiring land for residential purposes. This initiative, aimed at enhancing housing affordability for economically weaker sections, aligns with the state's commitment to social welfare and housing rights.</p>\n\n<p>The exemption is enabled by the Kerala Stamp Act, 1959, and the Registration Act, 1908, which empower the State Government to remit or reduce stamp duty and registration fees in the public interest. The Life Mission scheme, Kerala’s flagship housing program, aims to provide secure housing to landless and homeless families through financial assistance and infrastructure support.</p>\n\n<p>To avail of the exemption, beneficiaries must present a certificate from the District Collector or authorised Tehsildar confirming their status as a Life Mission beneficiary and the land's exclusive use for constructing a residential dwelling under the scheme. This exemption reduces the financial burden on beneficiaries, potentially saving them 8-10% of the transaction value, while requiring compliance with procedural requirements. Developers and NGOs involved in Life Mission projects should also factor this exemption into their processes, while the state foregoes revenue in favor of long-term social infrastructure development.</p>\n\n<p>This exemption represents a strategic regulatory intervention supporting inclusive housing by removing cost barriers for vulnerable households and reinforcing the State's focus on welfare-centric governance. Legal and compliance professionals should integrate this exemption into relevant transactions, ensuring timely compliance with certification requirements and transaction timelines.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/kerala-exempts-stamp-duty-for-life-mission-housing.jpg"
  },
  {
    "title": "Assam's Coaching Institutes Act: Raising the Bar for Regulation",
    "description": "<p>The Assam Coaching Institutes (Control and Regulation) Act, 2025, represents a significant legislative effort to regulate India's private coaching industry. The Act mandates registration for all coaching institutes operating in Assam and establishes comprehensive standards for academic quality, operational practices, safety, and ethical conduct. A key feature is the prohibition of misleading advertisements, aligning with the Consumer Protection (E-Commerce) Rules, 2020 and raising the regulatory benchmark for the sector.</p>\n\n<p>While primarily targeting brick-and-mortar coaching centers, the Act's implications extend to digital platforms and EdTech companies operating in or targeting Assam. These platforms must ensure that only registered institutes are promoted and avoid misleading claims in their advertising. Institutes are also required to maintain updated websites with disclosures on fees, faculty, and student outcomes, consistent with consumer protection norms.</p>\n\n<p>The Act establishes District Authorities with the power to conduct inspections, register complaints, and enforce penalties for non-compliance, including fines and potential imprisonment. Unlike other states with administrative guidelines, Assam's law provides a structured and enforceable framework, marking a shift toward greater compliance in the marketing and delivery of education in India.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/assams-new-coaching-regulation-law-explained.jpg"
  },
  {
    "title": "Divorce in the Digital Age: SC Allows Secretly Taped Calls Between Spouses",
    "description": "<p>In *Vibhor Garg v. Neha*, the Supreme Court of India ruled that secretly recorded telephonic conversations between spouses are admissible as evidence in matrimonial proceedings like divorce, clarifying a key point of law in the digital age. The Court held that spousal privilege under Section 122 of the Indian Evidence Act, 1872, does not bar such recordings when the dispute is between the spouses themselves.</p>\n\n<p>The case involved a husband seeking to introduce audio recordings as evidence of cruelty in divorce proceedings. The Supreme Court overturned a High Court decision that had disallowed the evidence based on privacy concerns, affirming the Family Court's initial decision to admit the recordings. The Court clarified that Section 122 contains an exception for suits between spouses, and the right to privacy under Article 21, while fundamental, is not absolute and must be balanced against the right to a fair trial.</p>\n\n<p>The Supreme Court reaffirmed the existing test for admitting secretly recorded conversations, emphasizing that lack of consent alone does not render evidence inadmissible. Further, electronic records, including audio recordings, are admissible under Sections 65A and 65B of the Evidence Act, provided the necessary certification is submitted. While not issuing binding procedural safeguards, the Court acknowledged the need for caution and suggested factors for Family Courts to consider when evaluating such evidence, including proportionality, intent, and evidentiary safeguards. The ruling balances the right to privacy with the imperatives of justice, allowing relevant evidence to be considered while acknowledging the potential for misuse.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/sc-validates-secretly-recorded-telephonic-conversation.jpg"
  }
]