[
  {
    "title": "SC Reaffirms That Counterclaims Are Maintainable Only Against Plaintiffs, Not Co-Defendants",
    "description": "<p>In a significant ruling, the Supreme Court of India in *Sanjay Tiwari v. Yugal Kishore Prasad Sao & Ors.* clarified that a counterclaim, as per Order VIII Rule 6A of the Code of Civil Procedure, 1908, can only be maintained against the plaintiff and not against a co-defendant. This decision reinforces procedural discipline and prevents the misuse of counterclaims to resolve disputes between co-defendants.</p>\n\n<p>The case originated from a suit for specific performance filed by Sanjay Tiwari (the plaintiff) against the first defendant concerning an alleged oral agreement for land sale. Following the first defendant's contention of non-joinder, defendants 2 and 3 were impleaded. Subsequently, defendants 2 and 3 filed a counterclaim *against the first defendant*, seeking conveyance of a portion of the same land based on their own alleged agreement. Both the Trial Court and the High Court allowed this counterclaim, reasoning that it would avoid multiplicity of proceedings. The plaintiff then appealed to the Supreme Court, arguing that a counterclaim cannot be raised against a co-defendant.</p>\n\n<p>The Supreme Court bench meticulously examined Order VIII Rule 6A CPC, emphasizing that a counterclaim is a defensive plea intended to be asserted by a defendant *against the plaintiff* to avoid multiple proceedings between these two parties. The Court highlighted that the provision does not envisage disputes between co-defendants. Citing previous judgments like *Rohit Singh v. State of Bihar* and *J. Charitable Trust v. V.M.R. Janardana Iyengar*, the Court affirmed that the scope of a counterclaim is strictly limited to claims against the plaintiff.</p>\n\n<p>Furthermore, the Supreme Court found the counterclaim by defendants 2 and 3 to be without substantive merit, noting inconsistencies in their claims, a lack of readiness and willingness to perform their part of the contract, and crucially, that the claim itself was time-barred, having been filed in 2006 for a cause of action that arose in 2002. The Court explicitly rejected the High Court's rationale that procedural efficiency could override statutory provisions governing counterclaims. Consequently, the Supreme Court allowed the appeal, setting aside the counterclaim of defendants 2 and 3 and remanding the original suit for specific performance to the Trial Court, with all other issues remaining open.</p>\n\n<p>This judgment serves as a vital precedent, underscoring that counterclaims must adhere strictly to the statutory framework and cannot be employed to resolve collateral disputes among co-defendants within the plaintiff's suit. It ensures that the judicial process maintains focus on the original cause of action and prevents the expansion of a suit's scope beyond its intended purpose.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/sc-clarifies-counterclaims-apply-only-against-plaintiffs.jpg"
  },
  {
    "title": "Applying Sub-Limit to Wrong Procedure Amounts to Deficiency in Service, Rules Ernakulam Consumer Commission",
    "description": "<p>The District Consumer Disputes Redressal Commission, Ernakulam, has ruled against Future Generali India Insurance Company Ltd. and its affiliate, finding them guilty of deficiency in service and unfair trade practice. This judgment stems from the insurer's wrongful curtailment of a medical insurance claim by misapplying a policy sub-limit intended for urinary stone removal to a distinct surgical procedure for urethral stricture, causing financial and emotional distress to the complainant.</p>\n\n<p>The complainant, Lype P. Joseph, underwent Visual Internal Urethrotomy (VIU) for bulbar urethral stricture at Apollo Adlux Hospital, incurring expenses of ₹71,553/-. Despite this, the insurer approved only ₹35,000, citing a special condition (h) related to \"Urinary Stone (including DJ stent removal for the same stone).\" Joseph disputed this, providing medical documentation confirming VIU as a stricture-relieving procedure, not stone removal, but his appeals to the insurer were unsuccessful, leading him to file a complaint.</p>\n\n<p>Future Generali defended its decision, arguing that the treatment was related to urinary stone disease, referencing the complainant's history and an email description. However, the Commission found that the insurer had wrongly invoked the sub-limit. It referenced the discharge summary and doctor's certificate, which unequivocally stated that VIU treats urethral stricture. Applying the principle of contra proferentem, which dictates that ambiguities in policy clauses must favor the insured, and citing the Kerala High Court's stance on unjustified claim denials violating the right to life, the Commission concluded that the insurer's actions were arbitrary, medically unfounded, and constituted a deficiency in service and unfair trade practice.</p>\n\n<p>Consequently, the Commission directed the insurer to pay the remaining claim amount of ₹36,553 with 9% interest from the complaint date, along with ₹10,000 as compensation for mental agony and suffering, and an additional ₹10,000 for litigation costs. This landmark ruling underscores that insurance policies are intended as a safety net, not a barrier, emphasizing the insurer's ethical and legal obligation for transparent, medically sound, and good-faith claim assessments, thereby reinforcing consumer rights and fostering accountability within the insurance sector.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/ernakulam-commission-fines-insurer-for-wrong-sub-limit-use.jpg"
  },
  {
    "title": "Supreme Court: Decree Passed in Favour of Deceased Parties is a Nullity, Trial Court Decree Revived for Execution",
    "description": "<p>The Supreme Court of India has unequivocally ruled that a judicial decree passed in favor of deceased parties, without the mandatory substitution of their legal heirs, is a nullity in law. In the case of Vikram Bhalchandra Ghongade v. State of Maharashtra & Ors., the Court reinstated a trial court decree, asserting that such a defective appellate decree, rendered in violation of Order XXII of the Code of Civil Procedure, 1908 (CPC), is devoid of legal effect and cannot supersede a valid prior judgment. This significant decision underscores the critical importance of procedural compliance in maintaining the legitimacy of judicial outcomes.</p>\n\n<p>The dispute originated from a two-decade-old land allotment matter, where legal heirs of an ex-serviceman, Mr. Arjunrao Thakre, secured a trial court decree in 2006, challenging an illegal re-allotment of his land. During the subsequent first appeal filed by the opposing parties, two appellants died before the appeal was heard, and their legal heirs were never brought on record. Despite this procedural lapse, the First Appellate Court proceeded to modify the trial court decree. This led to a complex legal trajectory, with the Executing Court and Bombay High Court initially upholding the appellate decree, leading to the appeal before the Supreme Court.</p>\n\n<p>The Supreme Court, setting aside the lower court orders, definitively held that the first appellate decree was a nullity. Its rationale was based on the fact that the decree was rendered in an appeal where both appellants had passed away prior to the hearing, and their legal heirs were not substituted as mandated by Order XXII CPC. The Court clarified that Order XXII Rule 6 CPC, which allows proceedings to continue if a party dies after arguments conclude but before judgment, was inapplicable as the deaths occurred before the hearing commenced. Consequently, the void appellate decree could not modify or supersede the valid trial court decree, which was thus revived for execution.</p>\n\n<p>This landmark ruling in Vikram Bhalchandra Ghongade v. State of Maharashtra & Ors. serves as a robust reaffirmation of the indispensable nature of procedural compliance in judicial proceedings. The Court explicitly affirmed that a decree passed in favor of deceased litigants without heir substitution constitutes a jurisdictional defect, rendering the decree void ab initio and subject to challenge at any stage, even during execution. The decision clarifies the limited scope of Order XXII Rule 6 CPC and reinforces the fundamental principle that judicial outcomes must rest on procedural fairness and due process, affirming that the law does not recognize decrees pronounced in favor of the dead.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/sc-decree-for-deceased-parties-void-trial-decree-revived.jpg"
  },
  {
    "title": "Madras HC Rules Technical Lapses Cannot Vitiate SARFAESI Auction Sale: A Guide to Rule 9 Validity",
    "description": "<p>The Madras High Court, in the case of M/s Lucky Footwear Components & Ors. v. Indian Bank & Ors., has affirmed that minor technical irregularities in the Securitisation and Reconstruction of Financial Assets and Enforcement of Security Interest Act, 2002 (SARFAESI Act) auction process cannot invalidate a sale. The Division Bench emphasized that judicial interference under Article 227 of the Constitution is limited and requires borrowers to demonstrate substantial prejudice, fraud, or collusion to challenge a concluded auction successfully.</p>\n\n<p>The case involved M/s Lucky Footwear Components, which defaulted on financial facilities from Indian Bank, leading to SARFAESI recovery proceedings and a subsequent public auction. The borrowers challenged the auction through the Debts Recovery Tribunal (DRT), Debt Recovery Appellate Tribunal (DRAT), and finally the High Court under Article 227. The High Court meticulously examined and rejected the borrowers' contentions, including claims of inadequate sale notice period (confirming \"not less than fifteen days\" was met without requiring \"clear days\"), insufficient property description, and outdated valuation. The Court noted that valuation by an approved valuer was sufficient and that minor deviations from internal policies or directory guidelines would not invalidate an auction without proven material prejudice or undervaluation. Furthermore, the borrowers' earlier communication was deemed a request for extension, not a formal objection under Section 13(3A), and new issues like loan classification were not entertained as they were not raised previously.</p>\n\n<p>Ultimately, the Division Bench dismissed the Civil Revision Petition, upholding the validity of the auction and affirming the decisions of the lower tribunals. Relying on Supreme Court precedent, the Court reiterated that concluded auction sales are not to be interfered with lightly unless tainted by fraud, collusion, or gross underpricing. The judgment underscores that Article 227 jurisdiction is supervisory, not appellate, and does not permit reappreciation of factual findings unless they are perverse or contrary to law.</p>\n\n<p>This decision reinforces the finality and integrity of SARFAESI auctions, signaling to borrowers that challenges must be based on concrete evidence of fundamental illegality, fraud, or substantial prejudice rather than minor procedural deviations. For banks, the ruling provides assurance that compliance with statutory requirements and engagement of approved valuers will protect their recovery actions from undue judicial interference.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/madras-hc-upholds-sarfaesi-auction-despite-technical-lapses.jpg"
  },
  {
    "title": "IBBI Tightens Transparency Norms: New Disclosure Templates for Resolution Applicants to Safeguard Section 32A Immunity",
    "description": "<p>The Insolvency and Bankruptcy Board of India (IBBI) has introduced a significant measure to enhance transparency and integrity in corporate insolvency resolution processes. Through a Discussion Paper released on 6 November 2025, the IBBI proposes mandatory disclosure templates for beneficial ownership and Section 32A eligibility for all Prospective Resolution Applicants (PRAs). This initiative aims to prevent the misuse of the \"clean slate\" immunity under Section 32A, which shields corporate debtors from prosecution for pre-insolvency offenses, by ensuring ineligible individuals with questionable backgrounds cannot acquire companies through opaque structures.</p>\n\n<p>This move stems from stakeholder feedback regarding the practical application of the Insolvency and Bankruptcy Code, 2016, and builds on the IBBI's prior emphasis in August 2025 for enhanced Section 32A disclosures. The proposed framework mandates amendments to Regulation 38 of the CIRP Regulations, compelling PRAs to submit a detailed beneficial ownership statement and a sworn affidavit on Section 32A eligibility. Crucially, the initiative aligns with the Reserve Bank of India’s updated Master Direction on Know Your Customer (KYC) norms, defining a \"beneficial owner\" as any natural person holding more than 10% ownership or control in companies, LLPs, and trusts, or over 15% in unincorporated bodies.</p>\n\n<p>The new disclosure requirements are detailed in two annexures. Annexure A outlines the beneficial ownership template, starting with basic corporate details and offering a streamlined disclosure path for listed entities that provide public filing links. For unlisted PRAs, it demands exhaustive details of natural person beneficial owners, including their nationalities, jurisdictions, percentage of control, identity documents, and a tier-wise ownership structure chart. Part IV of Annexure A requires a solemn declaration affirming the statement's accuracy and that no disclosed person is disqualified under Section 29A. Annexure B is a formal affidavit, to be sworn by the PRA’s authorized signatory, requiring an unequivocal declaration of eligibility for Section 32A immunity, a factual statement on prior connections to the corporate debtor, and confirmation that incoming management also meets Section 32A(1) criteria.</p>\n\n<p>The IBBI has invited public comments on these proposals until 16 November 2025, from a broad spectrum of stakeholders. These new norms are expected to significantly empower creditor committees to penetrate complex ownership structures, deter tainted promoters or shell companies from re-acquiring distressed assets, and facilitate inter-regulatory data sharing. Ultimately, this framework is anticipated to enhance the quality of resolution plans, fostering greater confidence among lenders and investors in India's distressed asset market.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/ibbi-mandates-new-disclosure-templates-for-insolvency.jpg"
  },
  {
    "title": "Beyond Nomenclature: SC Reinforces Substance Over Form in Arbitration Agreement Interpretation",
    "description": "<p>The Supreme Court of India, in a significant judgment delivered on November 6, 2025, in the case of M/s Alchemist Hospitals vs. M/s ICT Health Technology Services India, has unequivocally reaffirmed that the mere use of the term \"arbitration\" does not automatically validate a dispute resolution clause if it lacks the essential attributes of finality, neutrality, and binding effect. This ruling underscores the judiciary's commitment to prioritizing the true intent and substance of an agreement over its superficial form, particularly concerning Section 7 of the Arbitration and Conciliation Act, 1996.</p>\n\n<p>The dispute arose from a failed software implementation agreement between Alchemist Hospitals and ICT Health Technology Services. When technical issues led to the project's rollback, Alchemist Hospitals invoked Clause 8.28, titled “Arbitration,” seeking the appointment of a sole arbitrator. This clause outlined a three-tiered dispute resolution mechanism: initial negotiation, followed by mediation by the respective Chairmen of both parties (curiously termed \"Arbitrators\"), and critically, an explicit provision allowing either party to seek remedies through courts of law if the dispute remained unresolved after fifteen days. Both the High Court of Punjab & Haryana and the Supreme Court ultimately deemed this clause invalid as an arbitration agreement.</p>\n\n<p>The High Court initially rejected the application for an arbitrator, observing that Clause 8.28's terminology was loosely employed, facilitating only internal negotiation and mediation, rather than a binding adjudicatory process. The designation of the parties' own Chairmen as \"arbitrators\" was found incompatible with the impartiality required by the A&C Act, and crucially, the provision allowing recourse to civil courts after fifteen days negated the fundamental requirement of finality for any arbitration agreement. The Supreme Court affirmed this stance, grounding its analysis in the seminal six-factor test from K.K. Modi v. K.N. Modi, which mandates a binding decision, impartial adjudication, and legal enforceability. The Court emphasized that the explicit option to approach civil courts demonstrated a clear lack of intent for a conclusive process, distinguishing this case from precedents where post-agreement conduct clarified genuine, albeit ambiguous, arbitration clauses. It stressed that such conduct cannot create an arbitration agreement where none existed ab initio.</p>\n\n<p>Concluding its comprehensive analysis, the Supreme Court dismissed the appeal, holding that Clause 8.28 failed to meet the statutory prerequisites of Section 7 of the A&C Act. The judgment clarified that the appellant remained free to pursue remedies before a competent civil court. This decision serves as a crucial reminder to drafters of the necessity for precision and clarity in arbitration clauses, cautioning against mere label-sticking. By insisting on the core attributes of finality, impartiality, and binding commitment, the Supreme Court has fortified the integrity of arbitration as a distinct and reliable dispute resolution mechanism, reinforcing that the path to arbitration must be unequivocally marked, not obscured by ambiguous processes leading back to litigation.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/sc-clarifies-substance-over-form-in-arbitration-clauses.jpg"
  },
  {
    "title": "Supreme Court Split Multiplier Motor Accident Compensation 2025: Superannuation Not Exceptional Circumstance",
    "description": "<p>The Supreme Court of India has delivered a significant judgment, Preetha Krishnan & Ors. vs. United India Insurance Co. Ltd. & Ors. (2025 INSC 1293), decisively rejecting the controversial \"split multiplier\" concept in motor accident compensation calculations. Rendered on November 6, 2025, by Justices Sanjay Karol and Prashant Kumar Mishra, this ruling restores uniformity and certainty, stipulating that superannuation from service does not qualify as an exceptional circumstance warranting a reduction in compensation.</p>\n\n<p>The case originated from a 2012 accident that claimed the life of T.I. Krishnan, a 51-year-old Assistant Engineer. While the Motor Accidents Claims Tribunal initially awarded Rs. 44,04,912, the Kerala High Court subsequently introduced the \"split multiplier.\" It significantly reduced the compensation for loss of dependency, arguing that Krishnan's income would decrease by approximately 50% after his projected superannuation in four years. This approach, which led to a substantial reduction in the total compensation, was challenged by the claimants before the Supreme Court.</p>\n\n<p>The Supreme Court's analysis was anchored in foundational precedents such as Sarla Verma v. DTC and National Insurance Co. Ltd. v. Pranay Sethi, which established the structured framework for age-based multipliers and future prospects. Crucially, the Court reiterated the principle from Sumathi v. National Insurance Co. Ltd. that a split multiplier is only permissible in exceptional circumstances with specific recorded reasons, a condition that superannuation alone does not fulfill. The Court highlighted the pervasive inconsistency among High Courts in applying the split multiplier, emphasizing that such speculative calculations undermine the beneficial nature of the Motor Vehicles Act and the paramount need for uniformity and predictability in compensation awards.</p>\n\n<p>In its final decision, the Supreme Court set aside the High Court's application of the split multiplier. It recomputed the compensation by applying the correct multiplier of 11 (for ages 51-55), factoring in future prospects and standard deductions. This resulted in a total compensation of Rs. 47,76,794, an amount that exceeded the Tribunal's original award. The judgment, which applies prospectively, directs all High Courts and Motor Accident Claims Tribunals to cease using this flawed methodology, thereby ensuring consistent, uniform, and just compensation for victims' families nationwide.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/supreme-court-ends-split-multiplier-in-accident-awards.jpg"
  },
  {
    "title": "No More River-Dumping: FSSAI’s New Green advisory for Seized Food",
    "description": "<p>The Food Safety and Standards Authority of India (FSSAI) has issued a significant advisory on November 3rd, transforming the previously vague concept of \"safe disposal\" for seized unsafe food into a precise, time-bound, and environmentally responsible protocol. This directive aims to integrate food safety enforcement with crucial environmental protection, addressing previous failures where seized food often ended up polluting rivers and open fields despite earlier instructions for \"scientific disposal.\"</p>\n\n<p>This new mandate applies to all food safety enforcement personnel across states and union territories, including Commissioners, Designated Officers, Food Safety Officers, and their squads, ensuring immediate compliance upon seizure, rejection, or expiry of any food article. The advisory explicitly and strictly prohibits the dumping of seized food or its packaging into natural water bodies or open land, eliminating any loopholes that previously allowed such practices.</p>\n\n<p>Instead of ad-hoc solutions, FSSAI now prescribes a defined menu of approved disposal methods. High-calorific waste must be sent to Central Pollution Control Board (CPCB)-authorised incinerators for complete combustion. Biodegradable materials are to be composted or processed in certified anaerobic digesters to produce manure or biogas. Any remaining waste must be transported to designated sanitary landfills equipped with leachate control, requiring prior segregation of organic and inorganic fractions. A key element is the mandatory partnership with local municipalities, panchayats, or pollution boards before any disposal operation commences.</p>\n\n<p>The procedure for disposal is meticulously outlined. Each Designated Officer at the district level must maintain a roster of verified disposal facilities. When destruction is ordered, a Food Safety Officer or deputy must escort the consignment, accompanied by two independent witnesses. The entire process, from weighing to final disposal (burning, burial, or composting), must be recorded via mobile phone or body camera, followed by the drafting of a one-page Disposal Certificate. For large volumes, state pollution control bodies are involved for environmental monitoring. This system of video evidence and third-party witnesses creates a robust audit trail, significantly reducing the risk of clandestine re-sale or diversion. States and UTs are required to submit monthly compliance reports to FSSAI, with non-compliance facing penalties. The advisory also subtly acknowledges the current lack of CPCB-approved facilities in many districts, hinting at the need for states to invest in or partner with suitable waste-to-energy infrastructure.</p>\n\n<p>In essence, FSSAI's latest advisory marries food safety enforcement with ecological responsibility, providing a clear directive: unsafe food must be destroyed quickly and demonstrably, without causing environmental harm. This comprehensive protocol ensures accountability and aims to prevent future instances of environmental pollution from improperly disposed food products.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/fssai-issues-green-protocol-for-safe-food-disposal.jpg"
  },
  {
    "title": "ISO vs AOAC vs BIS: How the Latest FSSAI Amendment Will Speed Up Food Imports",
    "description": "<p>The Food Safety and Standards Authority of India (FSSAI) has introduced significant amendments to its import regulations with the publication of the Food Safety and Standards (Import) First Amendment Regulations, 2025, effective from May 1, 2026. This update aims to streamline India's food import clearance process by accelerating procedures and enhancing scientific adaptability, following a year-long consultative process.</p>\n\n<p>A key revision under Regulation 10(4)(b) addresses analytical testing methods. Previously, laboratories were restricted to FSSAI-issued analytical manuals. The amendment now allows laboratories to adopt any internationally accepted, validated method—such as AOAC, ISO, BIS, or Codex Alimentarius—if a specific testing parameter is not covered by FSSAI manuals. This change resolves a prior regulatory gap that often led to testing delays or the need for case-by-case dispensations.</p>\n\n<p>Furthermore, a critical new provision, sub-regulation 10(5), imposes a statutory timeline for analytical reports. From May 2026, all notified or referral laboratories must issue their findings in Form-2 within five calendar days of receiving a sample. This mandate, coupled with the expanded scope for testing methods, is expected to significantly shorten the average import clearance window and reduce demurrage costs for importers.</p>\n\n<p>Collectively, these amendments represent a modernization of India's food-safety architecture. By embracing globally recognized test methods and enforcing strict reporting timelines, FSSAI has achieved a balance between scientific rigor and trade facilitation, benefiting both consumer advocates and stakeholders in the food supply chain without compromising safety standards.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/fssais-2025-import-amendment-to-fast-track-food-clearances.jpg"
  },
  {
    "title": "CKYC Opens Digital Doors: New Relief for Differently-Abled Customers",
    "description": "<p>The Central KYC Records Registry (CKYCRR) announced a significant policy change on October 31, 2025, aimed at improving digital banking accessibility for millions of differently-abled individuals in India. This circular, effective November 14, 2025, makes three previously mandatory data fields optional for customers who identify as differently abled across banks, mutual funds, insurance companies, and fintech entities.</p>\n\n<p>Previously, differently-abled applicants were required to provide their exact medical impairment label, the precise percentage assigned by a certifying authority, and their Unique Disability ID (UDID) to complete digital onboarding. This stringent requirement created substantial barriers, forcing many to abandon digital channels due to missing UDIDs, outdated certificates, or a reluctance to disclose sensitive medical information, thereby defeating the objective of financial inclusion.</p>\n\n<p>Responding to regulatory feedback, CKYCRR has reclassified these three fields as optional. While institutions must still display these boxes in their interfaces, users can now leave them blank. The only remaining mandatory data point is a simple \"yes/no\" question confirming if the customer is differently abled, which allows for continued tracking of inclusion metrics without impeding the workflow. This adjustment signifies a crucial step towards reducing friction in digital financial services, allowing differently-abled individuals to open investment and other accounts with greater ease and dignity.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/ckyc-eases-kyc-rules-for-differently-abled-customers.jpg"
  },
  {
    "title": "No Toll for Police Help: Rajasthan HC Blocks Magistrate Bid to Load SARFAESI Section 14 With Pre-Deposit",
    "description": "<p>The Rajasthan High Court has delivered a significant ruling, setting aside a Chief Judicial Magistrate's (CJM) order that demanded a pre-deposit for police assistance under Section 14 of the SARFAESI Act, 2002. This decision prevents the introduction of an arbitrary financial hurdle into a summary remedy intended for speedy enforcement, clarifying that state assistance for securing physical possession is an enforcement obligation, not a chargeable service.</p>\n\n<p>The case arose when Tyger Home Finance Pvt. Ltd., after taking symbolic possession of a defaulted property in Alwar, sought the CJM's aid for physical possession with police support. The CJM, Alwar, issued the possession order but made it contingent on the financier depositing ₹6.34 lakh towards \"police expenses.\" This amount was deemed disproportionate to the outstanding loan and lacked any statutory backing or precedent, prompting the financier to challenge the condition before the Rajasthan High Court.</p>\n\n<p>Counsel for Tyger Home Finance argued that Section 14 of the SARFAESI Act is a remedial provision aimed at swift recovery, and it does not authorize secured creditors to pre-finance state machinery. They cited previous rulings that struck down similar deposit requirements. The State contended that the condition was pragmatic due to logistical costs but failed to provide statutory justification. Justice Ashutosh Kumar of the High Court unequivocally stated that \"there is no provision under Section 14 of the Act of 2002 which may authorize the learned Magistrate to direct the secured creditor to deposit any expenses of police assistance.\" The Court underscored that a Magistrate's duty, once satisfied with a lender's entitlement, is to facilitate enforcement without imposing financial gates, which would frustrate the Act's summary purpose.</p>\n\n<p>Consequently, the impugned condition in the CJM's order was set aside. The High Court directed Tyger Home Finance to approach the police directly and instructed the police authorities to comply with the original possession order \"at the earliest\" without insisting on any deposit. This judgment reinforces the critical principle that summary statutory remedies must remain free from extraneous pre-conditions, ensuring that Section 14 serves its intended purpose as a facilitator for lenders and not a mechanism for generating revenue from state services. It establishes a clear precedent that police assistance under Section 14 is an inherent part of the State's enforcement obligation.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/rajasthan-hc-nixes-police-deposit-in-sarfaesi-actions.jpg"
  },
  {
    "title": "NCLAT Draws Red Line: CCI Can’t Police Patent Abuse, Only Patent Office Can",
    "description": "<p>The National Company Law Appellate Tribunal (NCLAT) has delivered a significant ruling, asserting that the Competition Commission of India (CCI) lacks jurisdiction to police the abuse of patent rights, as this domain falls exclusively under the Patents Act. This decision emerged from an appeal filed by Mr. Swapan Dey against Vifor International (AG), a Swiss pharmaceutical giant, concerning its iron-deficiency injection, Ferric Carboxymaltose (FCM). The NCLAT emphatically stated that when the subject matter involves the exercise of patent rights, the Competition Act must yield to the specialized Patents Act, a stance with far-reaching consequences for intellectual property and competition strategies.</p>\n\n<p>Mr. Swapan Dey, CEO of a hospital, observed the high cost and limited availability of Vifor's patented FCM injectable, crucial for iron-deficient dialysis patients. Believing Vifor's pricing and restrictive licensing practices constituted an abuse of dominance under the Competition Act, he filed a complaint with the CCI. The CCI, however, closed the case in October 2022, finding no prima facie violation after examining Vifor's agreements and noting the patent's impending expiry. Aggrieved by this decision, Dey appealed to the NCLAT.</p>\n\n<p>During the appeal, Dey's counsel argued that the CCI had failed to properly assess the relevant market and the impact of restrictive licensing on market access and pricing. Vifor countered that the Patents Act, 1970, being a special and later legislation, provides a complete framework (Chapter XVI) for addressing unreasonable license terms or patentee abuse, thus superseding the general Competition Act. A critical precedent influencing the NCLAT's decision was the Delhi High Court's Ericsson judgment, subsequently upheld by the Supreme Court, which affirmed that the Patents Act prevails over the Competition Act when patent rights are in contention, leading to the quashing of CCI's investigations in that case.</p>\n\n<p>The NCLAT bench, acknowledging that the FCM patent had expired post-scrutiny, accepted Vifor's argument that the CCI's jurisdiction is ousted when the matter concerns the bona-fide exercise of a statutory patent right. This conclusion was grounded in Section 3(5) of the Competition Act, which protects \"reasonable conditions\" imposed by patent holders, and the comprehensive scheme of Chapter XVI of the Patents Act. The Tribunal clarified that if issues of affordability or public health arise from patented drugs, the correct recourse for complainants is to seek a compulsory license under Section 84 of the Patents Act, rather than pursuing a competition complaint. This ruling reinforces the principle that special laws take precedence over general laws in their specific domains, thereby delineating the boundaries of the CCI's authority in intellectual property matters and directing complainants towards the appropriate regulatory body for patent-related grievances.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/nclat-rules-cci-has-no-say-in-patent-abuse-disputes.jpg"
  },
  {
    "title": "Shock-Ready Factories: Telangana Draft Rules Add AED to Factory Medical Kit",
    "description": "<p>Telangana's Labour Employment Training & Factories Department has issued a preliminary notification (G.O.Rt.No.433, October 25, 2025) proposing a groundbreaking amendment to the Telangana Factories Rules, 1950. This draft rule aims to make Automatic External Defibrillators (AEDs) a mandatory component of Occupational Health Centres and Ambulance Rooms in factories, positioning Telangana as the first state in India to legally enforce such a requirement. The move addresses the critical gap in current factory medical facilities, which are often ill-equipped for sudden cardiac emergencies, where every minute lost drastically reduces survival chances.</p>\n\n<p>The initiative stems from a proposal highlighting the increasing vulnerability of even young workers to cardiac events in industrial settings. While AEDs are portable, user-friendly devices capable of restoring heart rhythm in the crucial minutes before professional medical help arrives, they are currently not specified in the existing equipment lists of Rules 61 and 64. The department determined that statutory compulsion, rather than advisory guidelines, is necessary to ensure the widespread placement and availability of these life-saving devices.</p>\n\n<p>The proposed amendment will add \"Automatic External Defibrillator\" as a new entry to Rule 61 and an additional item to Rule 64(3), covering factories employing 500 or more workers or engaged in hazardous processes. These factories will be required to procure and maintain AEDs at their own cost. In line with Section 115 of the Factories Act, the notification opens a 45-day public window for individuals, employers, trade unions, and other stakeholders to submit written objections or suggestions to the Director of Factories before the rule is finalized and enforced.</p>\n\n<p>If implemented, this proposal will significantly enhance worker safety, transforming factory medical rooms into more robust emergency response zones. For management, while incurring an upfront cost, the mandatory presence of AEDs could prove invaluable in averting fatalities, reducing costly litigation, and minimizing operational downtime resulting from medical emergencies. The 45-day consultation period is crucial for shaping this potentially life-saving legislation.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/telangana-to-mandate-aeds-in-factory-medical-rooms.jpg"
  },
  {
    "title": "Supreme Court Clarifies Limits of Injunction Suits Without Declaration of Title when Possession Is Disputed",
    "description": "<p>The Supreme Court of India, in the case of S. Santhana Lakshmi & Ors. v. D. Rajammal, has significantly clarified the scope and limitations of injunction suits filed without a corresponding prayer for declaration of title, particularly when possession is disputed. The Court emphasized that a plaintiff cannot secure an injunction to protect possession that is not legally or factually established, underscoring the necessity for procedural rigor in property litigation. This ruling reminds litigants that asserting a Will does not automatically confer ownership or possession, especially when the testator's authority is challenged.</p>\n\n<p>The dispute stemmed from a family property involving 1.74½ acres of land, initially belonging to Rangaswamy Naidu. The respondent, D. Rajammal, sought an injunction to prevent her brother, Munuswamy, from interfering with or alienating her alleged share, claiming inheritance through a Will. Munuswamy, however, contended the land was ancestral, already divided, and asserted his lawful possession as a co-owner. While the Trial Court and Madras High Court upheld the Will and granted the injunction, the First Appellate Court reversed, finding the property ancestral and the Will invalid. The defendant's legal heirs subsequently appealed to the Supreme Court, challenging the maintainability of the injunction suit without a declaration of title or recovery of possession.</p>\n\n<p>The Supreme Court meticulously analyzed the case, noting that a declaration of title should have been sought given the contested ownership based on a Will and the defendant's claim of co-owner possession. The Court identified inconsistencies, particularly that the plaintiff was not in actual possession of the disputed property, yet sought an injunction against interference. Consequently, the Court ruled that the injunction against interference with possession was unsustainable. However, it upheld the injunction against alienation, acknowledging that neither party had a judicially declared title to the property.</p>\n\n<p>Recognizing the unresolved substantive rights, the Supreme Court granted both parties the liberty to initiate fresh proceedings for declaration of title and consequential recovery of possession within three months. To preserve the status quo and prevent further complications, the Court directed that neither party shall alienate or encumber the disputed property until such proceedings are duly adjudicated. It explicitly stated that the findings in this specific proceeding would not prejudice or determine the rights of either party in any future litigation, ensuring a clean slate for comprehensive adjudication.</p>\n\n<p>This judgment reinforces the critical principle that a suit for injunction simpliciter is insufficient when both possession and title are contentious. It mandates that plaintiffs seeking to protect property rights must pursue appropriate reliefs, including declaration of title and recovery of possession, where actual possession is not clear. The decision serves as a pivotal reminder of the importance of sound pleadings and the necessity of aligning legal actions with established procedural channels to ensure substantive rights are properly adjudicated in property disputes.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/sc-clarifies-limits-on-injunctions-without-title-declaration.jpg"
  },
  {
    "title": "Emergency Arbitrator’s interim order is perishable – maximum shelf-life is 90 days and cannot be self-extended",
    "description": "<p>The Delhi High Court, in the case of Municipal Corporation of Delhi v. Himalayan Flora & Aromas Pvt. Ltd., has definitively ruled that an interim order issued by an Emergency Arbitrator under the DIAC Rules, 2023, has a maximum shelf-life of 90 days and cannot be extended by the Emergency Arbitrator themselves. This judgment clarifies that emergency arbitration is a swift, short-lived measure intended to provide immediate relief until a fully constituted Arbitral Tribunal can address the matter, explicitly preventing self-extensions that could render such orders perpetual.</p>\n\n<p>The dispute arose from a supply-cum-services contract between the Municipal Corporation of Delhi (MCD) and Himalayan Flora & Aromas Pvt. Ltd. Following threats by MCD to encash a performance guarantee and blacklist the company due to alleged non-performance, Himalayan Flora sought an Emergency Arbitrator to restrain MCD from taking coercive steps. An ex-parte interim order was subsequently issued, directing MCD to maintain status quo \"until the Arbitral Tribunal is constituted or for such further period as may be considered appropriate.\" This order remained effective for nearly eleven months, leading to MCD's challenge.</p>\n\n<p>The legal crux of the matter revolved around Rule 14.13 of the DIAC Rules, 2023, which states that an emergency order \"shall remain operative for a period of 90 days unless modified, substituted or vacated by the Arbitral Tribunal,\" and that \"The Arbitral Tribunal shall also have the power to extend the operation of the order beyond the period of 90 days.\" MCD argued that the specific mention of \"Arbitral Tribunal\" for extension excluded the Emergency Arbitrator, relying on the statutory definition of an Arbitral Tribunal in the Arbitration & Conciliation Act, 1996, which does not encompass an emergency appointee. Himalayan Flora contended that a purposive reading, supported by Rule 2(c) of the DIAC Rules defining \"Arbitral Tribunal\" to include an Emergency Arbitrator, should allow for such extensions.</p>\n\n<p>Justice Purushaindra Kumar Kaurav, reading Rules 14.11 and 14.13 together, established a two-tier architecture. The Emergency Arbitrator's authority is terminated after 14 days (functus officio), and their interim order's effect is limited to 90 days. The Court emphasized that the power to extend an order is explicitly reserved for the \"Arbitral Tribunal,\" signifying a more significant, legislative-type power distinct from modification or vacation. It further clarified that the inclusive definition of \"Arbitral Tribunal\" within the DIAC Rules (Rule 2(c)) cannot override the statutory framework of the 1996 Act. Allowing an Emergency Arbitrator to indefinitely extend their own orders would undermine the legislative intent for interim measures to undergo adversarial scrutiny by a regularly constituted tribunal.</p>\n\n<p>Consequently, the Delhi High Court declared the eleven-month-old Emergency Award \"inoperative and unenforceable\" after 90 days from its issuance (i.e., March 11, 2025). Recognizing the order's duration, the Court granted Himalayan Flora seven days' status quo to enable it to file a fresh interim petition before the newly appointed Arbitral Tribunal. This landmark judgment firmly establishes the temporary nature of emergency arbitration orders, underscoring that it serves as a \"tourniquet, not a transplant,\" and obligates parties seeking extended interim protection to migrate their applications to the full Arbitral Tribunal within the stipulated 90-day period.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/emergency-arbitrator-orders-expire-in-90-days-says-delhi-hc.jpg"
  },
  {
    "title": "Broken Assurances, Coerced Payments: Consumer Commission Fines IndiGo for Deficiency in Service",
    "description": "<p>The District Consumer Disputes Redressal Commission, Ernakulam, has issued a significant ruling against IndiGo Airlines, fining it for deficiency in service and unfair trade practices. This decision stems from a complaint filed by Mr. T.P. Salim Kumar, an IRS officer, who was wrongfully deboarded from his flight, subjected to broken assurances, and later publicly humiliated into making a coerced payment for services he was promised would be free.</p>\n\n<p>Mr. Kumar was deboarded due to an \"operational/technical issue\" and was promised a full refund, a confirmed seat on an earlier connecting flight, and complimentary rest and food facilities. IndiGo failed to honor these commitments; his rebooked flight was much later, and while he was directed to an airport lounge with assurances that all expenses would be covered, he was subsequently compelled to pay ₹2,150 for food and a beer under duress, facing public embarrassment and a threat of being denied boarding. IndiGo's subsequent offers of inadequate compensation were refused.</p>\n\n<p>IndiGo contested the complaint on procedural grounds, arguing misjoinder and lack of territorial jurisdiction based on a forum-selection clause. Substantively, the airline admitted offloading due to \"seat-availability constraint,\" claimed the lounge access was a \"goodwill gesture,\" and asserted that alcoholic beverages were \"expressly excluded\" from complimentary services, justifying the charge. However, the Commission dismissed IndiGo's procedural objections as \"hyper-technical,\" affirming Ernakulam's jurisdiction under the Consumer Protection Act, 2019, which supersedes one-sided contractual clauses.</p>\n\n<p>Crucially, the Commission found IndiGo's assurances regarding the connecting flight and lounge expenses to be \"uncontroverted.\" Applying the contra proferentem rule, it determined that IndiGo failed to prove any communication about the exclusion of alcoholic beverages, concluding that forcing the passenger to pay under threat of denied boarding constituted a clear \"deficiency in service\" and an \"unfair trade practice.\" Consequently, the Commission ordered IndiGo to refund the coerced ₹2,150 lounge payment and ₹626 for missed movie tickets, both with 9% annual interest. Additionally, IndiGo was directed to pay ₹1,00,000 as compensation for mental agony and inconvenience, and ₹20,000 towards the cost of proceedings, to be paid within 45 days.</p>\n\n<p>This judgment reinforces consumer rights, serving as a vital reminder to service providers, particularly airlines, that their responsibilities extend beyond mere technical compliance. The ruling underscores that statutory remedies under consumer protection laws cannot be circumvented by ambiguous contractual terms or \"hyper-technical\" defenses, thereby upholding passenger dignity and the \"relationship of trust\" inherent in air travel.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/consumer-commission-fines-indigo-for-coerced-payment.jpg"
  },
  {
    "title": "Default Is Default—Even on a Half-Disbursed Loan: NCLAT Clears Axis Bank’s CIRP Trigger",
    "description": "<p>The National Company Law Appellate Tribunal (NCLAT) has unequivocally affirmed that the Corporate Insolvency Resolution Process (CIRP) under the Insolvency & Bankruptcy Code, 2016, is triggered by a demonstrated default, irrespective of the extent of loan disbursement or the strength of collateral. In a significant ruling, the NCLAT's Principal Bench dismissed the challenge by Mr. Ammeet Kamal Agarwal, a suspended director of Supreme Transport Organisation Private Limited, thereby upholding the National Company Law Tribunal (NCLT)'s decision to admit Axis Bank Limited's Section 7 application. This judgment reinforces that arguments regarding partial disbursement, unperfected mortgages, or substantial net worth are not valid defenses once a financial creditor establishes a default exceeding the statutory threshold.</p>\n\n<p>The dispute originated from Axis Bank's sanction of a ₹24.90 crore term loan to Supreme Transport, of which only ₹12.50 crore was ultimately disbursed. Following a subsequent default, Axis Bank initiated CIRP proceedings, citing an outstanding amount of approximately ₹16.96 crore. Supreme Transport contested this, arguing that the bank's failure to release the full sanctioned amount caused its liquidity issues, that the alleged equitable mortgage was compromised due to missing title deeds, and that its substantial net worth (exceeding ₹100 crore) made insolvency unnecessary. Despite attempts by the directors to propose a One-Time Settlement (OTS) and a Section 12A withdrawal, the NCLT admitted the insolvency application, leading to the appeal before the NCLAT.</p>\n\n<p>The NCLAT's bench robustly reasoned that a borrower cannot leverage partial disbursement as a defense after having utilized the received funds without repayment. It clarified that while the enforceability of a mortgage might be affected by missing title deeds, the underlying debt remains valid. The tribunal emphasized that the IBC's one-crore default threshold operates as a binary gate, rendering the corporate debtor's asset value irrelevant once default is established. Furthermore, the court noted that the very act of submitting successive OTS and Section 12A proposals constituted an acknowledgement of default. Grievances concerning post-moratorium asset sales, the NCLAT directed, fall outside the scope of the present appeal and should be pursued in separate proceedings before the adjudicating authority.</p>\n\n<p>In conclusion, the NCLAT dismissed the appeal, upholding the NCLT's admission order. However, it clarified that the corporate debtor retains the option to present an improved Section 12A proposal for the Committee of Creditors' consideration. This judgment is a crucial milestone, solidifying the principle that default alone triggers CIRP. It provides clarity for financial creditors, asserting that commercial negotiations, mortgage enforceability, and valuation disputes are matters to be resolved within the insolvency framework rather than being used to impede its initiation. For defaulting promoters, it serves as a stark reminder that acknowledgments of debt followed by failed settlement attempts are unlikely to prevent CIRP admission at the initial stage.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/nclat-upholds-axis-banks-cirp-move-on-partial-loan-default.jpg"
  },
  {
    "title": "Aadhaar Card Holder Has Fundamental Right to Seek Alteration of Name and Other Details",
    "description": "<p>In a significant ruling, the Madurai Bench of the Madras High Court has declared that an Aadhaar card holder possesses a fundamental right, not merely a statutory one, to seek alterations or corrections to their demographic and biometric details. This right, established in P. Pushpam v. Director, UIDAI & Anr., is recognized under Article 21 of the Constitution of India, particularly when linked to the right to receive social welfare benefits, as affirmed by K.S. Puttaswamy (Aadhaar-5J.) v. Union of India.</p>\n\n<p>The case involved P. Pushpam, a 74-year-old widow, whose name and date of birth were incorrectly recorded in her Aadhaar. These discrepancies hindered the transfer of her late husband's family pension, leading her to seek judicial intervention after repeated unaddressed requests to UIDAI. The Court examined Section 31 of the Aadhaar Act, 2016, which governs alterations, and Regulation 16 of the Aadhaar (Enrolment and Update) Regulations, 2016, which lists acceptable proof documents, including pension orders for date of birth verification.</p>\n\n<p>The Court reasoned that while Section 31(3) uses \"may\" regarding alterations, in this context, it signifies a mandatory duty once the Authority is satisfied with the documentary evidence. It emphasized that statutory powers designed to confer benefits must be exercised to advance the statute's purpose. The petitioner's pension order, explicitly listing her correct date of birth, was deemed sufficient proof. Critically, the Court criticized the lack of accessible infrastructure, such as the limited Aadhaar Seva Kendras (ASKs), which forces citizens, especially the elderly, to endure long waits for essential demographic updates. It asserted that the statutory right to update Aadhaar details implies a correlative administrative duty to create necessary infrastructure and ensure accessibility.</p>\n\n<p>Drawing upon the Supreme Court's pronouncements in K.S. Puttaswamy, the Madras High Court held that when the ability to update Aadhaar details directly impacts access to social welfare benefits, it transcends a mere statutory right and becomes an integral part of the right to life and dignity under Article 21. The Court also took judicial notice of systemic difficulties in Aadhaar updates, endorsing recommendations for decentralization and improved grievance redressal.</p>\n\n<p>Consequently, the Court directed the UIDAI to promptly correct the petitioner's date of birth based on her pension order and the Court's ruling. It also mandated the expeditious transfer of the pension account once the Aadhaar correction was completed. The judgment highlighted UIDAI's submission to establish more ASKs across Tamil Nadu by March 2026, expressing hope for broader district-level accessibility. This landmark decision underscores that administrative convenience cannot override individual dignity and access to entitlements in welfare governance, reinforcing the principle that the Aadhaar system must remain citizen-centric.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/madras-hc-aadhaar-name-change-is-a-fundamental-right.jpg"
  },
  {
    "title": "When Banking on Fraud-Reporting Backfires: Delhi HC Quashes Criminal Defamation Case Against Bank CEOs",
    "description": "<p>The Delhi High Court recently quashed a criminal defamation complaint filed by Rangoli International Pvt. Ltd. against the Managing Directors and senior officials of four public-sector banks. The company had accused the bankers of \"malicious slander\" after its ₹250-crore loan account was classified as \"fraud\" and reported on the RBI/CRILC portal. Justice Neena Bansal Krishna ruled in favor of the banks, emphasizing that classifying an account as fraud, when based on central-agency requests and internal investigations, does not constitute defamation.</p>\n\n<p>The genesis of the dispute was Rangoli International's consortium facility, which became a Non-Performing Asset (NPA) by March 2015. A CBI raid on Rangoli's premises in 2014, though not resulting in a charge-sheet against the company, prompted a forensic audit by the lenders. Following inconclusive audit reports, but concurrent letters from the CBI and RBI directing banks to examine the account for fraudulent activity, the banks conducted internal re-examinations. Discovering discrepancies such as bogus airway bills, the banks, adhering to RBI Master Directions on Fraud Classification, independently declared the account \"fraud\" and uploaded this status to the CRILC/FGM portal.</p>\n\n<p>The High Court's decision was anchored on several pivotal arguments. Firstly, it affirmed that the banks were discharging a statutory duty by reporting fraud as requested by regulatory bodies, thereby protected by Exception 9 to Section 499 IPC, which safeguards good-faith accusations made to lawful authorities. The publication was limited to regulatory portals, mitigating any intent to harm reputation. Secondly, the Court reiterated that a company, being a juristic person, inherently lacks the mens rea (criminal intent) essential for defamation under Sections 499/500 IPC. Moreover, vicarious criminal liability cannot be imposed on officers without an explicit statutory provision, which is absent in the IPC for defamation. The complaint also failed to demonstrate personal involvement or malicious intent from individual officials. Finally, the absence of prior sanction under Section 197 Cr.P.C. for public servants was noted, and the complaint itself was deemed an abuse of process aimed at coercing the banks.</p>\n\n<p>This landmark judgment provides crucial clarity, underscoring that reputational grievances cannot be escalated into criminal defamation without concrete proof of personal criminal intent. By reaffirming the mens rea barrier for juristic persons and highlighting the necessity of explicit vicarious liability provisions, the Delhi High Court has reinforced good-faith compliance by financial institutions against potential penal litigation. The ruling empowers lenders to adhere to mandatory and time-bound fraud reporting guidelines without the apprehension of unwarranted criminal charges.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/delhi-hc-quashes-defamation-case-against-bank-ceos.jpg"
  },
  {
    "title": "Hindustan Unilever’s Ice Cream Division to Operate as Independent Entity: NCLT Clears Demerger into Kwality Wall’s (India) Limited",
    "description": "<p>The National Company Law Tribunal (NCLT), Mumbai, has approved the Scheme of Arrangement for the demerger of Hindustan Unilever Limited's (HUL) Ice Cream Business Undertaking into its wholly-owned subsidiary, Kwality Wall’s (India) Limited (KWIL). This significant corporate reorganization aligns with Unilever PLC's global strategy to separate its ice cream operations, positioning KWIL as an independent business entity.</p>\n\n<p>HUL's Ice Cream Business, which includes popular brands such as Kwality Wall’s, Cornetto, and Magnum, will now operate under KWIL. This move aims to provide focused management, tailored strategy, and greater flexibility for the ice cream division to pursue market opportunities independently. The scheme ensures continuity of shareholder value by granting HUL shareholders one KWIL share for every HUL share held, maintaining a 1:1 entitlement ratio.</p>\n\n<p>The NCLT approved the scheme after extensive review, confirming it was fair, reasonable, and fully compliant with all statutory and regulatory requirements. All necessary approvals from regulatory bodies, including SEBI, BSE, and NSE, were secured, and no objections were raised by stakeholders or authorities. The Tribunal affirmed that the demerger would benefit all stakeholders without prejudicing the interests of creditors or employees.</p>\n\n<p>This landmark demerger marks a strategic milestone for HUL. It paves the way for Kwality Wall’s (India) Limited to pursue focused growth in the frozen desserts and ice cream segment as a dedicated and independent company within the Unilever group in India. Concurrently, it allows HUL to consolidate resources and strategic efforts on its core fast-moving consumer goods (FMCG) portfolio, thereby enhancing overall value creation and operational efficiency. The NCLT's sanction underscores its role in facilitating transparent and compliant business realignments.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/nclt-clears-hul-ice-cream-demerger-into-kwality-walls.jpg"
  },
  {
    "title": "Supreme Court Reaffirms Protection to Bona Fide Purchasers in VAT Transactions: Commissioner, Trade & Tax.",
    "description": "<p>The Supreme Court of India, in The Commissioner, Trade and Tax, Delhi v. M/s Shanti Kiran India (P) Ltd., has decisively reaffirmed protection for bona fide purchasing dealers under the Delhi Value Added Tax Act, 2004 (DVAT Act). The Court dismissed the Department's appeals, upholding the Delhi High Court's stance that Input Tax Credit (ITC) cannot be denied to genuine purchasers solely because the selling dealer, despite being registered at the time of transaction, subsequently defaulted on depositing the collected tax with the government. This ruling carries binding legal significance, reinforcing established interpretations and safeguarding genuine business transactions.</p>\n\n<p>The dispute originated from the Department's denial of ITC to purchasing dealers, including M/s Shanti Kiran India (P) Ltd., who had bought goods from validly registered sellers, paid VAT, and possessed proper tax invoices. The Department argued that since the selling dealers later had their registrations cancelled and failed to remit the collected VAT to the treasury, the corresponding ITC claimed by the purchasers was inadmissible.</p>\n\n<p>The Delhi High Court had previously \"read down\" Section 9(2)(g) of the DVAT Act, which stated that ITC would not be allowed if the tax payable by the selling dealer had not been deposited. The High Court reasoned that this provision should not penalize bona fide purchasing dealers acting in good faith without collusion or fraud. It emphasized that the Department's remedy lies against the defaulting seller, not the innocent buyer, to avoid rendering the provision arbitrary and unconstitutional.</p>\n\n<p>The Supreme Court concurred, finding no reason to interfere with the Delhi High Court's judgment. It observed that denying ITC in such circumstances would be unjustified, especially given its earlier confirmation of similar High Court reasoning. The Court concluded that the appeals lacked merit, thereby upholding the right of bona fide dealers to claim ITC.</p>\n\n<p>This concise yet impactful order holds substantial jurisprudential value. It clarifies the scope of Section 9(2)(g), ensuring that honest taxpayers are protected from the defaults of their sellers, provided they have conducted genuine transactions with registered dealers and possess valid documentation. The ruling aligns with broader principles of \"buyer protection\" seen in other indirect tax regimes, such as GST, strengthening the continuity of judicial thought favouring equity, proportionality, and constitutional fairness in tax administration. For businesses, it provides crucial clarity and reassurance that compliance obligations will not extend beyond what is reasonable and just.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/supreme-court-upholds-itc-rights-of-bona-fide-dealers.jpg"
  },
  {
    "title": "Pay First, Recover Later: SC Reiterates Humanitarian Approach in Motor Accident Compensation",
    "description": "<p>In a landmark ruling, the Supreme Court of India, in K. Nagendra v. New India Assurance Co. Ltd., reaffirmed the victim-centric principle in motor accident compensation, holding that an insurer cannot deny compensation to accident victims due to technical policy breaches, such as a vehicle operating beyond its sanctioned route permit. This decision underscores the social justice intent of the Motor Vehicles Act, 1988, positioning motor insurance as a public welfare instrument rather than merely a private contract. The core of the judgment relies on the \"pay and recover\" doctrine, ensuring immediate compensation for victims while preserving the insurer's right to seek recovery from the vehicle owner for proven contractual violations.</p>\n\n<p>The case originated from a fatal motor accident involving a bus, owned by K. Nagendra and insured by New India Assurance Co. Ltd., which was allegedly plying outside its permitted route. While the Motor Accidents Claims Tribunal awarded compensation, the insurer challenged it, citing a fundamental breach of policy conditions. The central legal question before the Apex Court was whether a route permit violation absolves the insurer from third-party liability or if it must still compensate victims before seeking recovery from the vehicle owner.</p>\n\n<p>The Supreme Court emphatically stated that an insurer cannot escape liability to third parties solely because the vehicle operated outside its sanctioned route. It emphasized that the essence of compulsory insurance under the Motor Vehicles Act is to prevent victims from being left uncompensated due to technical defaults. The Court reiterated the \"pay and recover\" mechanism, directing the insurer to first disburse compensation to the victims and then recover the amount from the vehicle owner if the policy breach is established. This approach judiciously balances the protection of third-party rights with the insurer's contractual interests. While prioritizing victim compensation, the Court also clarified that the insurer's obligations are not unlimited, respecting contractual boundaries where liability clearly falls outside the agreed framework.</p>\n\n<p>Consequently, the Supreme Court upheld the High Court's decision, directing New India Assurance Co. Ltd. to pay the awarded compensation to the victims' dependents and subsequently recover the sum from the vehicle owner, K. Nagendra. This judgment reinforces the imperative of prompt compensation for accident victims, regardless of technical infractions, while also ensuring contractual accountability for vehicle owners who violate permit conditions. The ruling solidifies the integrity of India's motor accident compensation system by embodying both judicial empathy for victims and fairness for insurers.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/sc-upholds-pay-and-recover-in-motor-accident-claims.jpg"
  },
  {
    "title": "Registrar Has No Statutory Authority to Issue NOC for Redevelopment, Rules Bombay High Court",
    "description": "<p>The Bombay High Court has issued a significant ruling, asserting that the Registrar of Cooperative Societies lacks the statutory authority to issue a \"No Objection Certificate\" (NOC) for the redevelopment of cooperative housing societies. This judgment, delivered by Justice Amit Borkar, clarifies that such approvals have no legal basis under the Maharashtra Cooperative Societies Act, 1960, or its associated Rules, 1961. The Court unequivocally stated that the General Body of a cooperative housing society remains the ultimate and supreme authority for all redevelopment decisions, provided procedural compliance and transparency are maintained.</p>\n\n<p>The ruling stemmed from a challenge to an NOC granted by a District Deputy Registrar. The Court found no legal provision empowering the Registrar to approve or reject redevelopment decisions, deeming any such issuance ultra vires. Instead, the Court clarified that the Registrar's role, as per the Government Resolution dated 4 July 2019, is strictly supervisory. This involves nominating an Authorised Officer to attend Special General Meetings (SGMs) for developer selection, ensuring quorum, fair voting, and proper record-keeping, without exercising any power to veto or modify the society's decisions.</p>\n\n<p>Consequently, any NOC previously issued by the Registrar for redevelopment is legally invalid, and decisions lawfully made by the society's General Body remain enforceable. Justice Borkar directed all Registrars across the State to refrain from issuing or insisting upon such NOCs and mandated the Commissioner of Cooperation and the Principal Secretary, Cooperation Department, to issue a departmental circular reiterating these directives. Societies are still required to follow prescribed safeguards, including requesting an Authorised Officer and maintaining proper documentation for transparency.</p>\n\n<p>This landmark judgment significantly enhances the autonomy of cooperative housing societies, streamlines redevelopment processes by removing unnecessary administrative hurdles, and reinforces the General Body's decision-making authority. It is expected to foster faster, fairer, and more transparent redevelopment projects throughout Maharashtra by clearly defining the Registrar's role as purely supervisory rather than one of control or approval.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/registrar-lacks-power-to-approve-redevelopment-bombay-hc.jpg"
  },
  {
    "title": "Delhi High Court Upholds Crocs’ Design and Brand Integrity in Questsole Dispute",
    "description": "<p>The Delhi High Court has issued an ex-parte ad-interim injunction in favor of Crocs Inc. and its subsidiary, affirming the protection of their extensive intellectual property rights against Sagar Doijode, trading as Questsole, and others. The suit, filed before the Delhi High Court, sought a permanent injunction for alleged infringement of Crocs' patents, trademarks, registered designs, and distinctive trade dress.</p>\n\n<p>Crocs alleged that Questsole was manufacturing, advertising, and selling footwear and shoe charms that were identical or deceptively similar to their products. Specifically, the defendants were accused of infringing Patent No. IN 271337, which covers the system for attaching decorative accessories (Jibbitz) to shoes, and of copying the registered design No. 349374-001 for Crocs' iconic clog-style footwear. Furthermore, Questsole was found to be using deceptive marks like “CROCKS,” “CROC,” and “JIBIT,” infringing Crocs' registered trademarks “CROCS” and “JIBBITZ.” The defendants also imitated Crocs’ distinctive trade dress, characterized by the clogs' unique bulbous shape, ventilation holes, and back strap design, and posted disparaging videos online.</p>\n\n<p>Justice Tejas Karia, after reviewing the evidence, determined that Crocs Inc. possessed substantial global goodwill, reputation, and valid intellectual property registrations. The Court observed that the defendants' actions, including the use of deceptively similar marks and designs, appeared to be a dishonest attempt to exploit Crocs’ established brand identity and create consumer confusion. A test purchase confirmed direct patent infringement, and the visual and structural resemblance between the defendants' products and Crocs' registered design and trade dress was deemed fraudulent imitation, leading to dilution of Crocs’ distinctiveness.</p>\n\n<p>Based on these findings, the Delhi High Court concluded that Crocs Inc. had established a prima facie case for interim relief, with the balance of convenience lying in its favor and a risk of irreparable harm if an injunction was not granted. Consequently, the Court restrained the defendants from using the infringing marks, manufacturing or selling products embodying Crocs' patented system, imitating its registered design, or copying the distinctive trade dress of Crocs’ geometric clogs. The matter is scheduled for further hearing on February 16, 2026.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/delhi-hc-protects-crocs-ip-rights-against-questsole.jpg"
  },
  {
    "title": "Supreme Court Clarifies: Redeemable Preference Shareholders Are Not Financial Creditors Under IBC",
    "description": "<p>The Supreme Court of India, in the case of EPC Constructions India Limited (Through Its Liquidator) v. Matix Fertilizers and Chemicals Limited, has definitively ruled that holders of Cumulative Redeemable Preference Shares (CRPS) are not to be treated as financial creditors under the Insolvency and Bankruptcy Code, 2016 (IBC). This landmark decision reinforces the statutory distinction between share capital and debt, asserting that preference shareholders are investors, not lenders, and their claims for redemption cannot constitute a \"financial debt\" to trigger insolvency proceedings under Section 7 of the IBC.</p>\n\n<p>The dispute originated from EPC Constructions India Limited (EPCC) converting outstanding receivables of ₹250 crore from Matix Fertilizers and Chemicals Limited into 8% CRPS. When Matix failed to redeem these shares due to a lack of profits or fresh issue proceeds, EPCC's liquidator filed an application under Section 7 of the IBC, contending that Matix had defaulted on a \"financial debt.\" Both the NCLT and NCLAT dismissed this petition, leading to the appeal before the Supreme Court.</p>\n\n<p>The Supreme Court's analysis highlighted several key points. It affirmed that preference shares constitute part of a company's share capital under the Companies Act, 2013, and do not represent loans. Therefore, even if redemption is due, failure to redeem does not transform shareholders into creditors. The Court emphasized that redemption under Section 55 of the Companies Act is contingent upon the availability of distributable profits or proceeds from a fresh issue of shares, which Matix lacked. Furthermore, the conversion of receivables into shares extinguished the original debt, making it a conscious equity investment rather than a disguised loan. The Court also rejected arguments based on accounting treatment classifying CRPS as \"unsecured loans,\" stating that accounting standards cannot override the legal nature of a transaction. Finally, it clarified that the \"commercial effect of borrowing\" test under Section 5(8)(f) of the IBC applies only to genuine debt transactions involving the disbursal and time value of money, which equity instruments like CRPS inherently lack.</p>\n\n<p>This ruling by the Supreme Court critically reinforces the distinction between equity and debt within corporate finance. It safeguards the IBC from being invoked as a mechanism for recovering equity investments and underscores that share capital retains its equity character until lawfully redeemed in accordance with the Companies Act. The judgment contributes to strengthening corporate governance by promoting investor discipline and preserving the integrity of corporate capital structures.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/sc-redeemable-preference-shares-not-financial-debt.jpg"
  },
  {
    "title": "Delhi High Court Affirms Validity of Full and Final Settlement in Subcontract Recovery Dispute",
    "description": "<p>The Delhi High Court recently issued a significant judgment affirming the validity of a full and final settlement in a subcontract recovery dispute between M/S BS Enviro N Infracon Pvt. Ltd. (Appellant) and VIJ Contracts Pvt. Ltd. (Respondent). The core of the case involved the Appellant's claim for an outstanding amount of Rs. 50,41,835/- related to an 800 KLD Sewage Treatment Plant (STP) subcontract, following the Trial Court's dismissal of its recovery suit. The central question revolved around whether a document signed by the parties constituted a conclusive settlement of all claims.</p>\n\n<p>The dispute originated from the Appellant subcontracting its services to the Respondent for an STP project with a total contract value of Rs. 1,28,80,000/-. After receiving partial payments, the Appellant initiated MSME Samadhaan proceedings for a claimed balance of Rs. 50,41,835/-. A pivotal meeting on September 26, 2019, resulted in a document recording a net balance of Rs. 14,68,165/-, subject to the Appellant withdrawing its MSME notice. The Respondent issued cheques for this agreed amount, which the Appellant encashed. However, the Appellant failed to withdraw the MSME notice and continued to pursue further claims, which were subsequently dismissed by an arbitral award and later by the Trial Court.</p>\n\n<p>The Appellant contended that the September 26, 2019 document merely recorded \"on account\" payments to maintain the contract, not a full discharge of liabilities. They also sought release of unbilled contract value and retention amounts, asserting substantial performance. Conversely, the Respondent argued that the document represented a full and final settlement and a novation of prior obligations under Section 62 of the Indian Contract Act, 1872, with the encashment signifying acceptance.</p>\n\n<p>The High Court meticulously examined the evidence, concluding that the September 26, 2019 document, acknowledged by the Appellant's Director, clearly established a full and final settlement. The Court held that the Appellant's act of encashing the cheques, coupled with the contemporaneous records, constituted \"accord and satisfaction\" and a \"novation\" of all accrued claims under Sections 62 and 63 of the Indian Contract Act. It emphasized that voluntary acceptance of a lesser sum in satisfaction of a claim bars subsequent pursuit of the balance. The Court dismissed the Appellant's \"on account\" argument as inconsistent with the signed agreement and their subsequent actions. Furthermore, claims for unbilled contract value and retention amounts were rejected, as the Appellant failed to demonstrate substantial performance—having supplied materials but not completed essential installation, testing, or commissioning—or that the conditions for release of retention had matured.</p>\n\n<p>In conclusion, the Delhi High Court upheld the Trial Court's decision, affirming that the settlement reached on September 26, 2019, effectively discharged all prior claims and barred the Appellant from pursuing further recovery for those matters.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/delhi-hc-upholds-full-final-settlement-in-contract-dispute.jpg"
  },
  {
    "title": "Security Cheques vs. Enforceable Debt: Delhi High Court Reiterates Limits of Section 138 NI Act",
    "description": "<p>The Delhi High Court, in the case of Sri Sai Sapthagiri Sponge Pvt. Ltd. v. State (GNCT of Delhi) & Anr., has delivered a significant judgment clarifying the boundaries of Section 138 of the Negotiable Instruments Act, 1881. The Court quashed multiple complaints, reiterating that cheques issued merely as security or for audit purposes do not constitute instruments issued in discharge of a legally enforceable debt, and thus do not attract criminal liability under the Act. The ruling also addressed critical jurisdictional and procedural flaws in the handling of cheque dishonour cases.</p>\n\n<p>A central point of the judgment was the distinction between security cheques and those issued for existing debt. The Court found that the Memorandum of Understanding (MoU) explicitly stated the cheques were issued \"for security purpose only\" and \"not for depositing into bank.\" This contractual clarity was pivotal, leading the Court to conclude that such cheques could not be treated as having been issued in satisfaction of a legally recoverable debt or liability, which is a prerequisite for invoking Section 138 NI Act.</p>\n\n<p>Furthermore, the High Court highlighted a significant jurisdictional error. The original complaints were filed in Bellary but later returned due to a lack of territorial jurisdiction, aligning with the Supreme Court's ruling in Dashrath Rupsingh Rathod. Subsequently, when the complaints were refiled in New Delhi, the Metropolitan Magistrate adopted the summoning orders previously issued by the Bellary court, instead of issuing fresh summons after due application of mind. The Court held that any proceedings, including summoning orders, conducted by a court lacking jurisdiction are \"non-est in law,\" rendering the adopted orders and all subsequent proceedings null and void.</p>\n\n<p>This decision from the Delhi High Court reinforces two critical legal principles: it safeguards businesses by clarifying that security cheques, when demonstrably not for a present debt, cannot lead to criminal liability under Section 138 NI Act; and it stresses the fundamental importance of procedural propriety and strict adherence to territorial jurisdiction in judicial proceedings. The judgment thereby strengthens the balance between commercial accountability and procedural fairness, preventing the criminalization of civil disputes in cheque transactions.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/delhi-hc-security-cheques-not-enforceable-under-ni-act.jpg"
  },
  {
    "title": "Concealment of Free Seats Amounts to Unfair Trade Practice: Maharashtra Commission Finds Emirates Airlines Deficient in Service",
    "description": "<p>The Maharashtra State Consumer Disputes Redressal Commission, Mumbai, has ruled that Emirates Airlines engaged in deficiency of service and unfair trade practice by misleading passengers into paying for seat selection when free adjacent seats were available. This significant decision, stemming from the case of Emirates Airlines v. Dr. Keshab Nandy & Anr., upheld a District Forum's order compelling the airline to refund ₹7,200 with interest and provide compensation for mental agony and litigation costs. Notably, the ruling is one of the first judicial recognitions in India of \"dark patterns\"—deceptive online design practices that manipulate consumer choice—within consumer jurisprudence, highlighting a growing emphasis on transparency in digital consumer interactions.</p>\n\n<p>The case involved Dr. Keshab Nandy, a diabetic and hypertension patient, and his wife, Mrs. Meenu Pandey, who pre-booked adjacent seats online for ₹7,200 for a Mumbai-New York flight in 2017 to ensure Dr. Nandy received assistance. Upon arrival at the airport, they discovered numerous free adjacent seats that other passengers had availed without charge. This led them to allege that Emirates had falsely led them to believe paid pre-booking was the only option for guaranteed adjacent seating, constituting a deficiency in service and unfair trade practice under the Consumer Protection Act, 1986.</p>\n\n<p>Emirates Airlines contended that seat selection was an optional, voluntary, and non-refundable service, and that free selection was available 48 hours before departure. However, the Commission rejected this argument, finding that Emirates failed to disclose crucial information regarding the availability of free adjacent seats. It emphasized that the airline's online interface created a false impression of scarcity and compelled passengers like the complainants to make unnecessary payments, thereby violating the principles of transparency and informed consent.</p>\n\n<p>Ultimately, the State Commission dismissed Emirates' appeal, affirming the District Forum's directive for a refund of ₹7,200 with 9% interest from the complaint date, ₹10,000 for mental agony, and ₹10,000 for litigation costs. This ruling is a progressive affirmation of consumer rights in the digital age, expanding the scope of unfair trade practices to encompass manipulative online design and the omission of key information. It sends a clear message to airlines and digital service providers about the importance of transparency and fairness in all consumer interactions, both online and offline, to prevent consumer exploitation.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/emirates-penalized-for-hiding-free-seats-dark-pattern-case.jpg"
  },
  {
    "title": "Medical Devices Step Out of Legal Metrology (Packaged Commodities) Shadow: 2025 Amendment Ends Labelling Confusion",
    "description": "<p>The Legal Metrology (Packaged Commodities) Amendment Rules, 2025 has significantly revised the regulatory framework for medical device packaging, effectively exempting these products from the general consumer packaging regulations. This amendment, enacted under the Legal Metrology Act, 2009, resolves a decade-long conflict and overlap between the Legal Metrology rules and the specialized Medical Devices Rules, 2017 (under the Central Drugs Standard Control Organisation - CDSCO).</p>\n\n<p>The Central Government utilized its power to exempt specific package classes, making the Medical Devices Rules, 2017 the exclusive authority for all labelling declarations on medical device packages. This change is integrated by amending Rule 2(h) of the 2011 Packaged Commodities Rules, which now specifically carves out \"packages containing medical devices\" from the definition of a \"pre-packaged commodity.\" Consequently, previous requirements for precise typographic measurements (Rules 7(2) and 7(3)) are no longer applicable; instead, the 2017 Rules' focus on legibility and contrast will govern. Furthermore, Rule 33 clarifies that no Legal Metrology waivers or concessions apply where the Medical Devices Rules, 2017 are in effect, solidifying the medical device regime as the sole compliance pathway.</p>\n\n<p>This amendment addresses a history of jurisdictional confusion, conflicting court rulings, and operational burdens on manufacturers who previously had to comply with two distinct regulatory bodies. The operational impact for manufacturers is immediate, promising shorter artwork cycles, elimination of redundant dual-language stickers, and faster import clearances. For consumers, essential safeguards on safety, performance, and traceability remain intact, with the enforcement authority now solely under CDSCO. This regulatory adjustment represents a strategic \"de-harmonisation through harmonisation,\" aligning medical devices under a single, more specialized legal framework.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/medical-devices-exit-legal-metrology-labelling-rules.jpg"
  },
  {
    "title": "Won the Battle, Must Win the War: Rajasthan High Court Enforces United Kingdom GAFTA Award",
    "description": "<p>The Rajasthan High Court at Jaipur has ordered the enforcement of a London-seated GAFTA (Grain and Feed Trade Association) appeal award, effectively converting it into a decree of the Court. This judgment concludes a seven-year dispute involving an Austrian company, Kingsroad Handelsgesellschaft m.b.H., and an Indian entity, Raj Grow Impex LLP, over three container-loads of yellow peas. The ruling is significant for its reaffirmation of the narrow interpretation Indian courts apply to the \"public policy\" defense against foreign award enforcement.</p>\n\n<p>The dispute originated from three back-to-back contracts in September 2018 for Russian-origin yellow peas, brokered with a standard GAFTA arbitration clause. Following contentious issues over price, demurrage, and container free-time, Kingsroad initiated arbitration in London. The first-tier GAFTA tribunal upheld Kingsroad's claim in August 2020, a decision confirmed by the GAFTA Board of Appeal in September 2021. Raj Grow failed to challenge or set aside the award within the stipulated 28-day window in England.</p>\n\n<p>Subsequently, Kingsroad petitioned the Rajasthan High Court for the award's enforcement as a decree, execution against Raj Grow's assets, and costs. Raj Grow resisted enforcement, citing \"patent illegality\" and \"violation of Indian public policy.\" Their primary contention was that Kingsroad's direct payment of container detention charges to shipping lines outside India deprived Raj Grow of input GST credit, leading to revenue loss for the Indian government and thus offending fundamental Indian law, national interest, and morality.</p>\n\n<p>Justice Anoop Kumar Dhand, noting Raj Grow's prior inaction in the arbitration proceedings and abroad, emphasized that Section 48 of the Arbitration and Conciliation Act, 1996, mandates a skeletal inquiry, precluding a review of merits or re-appreciation of evidence. Drawing upon Supreme Court precedents like Vedanta, Avitel Post Studioz, and Shri Lal Mahal, the Court reiterated that \"public policy\" must be construed narrowly, limited to violations of fundamental Indian law, national interest, or basic notions of justice/morality. The Court found that a grievance regarding GST leakage, even if true, constituted a contractual accounting dispute already adjudicated, which neither shocked the conscience nor struck at the root of India's economic order, thus not meeting the stringent public policy threshold.</p>\n\n<p>As a result, the GAFTA Appeal Award was declared enforceable and converted into a decree of the Rajasthan High Court. Raj Grow has been directed to disclose all its assets within six weeks for execution proceedings, while Kingsroad is free to pursue attachment and sale. This judgment strongly reinforces India's pro-enforcement stance towards foreign arbitral awards, limiting merit-based objections and providing greater assurance to international award holders seeking realization of their claims in India.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/rajasthan-hc-enforces-uk-gafta-award-limits-public-policy.jpg"
  },
  {
    "title": "Bombay High Court Reiterates: Borrowers Cannot Demand One-Time Settlement as a Matter of Right",
    "description": "<p>In a significant ruling, the Bombay High Court (Nagpur Bench) in Ms. Archana Wani v. Indian Bank & Ors. affirmed that borrowers or guarantors do not possess a right to demand a One-Time Settlement (OTS), nor can courts compel banks to disclose internal settlement benchmarks or accept settlement proposals. The Court emphasized that loan recovery and settlement decisions fall squarely within the commercial wisdom of banks, which manage public funds and are bound by financial discipline. Judicial intervention under Article 226 of the Constitution is unwarranted, particularly when statutory remedies under the SARFAESI Act, 2002, and the Insolvency and Bankruptcy Code, 2016 (IBC), are available.</p>\n\n<p>The case involved Ms. Archana Wani, a guarantor for a defaulted loan of ₹62 crore, whose account was declared a Non-Performing Asset (NPA). After the bank initiated recovery proceedings under SARFAESI and IBC, Ms. Wani submitted multiple OTS proposals. These were rejected by the bank for not meeting its \"benchmark criteria,\" which the petitioner argued were arbitrarily withheld. She sought judicial intervention to compel the bank to disclose its standards and accept her proposal.</p>\n\n<p>The High Court meticulously reviewed the contractual obligations and statutory frameworks, concluding that a bank's decision on an OTS proposal is a purely commercial one based on internal policies and risk assessment. The Court reiterated that an OTS proposal does not confer any enforceable right upon the borrower, and banks are not statutorily obligated to disclose their internal benchmark parameters. Relying on established Supreme Court precedents, the Bench highlighted that compelling banks to settle on terms dictated by borrowers would undermine financial prudence and public interest. Consequently, the High Court dismissed the petition, reiterating that OTS schemes are discretionary concessions, not enforceable rights, and that negotiation, not entitlement, is the pathway to settlement. The interim stay on recovery was, however, continued for six weeks to allow the petitioner to explore alternate remedies.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/bombay-hc-no-right-to-one-time-settlement-for-borrowers.jpg"
  }
]