[
  {
    "title": "Deepfakes, AI, and the Law: Protecting Celebrity Personality Rights in India",
    "description": "<p>India's legal framework for protecting the personality rights of public figures is evolving through judicial interpretation of existing laws and constitutional principles. These rights are rooted in the right to privacy, with the right of publicity recognized as a proprietary right that allows celebrities to control and monetize their persona. The right to privacy, constitutionally backed by Article 21, protects individuals from unwanted exposure and misrepresentation, which has been reinforced in digital safety rulings such as the Madras High Court’s 2025 judgment in X v. Union of India.</p>\n\n<p>Legal safeguards include the Copyright Act, 1957 (moral rights for performers), the Trademarks Act, 1999 (protection of names and catchphrases), and the common law tort of \"passing off,\" which prevents misleading endorsements. The judiciary grants injunctions to prevent unfair exploitation, and intermediary liability under the IT Act, 2000 and the IT Rules, 2021 mandates expedited notice-and-takedown mechanisms.</p>\n\n<p>Recent Delhi High Court interim orders, particularly in *Aishwarya Rai Bachchan v. Aishwaryaworld.com & Ors.* and *Abhishek Bachchan v. The Bollywood Tee Shop & Ors.*, address challenges from AI and deepfake technology. These cases involved unauthorized use of the Bachchans' personas, including the sale of merchandise, fake websites, and AI-generated content. The court issued injunctions requiring platforms to remove infringing content, emphasizing the financial and reputational harm caused by unauthorized use.</p>\n\n<p>These rulings reaffirm the judiciary's commitment to protecting individual dignity against technological threats. They signify a shift where personality rights are viewed as integral to dignity, privacy, and autonomy, not just economic entitlements. With increasing AI-driven misuse, legislative codification of personality rights in India is becoming essential.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/deepfakes-ai-law-protecting-celebrity-rights-india.jpg"
  },
  {
    "title": "Supreme Court Upholds Testamentary Succession Over State Escheat Claims",
    "description": "<p>The Supreme Court of India, in *State of Rajasthan v. Ajit Singh & Ors.*, has reinforced the primacy of testamentary succession, clarifying that the doctrine of escheat under Section 29 of the Hindu Succession Act, 1956, is applicable only when an individual dies intestate without legal heirs. The Court affirmed that a validly executed and probated Will dictates the devolution of property, precluding the State's intervention based on escheat claims.</p>\n\n<p>The case originated from the estate of Raja Bahadur Sardar Singh, who created the Khetri Trust via a Will and Codicil prior to his death in 1987. While the initial probate petition was dismissed, the Division Bench of the Delhi High Court later overturned this decision, upholding the Will's validity. The State of Rajasthan appealed, asserting its right to the property based on the claim that the testator died without heirs.</p>\n\n<p>The Supreme Court dismissed the State's challenge, emphasizing that the State lacks the standing to contest a validly executed Will. The ruling underscores the significance of adhering to the testator’s intent and reinforces the limits of governmental intervention in succession matters. The Court's decision reaffirms the principle that escheat is a remedy of last resort, applicable only in the absence of both a Will and legal heirs. This ruling strengthens the legal position of trusts and legatees, and enhances certainty in succession law.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/sc-rules-valid-will-overrides-states-escheat-claims.jpg"
  },
  {
    "title": "Identity, Dignity, and the Law: Constitutional Protection of Name Change in India",
    "description": "<p>The right to change one's name in India is constitutionally protected under Articles 19(1)(a) and 21, as affirmed by the High Court of Jammu & Kashmir and Ladakh in *Mohd. Hassan v. Union Territory of J&K & Ors.* This right stems from the fundamental freedoms of speech and expression, as well as the right to life and personal liberty, encompassing dignity and individuality. The court emphasized that any curtailment of this right must meet the test of reasonableness under Article 19(2), allowing restrictions only in cases involving fraud, criminality, or overriding public interest.</p>\n\n<p>In the *Mohd. Hassan* case, the petitioner, originally named Raj Wali, sought to change his name to Mohd. Hassan. The Jammu & Kashmir Board of School Education rejected his application to update his educational certificates, citing a limitation period and lack of provision for such changes. The High Court overturned this decision, clarifying that the limitation period applied only to corrections of errors, not substantive name changes. The court emphasized that constitutional rights prevail over administrative rules, and that public documents reflecting the changed name hold statutory presumption of correctness under the Indian Evidence Act.</p>\n\n<p>The judgment aligns with a broader judicial consensus among Indian High Courts, including Allahabad, Kerala, and Delhi, which recognize the right to change one's name as a constitutionally guaranteed entitlement under Articles 19(1)(a) and 21. This jurisprudence highlights that a name is central to individuality. The decision in *Mohd. Hassan* reinforces the principle that administrative rules must operate within the framework of constitutional guarantees, safeguarding identity autonomy and recognizing names as reflections of individuality, culture, and dignity.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/name-change-in-india-constitutional-right-affirmed.jpg"
  },
  {
    "title": "Promotion and Regulation of Online Gaming in 2025: A Landmark in Digital Policy",
    "description": "<p>The Promotion and Regulation of Online Gaming Bill, 2025, represents a significant development in India's digital legal framework, aiming to mitigate the social and economic harms of predatory online money games while simultaneously fostering e-sports and safe recreational gaming. This legislation balances innovation and responsibility, ensuring societal benefits from digital progress without exposing individuals to exploitation.</p>\n\n<p>The Bill addresses the exponential growth of online gaming platforms and the associated risks, including financial losses, addiction, and misuse for illicit activities such as money laundering. Recognizing the potential of India's gaming sector, the Bill establishes a comprehensive framework to manage these risks.</p>\n\n<p>Key provisions include the recognition of e-sports, promotion of social and educational games, and a complete prohibition of online money games. A national regulatory authority will oversee permissible games, issue compliance guidelines, and address public grievances. Stringent penalties, including imprisonment and fines, are in place for violations, and corporate liability is imposed on companies involved in prohibited activities.</p>\n\n<p>The legislation aligns with existing frameworks such as the Information Technology Act, 2000, and the Bharatiya Nyaya Sanhita, 2023, and also includes GST regulations for digital platforms. This Bill will protect individuals from exploitative gaming platforms and stimulate the growth of e-sports and social gaming, positioning India as a hub for digital innovation and employment.</p>\n\n<p>The Bill promotes responsible digital governance and sets a precedent for other jurisdictions facing similar challenges. It ensures that technology empowers rather than harms society, balances the risks of digital exploitation with the opportunities of constructive digital engagement and sets a strong foundation for responsible innovation. Continuous regulatory adaptation and industry cooperation will be essential to ensure that India achieves the dual goals of protecting citizens and fostering a thriving digital gaming ecosystem.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/online-gaming-regulation-india-2025-key-legal-reforms.jpg"
  },
  {
    "title": "Equal Coparcenary Rights and Limits of Review: Supreme Court Clarification",
    "description": "<p>The Supreme Court of India's judgment in *Malleeswari v. K. Suguna & Anr.* (2025) reaffirms the equal coparcenary rights of daughters under the Hindu Succession (Amendment) Act, 2005, and the Tamil Nadu Amendment Act of 1989. The ruling emphasizes that these claims cannot be easily dismissed. Concurrently, it underscores the limited scope of judicial review, which is restricted to correcting evident errors and not a disguised appeal.</p>\n\n<p>The case originated from a partition suit filed in 2000, excluding Malleeswari. After a series of property transfers and her father's death, Malleeswari sought amendment of the preliminary decree in 2018 to reflect her coparcenary rights based on the 1989 and 2005 amendments. The Trial Court dismissed her application, but the High Court initially recognized her rights before reversing its decision on review.</p>\n\n<p>The Supreme Court addressed two key issues: the enforceability of Malleeswari's coparcenary rights despite the 2003 decree and whether the High Court exceeded its review jurisdiction. The Court held that the High Court improperly expanded the scope of review by re-evaluating settled facts. The Supreme Court allowed the appeal, reinstating the High Court's original order which recognized Malleeswari's one-third coparcenary share and directed the Trial Court to expedite pending applications.</p>\n\n<p>The judgment is significant as it reinforces the statutory rights of daughters and defines the boundaries of appellate and review jurisdiction. The Court acknowledged the layered statutory framework, including the Tamil Nadu Amendment Act of 1989. The decision protects against the misuse of review proceedings, thereby strengthening both substantive justice in succession law and procedural integrity in civil litigation.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/sc-upholds-daughters-coparcenary-rights-limits-review.jpg"
  },
  {
    "title": "The Income-tax Act, 2025: A Modern Framework for Direct Taxation in India",
    "description": "<p>The Income-tax Act, 2025, a comprehensive reform of India's direct tax framework, received Presidential assent on August 21, 2025, and is set to replace the Income-tax Act, 1961, effective April 1, 2026. The legislation aims to establish a simpler, fairer, and more digitally-aligned tax system. Its key objectives include simplifying the law, providing certainty on digital assets and cross-border transactions, ensuring equity for middle-income taxpayers through revised slabs, and modernizing administration with technology-driven processes.</p>\n\n<p>Structurally, the Act replaces the \"Previous Year\" and \"Assessment Year\" system with a single \"Tax Year\" definition. It streamlines provisions, removes archaic clauses, and simplifies drafting while maintaining legal rigor. Transitional arrangements are in place to ensure continuity for pending assessments and preservation of accumulated entitlements.</p>\n\n<p>For individuals, the new regime is the default, offering complete relief up to ₹4,00,000 income, with a more generous rebate under Section 87A, potentially resulting in no liability for taxpayers up to ₹12,00,000. For corporations, existing competitive tax rates are maintained, and Minimum Alternate Tax (MAT) rules are clarified. International taxation aligns with OECD's BEPS standards, with the equalisation levy retained and strengthened reporting obligations for non-residents.</p>\n\n<p>Significantly, the Act formally recognizes Virtual Digital Assets (VDAs), bringing cryptocurrencies and NFTs into the statutory framework. It modernizes compliance through digital processes, including refunds for belated returns, clarified tax deduction and collection rules, and expanded faceless assessments. The Central Board of Direct Taxes (CBDT) remains the apex authority, and the five classical heads of income are retained for continuity.</p>\n\n<p>The Income-tax Act, 2025 is expected to reduce litigation, improve compliance, and enhance India’s credibility in taxation. Individuals will benefit from revised slabs, while corporations gain stability. The legislation sets the stage for a more transparent, equitable, and efficient tax regime.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/income-tax-act-2025-modern-framework-for-taxation.jpg"
  },
  {
    "title": "The National Sports Governance Act, 2025: A New Era for Indian Sports",
    "description": "<p>The Government of India has enacted The National Sports Governance Act, 2025, a comprehensive legislative reform designed to modernize the nation's sports administration. The Act aims to promote sports development, ensure athlete welfare, and establish ethical practices aligned with Olympic, Paralympic, and international standards. It provides a unified system for resolving sports-related grievances, fostering a professional, transparent, and athlete-centric ecosystem.</p>\n\n<p>A core objective of the Act is establishing structured frameworks for the recognition and operation of National Sports Bodies. It mandates a single National Olympic Committee and National Paralympic Committee, requiring all bodies to have international recognition and affiliation. The newly created National Sports Board holds the power to grant, suspend, or cancel recognition, which is essential for accessing government grants and financial assistance.</p>\n\n<p>To ensure ethical and transparent operations, the Act introduces strict governance and compliance requirements. Key policies and committees are established to promote ethical conduct, athlete welfare, and effective oversight within the sports ecosystem.</p>\n\n<p>The Act establishes the National Sports Board and the National Sports Tribunal to oversee sports governance. The Board is responsible for policy, regulation, and recognition, while the Tribunal serves as an independent body for resolving disputes.</p>\n\n<p>In conclusion, The National Sports Governance Act, 2025, is a transformative piece of legislation poised to bring significant reform to Indian sports. By emphasizing good governance, transparency, accountability, and athlete welfare, and establishing dedicated bodies, the Act lays the foundation for a robust sports culture and strengthens India's reputation in global sports.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/national-sports-governance-act-2025-key-reforms-explained.jpg"
  },
  {
    "title": "Rajasthan High Court Upholds Child's Right to Education, Dismissing Technicalities",
    "description": "<p>The Rajasthan High Court, Jaipur Bench, ruled in favor of a minor, Master Daivik Rangwani, reinforcing the fundamental right to education under Article 21-A of the Constitution and the Right of Children to Free and Compulsory Education Act, 2009 (RTE Act). The court directed Vardhman International School, Jaipur, to admit Master Rangwani under the Economically Weaker Section (EWS) quota.</p>\n\n<p>The case arose after the school rejected Master Rangwani's application due to a missing ward number on his Aadhaar card, despite the subsequent submission of a verified residence certificate. The court found this rejection arbitrary and a violation of the child's fundamental right to education.</p>\n\n<p>Justice Anoop Kumar Dhand emphasized that the right to education, a constitutional guarantee, cannot be undermined by technicalities if valid proof of residence is furnished. Citing precedents, the court reiterated that schools cannot arbitrarily deny admission under the EWS quota. The ruling serves as a reminder that procedural issues should not impede a child's access to education, ensuring inclusivity and equal opportunity. The court directed Vardhman International School to admit Master Daivik Rangwani within 15 days. This decision reaffirms the judiciary's commitment to upholding a child's fundamental right to education, reinforcing that it is a substantive entitlement that cannot be defeated by administrative rigidity.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/right-to-free-education-rajasthan-hc-upholds-childs-claim.jpg"
  },
  {
    "title": "Rose Valley Chit Fund Scam: Judicial Responses to Large-Scale Financial Fraud",
    "description": "<p>The Rose Valley chit fund scam, led by Chairman Gautam Kundu, involves alleged fraudulent collective investment schemes that deceived numerous individuals. Investigative agencies like the Enforcement Directorate and the Central Bureau of Investigation are involved due to the schemes posing a threat to public and national financial stability.</p>\n\n<p>The Rose Valley Group allegedly used fraudulent tactics to amass funds from the public through entities like Rose Valley Real Estate Construction Ltd. Issuing secured non-convertible debentures (NCDs) without SEBI compliance, the group raised over ₹12.82 crores. These funds were allegedly diverted into other businesses, using cross-shareholding to create \"fake capital,\" disguising public deposits as company capital and circumventing regulations to exploit public trust. It is alleged that around ₹17,378 Crores were collected from investors, with more than ₹9,000 Crores yet to be refunded.</p>\n\n<p>Legal battles, as documented in cases like *Gautam Kundu vs. The Enforcement Directorate*, demonstrate the judiciary's stance on economic offenses. The Calcutta High Court prioritized a speedy trial, while the Orissa High Court emphasized that economic offenses require a different approach to bail considerations, especially when posing a threat to the nation's financial health. The Supreme Court has also reinforced that collective investment schemes without SEBI approval are illegal.</p>\n\n<p>The Prevention of Money Laundering Act (PMLA) has been crucial in investigating and attaching assets acquired through illicit activities. The judiciary's strict stance signals a commitment to combating complex financial fraud, aiming to restore public trust. The attachment and sale of Rose Valley's assets under PMLA aims to compensate defrauded investors, overseen by the Justice S.P. Talukdar Committee.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/rose-valley-chit-fund-scam-judicial-response-impact.jpg"
  },
  {
    "title": "Free Speech in the Digital Age: Telangana HC Issues Guidelines on Social Media FIRs",
    "description": "<p>On September 10, 2025, the Telangana High Court, in *Nalla Balu @ Durgam Shashidhar Goud v. State of Telangana*, quashed three FIRs against a citizen who criticized the ruling Congress Party and the Chief Minister on \"X\" (formerly Twitter). The Court ruled the FIRs were inappropriately filed and further issued binding guidelines for police and magistrates on handling complaints related to social media speech.</p>\n\n<p>The petitioner was accused of posting tweets that included abusive language, compared the Congress party to a pest, and alleged corruption in the Chief Minister’s government. The FIRs cited offences under the Bharatiya Nyaya Sanhita, 2023, and Section 67 of the Information Technology Act, 2000. The prosecution argued the tweets defamed the Chief Minister and disturbed public tranquility, while the petitioner contended they were protected political commentary under Article 19(1)(a) and did not constitute cognizable offenses.</p>\n\n<p>Justice N. Tukaramji concluded that the FIRs were mechanically registered without meeting statutory requirements. The court emphasized that political criticism, even if harsh, does not automatically constitute provocation, public mischief, or obscenity. At most, some posts might be considered under defamation, but such cases require a complaint by the aggrieved party before a magistrate, not a police investigation. The Court then established clear guidelines for police and magistrates in Telangana on handling social media speech cases, emphasizing preliminary inquiry, high thresholds for speech-related offenses, and locus standi.</p>\n\n<p>The judgment is considered a significant moment for free speech jurisprudence in India. It interprets the BNS and BNSS in the context of digital expression and reinforces that political speech, even when uncomfortable, should not be suppressed through criminal law. By offering operational clarity to law enforcement and judicial officers, the ruling aims to protect citizens, journalists, and opposition voices from arbitrary FIRs and politically motivated harassment. It reaffirms the constitutional principle that democracy thrives on dissent, criticism, and debate, and that freedom of speech is a fundamental right requiring diligent protection, particularly in the digital age.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/social-media-firs-telangana-hc-issues-key-guidelines.jpg"
  },
  {
    "title": "Supreme Court Clarifies Strict Application of Limitation in Negotiable Instruments Act Cases",
    "description": "<p>The Supreme Court of India has reaffirmed the importance of adhering to statutory timelines in cheque dishonor cases under the Negotiable Instruments Act, 1881 (NI Act). The ruling emphasizes that a complaint filed after the prescribed deadline cannot be automatically considered maintainable. Any delay necessitates a formal application for condonation, which must be substantively evaluated by the court.</p>\n\n<p>Section 138 of the NI Act provides recourse for payees when cheques are dishonored due to insufficient funds, but Section 142(b) requires the complaint to be filed in writing and within a specific timeframe. While courts can condone delays, this is not an automatic process. The Supreme Court clarified that the principle of certainty in limitation law is paramount, particularly in quasi-criminal cheque dishonor proceedings. Statutory timelines prevent abuse and ensure fair, prompt prosecution.</p>\n\n<p>In *H.S. Oberoi Buildtech Pvt. Ltd. & Ors. v. M/s MSN Woodtech*, the Court overturned decisions by lower courts that had proceeded with a cheque dishonor complaint filed five days late without a formal condonation application. The Supreme Court underscored that even minor delays require a proper application under Section 142(b). While the civil recovery proceedings were unaffected, the Court emphasized that criminal liability under the NI Act requires strict adherence to limitation requirements.</p>\n\n<p>This ruling reinforces that limitation is a crucial statutory mandate. While courts retain the discretion to condone delays under Section 142(b), this power is conditional upon a formal application supported by valid reasons. This preserves the balance between protecting the rights of payees and shielding accused individuals from prosecutions initiated outside statutory timelines.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/sc-rules-no-automatic-delay-condonation-in-ni-act-case.jpg"
  },
  {
    "title": "SEBI Enhances Investor Protection and Accountability through LODR (Third Amendment) Regulations, 2025",
    "description": "<p>The Securities and Exchange Board of India (SEBI) has announced the SEBI (Listing Obligations and Disclosure Requirements) (Third Amendment) Regulations, 2025, effective September 8, 2025. These amendments to the SEBI (Listing Obligations and Disclosure Requirements) Regulations, 2015 (“LODR Regulations”), are part of SEBI's ongoing initiative to improve transparency, bolster investor protection, and increase accountability within the securities market. The focus is particularly on corporate actions and the Social Stock Exchange framework.</p>\n\n<p>The LODR Regulations, 2015, serve as a comprehensive set of guidelines for listing and disclosure obligations for listed entities. SEBI has the authority to regulate companies' access to the securities market and ensure their compliance through Sections 11, 11A(2), and 30 of the SEBI Act, 1992, in conjunction with Section 31 of the Securities Contracts (Regulation) Act, 1956. The current amendment, following earlier ones in March and May 2025, demonstrates SEBI's commitment to fortifying the dematerialization system and the Social Stock Exchange framework, which was initially established in 2020.</p>\n\n<p>In conclusion, the Third Amendment Regulations, 2025, substantially reinforce the compliance framework under the LODR Regulations. Listed entities must rigorously comply with the dematerialization mandate. Simultaneously, NPOs and social enterprises on Social Stock Exchanges must adapt their disclosure practices, impact assessment methodologies, and fundraising strategies. For all market participants, these amendments emphasize SEBI's dedication to investor protection, transparency, and accountability.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/sebis-2025-lodr-amendment-boosts-investor-protection.jpg"
  },
  {
    "title": "Balancing Disclosure Requirements and Unintentional Errors in Passport Applications",
    "description": "<p>The Punjab and Haryana High Court recently addressed the complexities surrounding passport revocation in the case of *Navpreet Kaur v. Union of India & Ors.*, emphasizing the need for a nuanced approach by passport authorities when dealing with potential errors in applications. The case involved a petitioner, Navpreet Kaur, whose passport was revoked for allegedly suppressing material information regarding her marital status.</p>\n\n<p>The Regional Passport Office (RPO) revoked Kaur's passport after she applied to change her spouse's name, citing that she had previously mentioned her former husband's name on prior applications despite their divorce. The High Court analyzed whether mentioning a previous spouse's name constituted suppression of material information under the Passports Act, 1967, and whether revocation was justified.</p>\n\n<p>The court ruled that the suppression or misinformation must be *material*, meaning it would have led to the passport's refusal under Section 5(2)(c) of the Act if disclosed correctly. Drawing on precedent, the court determined that inadvertent mistakes regarding marital status do not warrant revocation under Section 10(3)(b). The court found Kaur's explanation plausible—that the error was an oversight during renewal—and emphasized that incorrect disclosure without intent to misuse does not trigger penal provisions. The court allowed Kaur's petition, nullified the revocation, and instructed authorities to issue a new passport with accurate details. This judgment serves as a reminder that passport authorities must exercise caution and consider the nuances of each case before resorting to revocation.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/hc-rules-on-passport-revocation-for-unintentional-errors.jpg"
  },
  {
    "title": "No Receipts, No Problem: Supreme Court Clarifies Enforceability of Cash in Promissory Notes",
    "description": "<p>The Supreme Court has addressed a common problem in recovery suits involving cash components in financial transactions, particularly when receipts are absent. The core issue revolves around whether courts should enforce the full amount acknowledged in a written instrument, like a promissory note, even if a portion was paid in cash without independent proof, or discount the cash element.</p>\n\n<p>The court case *Georgekutty Chacko v. M.N. Saji* served as the backdrop. The Kerala High Court had previously reduced the decreed amount of a promissory note, only accepting bank transfers and rejecting the cash component. The Supreme Court overturned this decision, emphasizing that a promissory note acts as sufficient acknowledgment of the entire debt. The absence of cash receipts does not invalidate the claim. Once liability is acknowledged in writing, the burden shifts to the borrower to disprove it, reinforcing the evidentiary weight of such instruments.</p>\n\n<p>The ruling underscores that while courts acknowledge the challenges in tracing cash payments, they recognize them as a legitimate part of financial dealings. The court seeks to balance protecting lenders from unfair denial of debt and ensuring borrowers are not burdened by unsubstantiated claims. This approach preserves confidence in financial dealings by upholding the reliability of promissory notes while allowing for valid defenses.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/sc-upholds-cash-validity-in-promissory-note-debt-recovery.jpg"
  },
  {
    "title": "Family Property Dispute Settled: Supreme Court Clarifies What Truly Constitutes Ownership",
    "description": "<p>The Supreme Court of India has reiterated that property ownership requires a registered sale deed and cannot be validly claimed through documents like Agreements to Sell, General Power of Attorney (GPA), or affidavits. In *Ramesh Chand (D) Thr. LRs. v. Suresh Chand & Anr.*, the Court emphasized the necessity of strict proof for Wills, particularly when surrounded by suspicious circumstances. This ruling reverses the prior decisions of the Trial Court and High Court, establishing a cautionary precedent for family property disputes where informal transfers and unproven documentation are prevalent.</p>\n\n<p>The case originated from a dispute between two brothers, Suresh Chand and Ramesh Chand, over property previously owned by their deceased father, Kundan Lal. Suresh claimed sole ownership based on a 1996 Agreement to Sell, GPA, affidavit, receipt, and registered Will. Ramesh contested these documents, asserting that the property had been orally gifted to him in 1973.</p>\n\n<p>The Supreme Court determined that the property remained with Kundan Lal until his death and, given the failure to properly prove the Will, would devolve upon all Class-I legal heirs under succession law. The Court clarified that Ramesh Chand's sale of a portion of the property would only be valid to the extent of his rightful share, safeguarding the purchaser's interests without infringing on the rights of other heirs. Consequently, the prior judgments were overturned, the plaintiff's suit was dismissed, and the parties were directed to resolve their respective rights through succession law.</p>\n\n<p>This ruling underscores the critical importance of complying with statutory requirements for property transfers. By emphasizing the need for formal, registered instruments, the Court aims to promote transparency in property dealings and prevent disputes arising from informal transfers. While potentially affecting litigants who relied on less formal documentation, the decision ultimately reinforces the rule of law and aims to reduce manipulation in succession disputes.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/registered-sale-deed-key-for-property-ownership-sc-ruling.jpg"
  },
  {
    "title": "Immigration Rules 2025: What Foreign Nationals, Carriers, and Businesses Need to Know",
    "description": "<p>On September 1, 2025, India's Ministry of Home Affairs (MHA) implemented the Immigration and Foreigners Rules, 2025, under the new Immigration and Foreigners Act, 2025. This Act and its Rules consolidate and modernize India’s immigration laws, creating a comprehensive framework governing the entry, stay, movement, and exit of foreign nationals, as well as outlining the responsibilities of carriers and immigration authorities.</p>\n\n<p>Previously, India's immigration framework was a fragmented system of statutes and executive orders, including the Foreigners Act, 1946. The new Act and Rules aim to address duplication, ambiguities, and compliance challenges by establishing a single, comprehensive code. The Bureau of Immigration (BoI) is formally designated as the nodal body for implementing and enforcing the Act, standardizing procedures and documentation nationwide.</p>\n\n<p>Key changes include enhanced responsibilities for airlines, shipping companies, and other carriers. They are now required to provide Advance Passenger Information (API), Passenger Name Record (PNR) data, and a General Declaration prior to departure, subject to verification by an Immigration Officer. Non-compliance can result in significant penalties. The system also incorporates technology-driven measures, such as biometric verification, digitized records, and centralized databases, to improve border security and streamline passenger processing.</p>\n\n<p>The new Rules impact foreign nationals, carriers, employers, and legal practitioners. Foreign nationals must maintain valid travel documents to avoid penalties or deportation. Carriers must upgrade their systems to comply with mandatory data-sharing requirements. Employers must reassess their immigration compliance protocols, and legal practitioners can anticipate increased disputes related to immigration enforcement. Overall, the Immigration and Foreigners Rules, 2025 represent a fundamental shift in how immigration law is administered in India, emphasizing secure, transparent, and efficient management through centralized authority, mandated carrier compliance, and technology-driven oversight.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/indias-immigration-rules-2025-key-compliance-updates.jpg"
  },
  {
    "title": "When Screenshots Aren’t Enough: NCLAT Slams Bid-Rigging Allegation in Atlas Alloy Liquidation Auction",
    "description": "<p>The National Company Law Appellate Tribunal (NCLAT) dismissed an appeal alleging bid-rigging in the liquidation auction of M/s Atlas Alloy (India) Private Limited. The case, *Jai Agarwal v. Satyendra Prasad Khorania & Ors.*, centered on accusations of collusion and technical sabotage after the appellant, Jai Agarwal, lost the auction for a Beawar plot by a narrow margin.</p>\n\n<p>The auction, conducted on the government-mandated portal, saw Novelty Textiles emerge as the highest bidder. Agarwal alleged that Novelty was a \"straw man\" bidder inserted at the last minute, and further claimed bribery, confidentiality breaches, and technical obstruction. The NCLT Jaipur Bench initially dismissed Agarwal's plea, prompting the appeal to the NCLAT.</p>\n\n<p>The NCLAT scrutinized Agarwal's claims against the portal's audit logs, bank statements, and time-stamped entries. The tribunal found no evidence to support the allegations of collusion, bribery, or technical manipulation. It emphasized that while Regulation 33 of the IBBI (Liquidation Process) Regulations, 2016, mandates transparency and value maximization, accusations of fraud must be distinctly alleged and strictly proven. The NCLAT upheld the NCLT's order, emphasizing that the e-auction was fair, transparent, and compliant with the law. The case serves as a reminder that suspicion and screenshots are insufficient substitutes for hard data in insolvency proceedings, and highlights the importance of fair participation and documented transparency in e-auctions.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/nclat-dismisses-bid-rigging-claim-in-atlas-alloy-auction.jpg"
  },
  {
    "title": "From Undervaluation to Justice: Supreme Court’s Ruling on Motor Accident Compensation",
    "description": "<p>The Supreme Court of India, in *Hitesh Nagjibhai Patel v. Bababhai Nagjibhai Rabari & Anr.*, has emphasized the need for \"just and fair compensation\" in motor accident cases, particularly those involving minors with permanent disabilities. The Court criticized lower courts for undervaluing the claim and failing to adhere to established legal principles. The ruling aims to prevent delays and unnecessary appeals in future claims.</p>\n\n<p>The case involved an eight-year-old boy who suffered severe injuries in 2012 due to a motor accident, resulting in 90% permanent functional disability. The boy filed a claim petition seeking ₹10 lakh in compensation. The Supreme Court assessed whether the compensation awarded by lower courts was adequate, considering the permanent disability.</p>\n\n<p>Ultimately, the Supreme Court significantly increased the compensation to ₹35,90,489 with 9% interest from the claim petition date, highlighting the necessity of just and fair compensation, especially when minors suffer permanent disabilities. This judgment serves as a precedent for future motor accident claims, ensuring that courts apply settled law vigilantly and that procedural lapses leading to undervaluation of claims are not overlooked, reinforcing the protection of claimants.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/sc-enhances-compensation-for-minor-in-motor-accident-case.jpg"
  },
  {
    "title": "Delay in Challenging an Award: When Does the Clock Start for the Government?",
    "description": "<p>The Supreme Court of India, in *M/s Motilal Agarwala v. State of West Bengal*, addressed the crucial question of when the 90-day limitation period under Section 34 of the Arbitration and Conciliation Act, 1996, commences for government entities. The court reaffirmed that the limitation period begins only when a signed copy of the arbitral award reaches the officer competent to decide on challenging the award, not merely upon receipt by any government official.</p>\n\n<p>The case arose from a 2013 arbitral award in favor of M/s Motilal Agarwala. Although an Assistant Engineer received a copy of the award shortly after it was issued, the State of West Bengal claimed they only became aware of it much later during execution proceedings. The State then filed a Section 34 application to challenge the award, which was initially dismissed by the District Court as time-barred. The Calcutta High Court reversed this decision, holding that service on an unauthorized officer did not trigger the limitation period.</p>\n\n<p>The Supreme Court upheld the High Court's judgment, emphasizing that for large government organizations, the award must reach the individual with knowledge of the proceedings and the authority to decide whether to challenge it. The Court noted that delivery of the award is not a mere formality and that diluting the \"competent authority\" rule would create uncertainty in government litigation. Consequently, the Supreme Court dismissed the contractor's appeal and directed the District Court to decide the Section 34 application on its merits. The ruling clarifies that limitation starts only when the competent departmental head receives a signed copy, aiming to balance the strictness of limitation with the realities of bureaucratic structure.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/limitation-period-in-arbitration-for-government-clarified.jpg"
  },
  {
    "title": "Strengthening India’s Arbitration Regime: SC on Unsigned Arbitration Agreement",
    "description": "<p>The Supreme Court of India, in *Glencore International AG vs. Shree Ganesh Metals & Anr*, has ruled that the absence of a signature on an arbitration clause does not automatically invalidate it. The Court emphasized that the key factor is the demonstrable intention of the parties to submit disputes to arbitration, which can be evidenced through written communication, conduct, or other documentation. This decision reinforces the principle of party autonomy in arbitration, prioritizing substance over form and aligning India with global arbitration standards.</p>\n\n<p>The case stemmed from a commercial dispute where one party challenged the validity of an arbitration agreement due to the lack of formal signatures. While previous contracts between Glencore and Shree Ganesh Metals were signed, the contract in question was confirmed via email exchanges but not physically signed. The Supreme Court clarified that Section 7 of the Arbitration and Conciliation Act, 1996, requires an arbitration agreement to be \"in writing\" but does not mandate signatures for validity. The Court emphasized that the intention to arbitrate is the crucial element.</p>\n\n<p>The ruling has significant implications for India's arbitration regime. It provides reassurance to businesses and investors by clarifying that the clear intention of the parties to arbitrate, rather than the presence of a signature, is paramount. This decision diminishes the potential for technical objections based solely on missing signatures, enhancing certainty and reliability in commercial transactions. It reinforces confidence in arbitration as an efficient and business-friendly dispute resolution mechanism, solidifying India's pro-arbitration stance.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/sc-unsigned-arbitration-agreements-still-enforceable.jpg"
  },
  {
    "title": "Authority by Designation: NCLAT Clarifies Power of Attorney Execution in Indian Bank v. Aman Hospitality",
    "description": "<p>The National Company Law Appellate Tribunal (NCLAT) in *Indian Bank v. M/s Aman Hospitality Pvt. Ltd.* addressed the validity of a Power of Attorney (POA) executed by officers nominated by designation rather than by name. The case arose from the dismissal by the NCLT of Indian Bank's application to amend particulars of debt, due to concerns over the validity of the POA held by the Chief Manager filing the application.</p>\n\n<p>Indian Bank argued that its Board of Directors had established a Uniform Power of Attorney System, authorizing General Managers or a General Manager along with a Deputy/Assistant General Manager nominated by the CMD or Executive Director, to execute POAs on behalf of the Bank. The bank emphasized that delegation by designation is legally valid. Aman Hospitality contended that only individual nominations by name were sufficient.</p>\n\n<p>The NCLAT ruled in favor of Indian Bank, setting aside the NCLT's order. The Tribunal found that the Board resolution allowed for officer nomination, and designations provided sufficient certainty regarding authorized incumbents. Drawing from the Supreme Court's judgment in *United Bank of India v. Naresh Kumar*, the NCLAT cautioned against hyper-technical objections that could impede substantive justice. The matter was remanded back to the NCLT for reconsideration on its merits. The decision reinforces that substance prevails over form in corporate litigation, validating POAs executed by officers holding specified designations authorized by the Board.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/power-of-attorney-validity-clarified-by-nclat-in-2025-judgment.jpg"
  },
  {
    "title": "Delhi High Court Upholds Annulment Over Hidden Divorce and Inflated Income",
    "description": "<p>The Delhi High Court has affirmed that concealing a prior marriage and misrepresenting one's income on matrimonial platforms constitutes fraud, providing valid grounds for marriage annulment. The ruling in *Sameer Pareek vs. Shweta Pareek* (MAT.APP. (F.C.) 87/2024) emphasizes that consent obtained through such deception is neither free nor informed, undermining the marital contract's foundation.</p>\n\n<p>The case originated on “www.shaadi.com,” where Shweta Pareek relied on Sameer Pareek's profile, which falsely stated he was \"Never Married\" despite being a divorcee with a child and inflated his income from approximately $120K-$130K to \"USD 200K and above.\" Feeling deceived, she sought annulment under Section 12(1)(c) of the Hindu Marriage Act, 1955. The Family Court ruled in her favor, a decision Sameer Pareek appealed.</p>\n\n<p>Before the High Court, Sameer Pareek argued he disclosed his prior marriage orally, the petition was filed late, and his parents created the profile. Shweta Pareek countered that the misrepresentations were material and directly influenced her consent. The High Court dismissed the appellant's arguments, deeming the \"Never Married\" claim unambiguous and emphasizing the significance of suppressing a prior marriage and the existence of a child.</p>\n\n<p>Referencing *Anurag Anand v. Sunita Anand*, the court also recognized misrepresenting financial status as material fraud, given the importance of financial stability. The High Court concluded that Sameer Pareek engaged in fraud under Section 12(1)(c) of the Hindu Marriage Act, upholding the decree of nullity. The judgment serves as a warning against dishonesty on matrimonial websites and reinforces the need for complete transparency for free and informed consent.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/delhi-high-court-marriage-annulment-over-profile-fraud.jpg"
  },
  {
    "title": "Supreme Court Clarifies Landowners' Rights in Slum Rehabilitation",
    "description": "<p>The Supreme Court's ruling in *Tarabai Nagar Cooperative Housing Society v. State of Maharashtra* addresses the complex issue of slum redevelopment in Mumbai, specifically concerning the acquisition of slum-encroached land under the Maharashtra Slum Areas (Improvement, Clearance and Redevelopment) Act, 1971. The central question was whether landowners have a preferential right to redevelop slum-affected land before the State or Slum Rehabilitation Authority (SRA) can intervene.</p>\n\n<p>The case involved land owned by Indian Cork Mills Pvt. Ltd. (ICM), a portion of which was declared a slum area. While the Tarabai Nagar Cooperative Housing Society (representing slum dwellers) sought land acquisition for redevelopment, ICM asserted its right to redevelop the land independently. The State of Maharashtra issued an acquisition notification, prompting ICM to challenge the decision in the Bombay High Court, which ruled in favor of the landowner, granting them the initial opportunity to propose a redevelopment scheme.</p>\n\n<p>The Supreme Court upheld the Bombay High Court's decision, affirming that landowners possess a primary and preferential right to redevelop land designated as a Slum Rehabilitation Area. The SRA is obligated to notify the landowner, inviting them to submit a redevelopment proposal before the State can proceed with acquisition. This ruling ensures procedural fairness, safeguards property rights, and necessitates that the government provide landowners a fair opportunity to redevelop before resorting to compulsory acquisition. However, the court also acknowledged the rights of slum dwellers to initiate redevelopment if landowners fail to act within a reasonable timeframe. This decision clarifies the roles of landowners and the SRA, impacting future slum rehabilitation projects in Maharashtra by promoting transparency, reducing disputes, and ensuring a balance between private property rights and social welfare.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/supreme-court-upholds-landowners-in-slum-rehabilitation.jpg"
  },
  {
    "title": "Understanding the Aadhaar (Sharing of Information) Amendment Regulations, 2025",
    "description": "<p>The Unique Identification Authority of India (UIDAI) has implemented the Aadhaar (Sharing of Information) First Amendment Regulations, 2025, effective August 22, 2025. This amendment modifies the sharing of Aadhaar numbers for young children and clarifies compliance obligations for entities dealing with deactivated Aadhaar numbers.</p>\n\n<p>Rooted in the Aadhaar Act, 2016, the regulatory framework empowers UIDAI to govern all aspects of the Aadhaar ecosystem. These amendments align with the Digital Personal Data Protection Act, 2023 (DPDP Act) which emphasizes consent, purpose limitation, data minimization, and accountability in personal data processing. The 2025 amendments aim to integrate Aadhaar with civil registration records (births and deaths) while adhering to evolving data protection standards.</p>\n\n<p>Key changes include a new provision in Regulation 3 enabling UIDAI to share the Aadhaar number of a child under five (issued based on a birth certificate without biometrics) with the Registrar General of India or the State Chief Registrar with explicit consent. Additionally, an amendment to Regulation 5 clarifies that responsibilities imposed on entities handling Aadhaar numbers do not apply when the Aadhaar has been deactivated due to the holder's death.</p>\n\n<p>In conclusion, the Aadhaar (Sharing of Information) First Amendment Regulations, 2025, represent a significant stride towards enhancing Aadhaar record accuracy and defining responsibilities for entities managing Aadhaar data. The introduction of consent requirements for sharing child Aadhaar data and the exemption for deactivated Aadhaar numbers demonstrate a regulatory evolution that integrates Aadhaar with civil registries while aligning with broader data protection principles.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/aadhaar-sharing-of-information-amendment-2025.jpg"
  },
  {
    "title": "No Public View, No Offence: Telangana HC Clarifies Limits of SC/ST Act in Marital Disputes",
    "description": "<p>The Telangana High Court, in *Smt. K. Swathi v. The State of Telangana & Another*, clarified the scope of the Scheduled Castes and Scheduled Tribes (Prevention of Atrocities) Act, 1989. The court ruled that caste-based insults exchanged privately between spouses do not constitute an offense under the Act unless made in \"public view.\" Justice E.V. Venugopal emphasized that the humiliation must be public, exposing the victim to social disgrace, to be considered an atrocity under the law.</p>\n\n<p>The case originated from a marital dispute involving an inter-caste marriage. The husband, a member of a Scheduled Caste, alleged that his wife subjected him to caste-based slurs and harassment after their separation. The court, however, quashed the proceedings, citing the lack of public view and a significant delay in filing the complaint, which raised questions on the credibility of the accusations.</p>\n\n<p>The ruling aligns with established judicial precedents, including *Hitesh Verma v. State of Uttarakhand*, which emphasize that the SC/ST Act is intended to address systemic and public humiliation, not private quarrels. The Telangana High Court's decision reinforces the importance of the \"public view\" requirement and prevents the misuse of the Act in personal disputes, ensuring it serves its intended purpose of protecting SC/ST communities from public discrimination.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/telangana-hc-sc-st-act-not-for-private-marital-dispute.jpg"
  },
  {
    "title": "Lakshadweep Administration Notifies Welfare Measures for Transgender Persons",
    "description": "<p>On July 29, 2025, the Lakshadweep Administration issued a notification to implement welfare measures for transgender individuals within the Union Territory. This action aligns with the Transgender Persons (Protection of Rights) Act, 2019, and adheres to directives from the Ministry of Social Justice & Empowerment (MSJE) and the Ministry of Home Affairs.</p>\n\n<p>The notification follows landmark Supreme Court rulings, including *National Legal Services Authority v. Union of India* (2014) recognizing transgender persons as a \"third gender\" with the right to self-identify, and *Navtej Singh Johar v. Union of India* (2018) decriminalizing consensual same-sex relations. These decisions established a constitutional framework promoting dignity, autonomy, and equality. The 2019 Act further prohibits discrimination against transgender persons in key areas like education, employment, and healthcare, while mandating the creation of support systems at the state and UT level.</p>\n\n<p>Between 2023 and 2025, the MSJE and Ministry of Home Affairs issued directives urging all States and Union Territories to implement the Act. The Lakshadweep Administration's notification directly responds to these central directives by designating a Nodal Officer and implementing welfare provisions, ensuring institutional preparedness even in the absence of formally identified transgender residents. This proactive measure aligns the Union Territory with the national framework for inclusion, guaranteeing immediate access to support mechanisms as needed. The initiative signifies a crucial advancement in extending constitutional rights and welfare protections to transgender persons, reflecting India's dedication to inclusive governance, dignity, and equality for all citizens.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/lakshadweep-notification-on-transgender-welfare-measures.jpg"
  },
  {
    "title": "Supreme Court Mandates Replenishment Studies for Valid District Survey Reports in Sand Mining",
    "description": "<p>In a landmark judgment, the Supreme Court of India has ruled that a District Survey Report (DSR) lacking a proper replenishment study is legally invalid for granting environmental clearances for sand mining activities. This decision, stemming from the case of *Union Territory of Jammu and Kashmir & Ors. v. Raja Muzaffar Bhat & Ors.*, emphasizes scientific assessment and environmental sustainability over administrative expediency.</p>\n\n<p>The case originated from proposed sand mining activities for a road construction project in Jammu and Kashmir. An environmental activist challenged the environmental clearance granted based on a DSR that was initially rejected due to over-exploitation and lack of replenishment data. Despite the initial rejection, the project was later approved even though the DSR remained deficient.</p>\n\n<p>The National Green Tribunal (NGT) overturned the environmental clearance, asserting that no legal provision allows for dispensing with DSR and replenishment study requirements, regardless of mining depth. The Supreme Court upheld the NGT's decision, emphasizing that a DSR is only valid when supported by a proper replenishment study. The court highlighted the detrimental impacts of mining on river ecosystems and the necessity of understanding replenishment rates to ensure sustainable mining limits.</p>\n\n<p>The Supreme Court underscored that DSR preparation is mandatory and that replenishment studies are an integral part of valid DSRs. The court criticized the regulatory authorities for compromising environmental integrity by granting clearance based on a deficient DSR. This decision sets a strong precedent, ensuring that environmental guidelines are strictly followed and that environmental protection is not sacrificed for administrative ease.</p>\n\n<p>The judgment reinforces the precautionary principle, requiring scientific rigor in environmental decision-making, and strengthens administrative accountability. By mandating replenishment studies, the court aims to protect riverine ecosystems from over-exploitation and promote sustainable development, setting a precedent that will guide future environmental clearance decisions in India.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/sc-dsr-replenishment-study-mandatory-for-sand-mining.jpg"
  },
  {
    "title": "What Happens When an Employee Dies in Harness? Rights under Employees Compensation Act, 1923",
    "description": "<p>The death of an employee during employment is a significant event with both human and legal dimensions. The Employees Compensation Act, 1923 (EC Act) in India, aims to provide financial support to the dependents of a deceased employee, irrespective of their employment status (permanent, probationary, or trainee). This legislation underscores the importance of worker and family security within labor welfare laws.</p>\n\n<p>Under the EC Act, the term \"employee\" is broadly defined to include trainees and probationers. This ensures that compensation and benefits are applicable regardless of whether the deceased was a confirmed employee, probationer, or trainee.</p>\n\n<p>The Act mandates statutory compensation to the dependents of a deceased employee. The compensation amount is calculated based on a formula involving the employee's monthly wages and a relevant factor determined by age, as specified in Schedule IV.  Additionally, the employer is required to deposit a fixed sum towards funeral expenses. Failure to deposit the compensation within 30 days can result in penalties and interest charges.</p>\n\n<p>The EC Act establishes a clear procedure for disbursing compensation to legally recognized dependents, safeguarding against private settlements and disputes. Employers are obligated to promptly notify the Commissioner of Employee’s Compensation, conduct an internal inquiry, preserve records and evidence, and facilitate the claim process. Non-compliance can lead to legal repercussions.</p>\n\n<p>In conclusion, the EC Act is a crucial social welfare law designed to protect the dependents of employees who die during employment, ensuring they are not left financially insecure. The Act protects all employees and requires employers to adhere to statutory timelines and procedures, balancing compassion with accountability.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/compensation-for-employee-death-under-ec-act-1923.jpg"
  },
  {
    "title": "RBI Issues Draft Circular on Counterparty Credit Risk and Potential Future Exposure",
    "description": "<p>On August 20, 2025, the Reserve Bank of India (RBI) released a draft circular addressing Counterparty Credit Risk (CCR) and Potential Future Exposure (PFE), inviting public comments until September 10, 2025. This revision updates the existing framework outlined in the Master Circular on Basel III Capital Regulations, aiming to align domestic capital adequacy rules with international standards set by the Basel Committee on Banking Supervision (BCBS) while adapting to the evolving Indian derivatives market.</p>\n\n<p>The draft circular focuses on the Current Exposure Method (CEM) for calculating PFE, a key component of the Basel III framework designed to ensure adequate capital coverage against counterparty defaults in financial contracts. The RBI's actions are grounded in its statutory powers derived from the Banking Regulation Act, 1949, and the Reserve Bank of India Act, 1934.</p>\n\n<p>Key implications for banks include the potential need to hold additional capital against CCR, particularly for those acting as clearing members of SEBI-recognized exchanges. While this may impact short-term profitability, it is intended to bolster the stability of the banking system. The alignment with BCBS guidelines will enhance the credibility and competitiveness of Indian banks in cross-border transactions and reduce regulatory arbitrage.</p>\n\n<p>In conclusion, the draft circular signifies a crucial regulatory update in India's prudential capital framework. By clarifying obligations and revising add-on factors to align with Basel III, the RBI aims to maintain financial stability, ensure international consistency, and address emerging risks in the derivatives market. Banks and market participants are urged to assess the draft's impact and provide feedback during the consultation period.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/rbi-draft-on-counterparty-credit-risk-basel-iii-alignment.jpg"
  },
  {
    "title": "Rajasthan High Court Reinforces Citizens' Right to Safe Roads: No Place for Illegal Occupations",
    "description": "<p>The Rajasthan High Court addressed the persistent issue of encroachments on public roads and pedestrian pathways in the case of *Vijay Kumar Boyat & Ors. Versus Vaibhav Galriya*. Recognizing the widespread nature of the problem and the failure of previous directives, the Court revived a pending Public Interest Litigation (PIL) filed in 2022 and issued stringent new directions to identify, remove, and prevent illegal encroachments statewide. The court emphasized that public spaces belong to the community and cannot be usurped for private interests.</p>\n\n<p>The case originated from a PIL highlighting encroachments obstructing traffic and endangering pedestrians in Jaipur. Despite earlier court orders to remove these obstructions, inaction prompted a civil contempt petition. The Court clarified that contempt proceedings are exclusive to the Court and the directed parties, dismissing attempts to include additional contemnors. Subsequently, the court reactivated the original PIL to ensure effective action against encroachments.</p>\n\n<p>The High Court stressed that encroachments, which often evolve from temporary stalls into permanent structures, threaten public safety and erode urban infrastructure efficiency. The Court stated that no local authority or court order could legitimize these illegal occupations. It reinforced that public interest supersedes private encroachment, and roads and pedestrian pathways must remain unobstructed. The Court mandated that encroachment assessments must align with Master Plans and Zonal Development Plans to prevent arbitrary enforcement. Drawing support from the Supreme Court’s decision in *In Re: Manoj Tibrewal Akash*, the bench highlighted the urgent need to remove unauthorized structures from public spaces to safeguard civic infrastructure and public rights.</p>\n\n<p>The judgment underscores the broader challenge of managing urban growth while protecting public spaces, exposing systemic weaknesses in enforcement, monitoring, and potential collusion between authorities and violators. The Court's statewide directives indicate a need for a uniform and accountable enforcement mechanism to protect public land, reinforcing that sustainable urban development requires consistent enforcement of planning laws and zero tolerance for encroachments.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/rajasthan-hc-orders-statewide-crackdown-on-road-encroachments.jpg"
  },
  {
    "title": "Telangana Government Exempts Persons with Disabilities from Routine Transfers and Postings",
    "description": "<p>The Government of Telangana has issued G.O.Ms. No. 34, effective August 7, 2025, exempting government employees with disabilities and caregivers of dependents with disabilities from routine transfers and postings. This order operationalizes safeguards outlined in the Rights of Persons with Disabilities Act, 2016 (RPwD Act).</p>\n\n<p>The RPwD Act, 2016, aligns with the UN Convention on the Rights of Persons with Disabilities (UNCRPD), emphasizing equality of opportunity, non-discrimination, and reasonable accommodation. While Section 20(5) of the RPwD Act primarily focuses on job security, courts have interpreted it to include protection from arbitrary transfers. The Telangana order institutionalizes this principle by providing a policy-level exemption.</p>\n\n<p>The order, issued by the Department for Women, Children, Disabled and Senior Citizens, and with the concurrence of the Finance (HRM.I) Department, is binding on all state government departments. This initiative aligns with judicial precedents and policy directions emphasizing equal treatment and reasonable accommodation in employment for persons with disabilities. The Telangana order goes further by extending the exemption to caregivers, recognizing the potential for indirect discrimination. This progressive move strengthens workplace inclusivity, ensures stability for employees, and furthers the objectives of the RPwD Act, 2016.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/telangana-grants-exemption-from-routine-transfers-to-pwds.jpg"
  },
  {
    "title": "Aadhaar Not Mandatory: Labour Ministry Clarifies Authentication Rules for ESIC Beneficiaries",
    "description": "<p>On August 19, 2025, the Ministry of Labour and Employment issued Notification S.O. 3792(E) authorizing the Employees’ State Insurance Corporation (ESIC) to use Aadhaar authentication for identifying beneficiaries, superseding the notification dated January 13, 2023. The authorization aligns with the Aadhaar Act, 2016, and the Aadhaar Authentication for Good Governance Rules, 2020, with prior approval from MeitY and UIDAI.</p>\n\n<p>The notification aims to enhance transparency, prevent benefit leakage, and improve governance within the ESI scheme. While it allows ESIC to use Aadhaar for authentication, it emphasizes that such authentication is voluntary and requires explicit consent from the Aadhaar holder. Alternative identification methods, including Passport, PAN card, and Driving License, must be accepted, ensuring no beneficiary is denied benefits for not possessing or choosing not to use Aadhaar.</p>\n\n<p>This update balances digital governance with individual rights, adhering to Supreme Court directives on Aadhaar's usage. Employers and beneficiaries should be aware that while Aadhaar can streamline processes, it is not a mandatory requirement for accessing ESI benefits. ESIC is obligated to inform beneficiaries of alternative identification options.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/aadhaar-authentication-for-esic-clarified-as-voluntary.jpg"
  },
  {
    "title": "RPs Declared ‘Public Servants’: High Court Ruling Boosts Accountability in IBC",
    "description": "<p>The Madras High Court, in the case of Anil Kumar Ojha v. The State & Others, has ruled that Resolution Professionals (RPs) appointed under the Insolvency and Bankruptcy Code (IBC) qualify as \"public servants\" under Section 2(c) of the Prevention of Corruption Act, 1988. This decision resolves conflicting views among High Courts and has far-reaching implications for accountability within the insolvency ecosystem.</p>\n\n<p>The central legal issue before the court was whether an RP, appointed by the National Company Law Tribunal (NCLT), falls within the definition of a \"public servant\" due to their functions in managing debtor affairs, preserving assets, collating claims, and submitting reports to the NCLT, therefore performing duties connected with the administration of justice. The court emphasized the administrative and supervisory nature of an RP's duties, highlighting their centrality to the integrity of the insolvency process.</p>\n\n<p>The ruling clarifies the legal status of RPs, subjecting them to the anti-corruption framework of the Prevention of Corruption Act and requiring sanction for prosecution. This enhances the accountability framework for insolvency proceedings, prevents investigations into financial misconduct from being stalled, and strengthens the integrity of the insolvency system to better protect the interests of creditors. While awaiting a potential Supreme Court review, the judgment provides a vital check on the powers of RPs.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/madras-hc-resolution-professionals-are-public-servants.jpg"
  }
]