[
  {
    "title": "Justice in Time: Allahabad High Court Orders Six-Month Limit on Maintenance Cases",
    "description": "<p>The Allahabad High Court, in *Smt. Anjali Singh vs. State of U.P. and Another*, has directed the Family Court, Gautam Budh Nagar, to conclude a pending maintenance case within six months, emphasizing the urgency of financial relief for deserted wives under Section 125 of the Cr.P.C. Justice Nalin Kumar Srivastava stressed the need for swift resolution in such cases, given the economic hardship faced by abandoned women, and underscored the responsibility of all actors in the justice system to avoid unnecessary delays.</p>\n\n<p>Maintenance under Indian law, primarily through Section 125 Cr.P.C., ensures financial support to spouses, minor children, or dependent parents unable to support themselves, irrespective of religion. To claim maintenance, a wife must demonstrate her husband's sufficient means and refusal to provide support; \"wife\" includes legally wedded and, in some cases, divorced, non-remarried women. Besides the Cr.P.C., maintenance claims can also be pursued under personal laws and special legislation like the Hindu Adoption and Maintenance Act and the Domestic Violence Act.</p>\n\n<p>The case involved Anjali Singh, who filed a maintenance case in the Family Court of Gautam Budh Nagar, contending that her husband's delaying tactics prolonged the proceedings. Her counsel argued that the repeated adjournments amounted to judicial harassment, as she had no independent source of income and depended on the litigation's outcome.</p>\n\n<p>The Court observed that Section 125 Cr.P.C. cases directly concern the dignity and well-being of vulnerable women and children and should be handled with compassion and urgency. It emphasized that delays in maintenance matters deny justice and amplify the emotional and financial distress of women. The Family Court was directed to decide the case within six months, granting no unnecessary adjournments, conditional on the applicant's full cooperation.</p>\n\n<p>Recent trends in Indian maintenance law reflect increased judicial recognition of women's financial insecurity post-separation or divorce. Courts are increasingly setting time limits for resolution, proactively issuing interim maintenance orders, and using measures like salary attachment to ensure enforcement. Courts have also clarified that women can pursue maintenance under multiple legal frameworks simultaneously, provided there is no double recovery.</p>\n\n<p>This judgment matters because it recognizes that maintenance litigation is about restoring dignity and fairness, mandating a six-month deadline to aid similarly situated women nationwide. It broadens judicial responsibility to include all stakeholders, acknowledging that prolonged procedures can further victimize already suffering parties and promoting judicial accountability in family law litigation.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/time-limit-set-for-maintenance-under-indian-law.jpg"
  },
  {
    "title": "Bombay High Court Acquits All 12 in 7/11 Mumbai Train Blasts Case",
    "description": "<p>The Bombay High Court acquitted all twelve accused in the 2006 Mumbai train blasts case on July 21, 2025, reversing a 2015 trial court conviction. The ruling, delivered nearly two decades after the attacks that killed 189 and injured over 820, cited severe evidentiary and procedural flaws in the prosecution's case.</p>\n\n<p>The court found that the Maharashtra Anti-Terrorism Squad (ATS) had \"utterly failed\" to establish guilt beyond reasonable doubt. Key issues included unreliable witness testimony and questionable investigative procedures. The High Court emphasized that guilt must be proven unequivocally, even in terror cases, and that coerced confessions and procedural lapses are unacceptable.</p>\n\n<p>The acquittal raises significant questions about the ATS's investigative methods and the potential wrongful imprisonment of innocent individuals for nearly two decades. The State of Maharashtra is expected to appeal the judgment in the Supreme Court. The case highlights the urgent need for police reforms, independent review of terror investigations, and accountability mechanisms to prevent wrongful prosecutions, particularly where allegations of torture are involved. The judgment underscores the importance of upholding the rule of law, even when public sentiment presumes guilt.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/mumbai-train-blasts-hc-acquits-all.jpg"
  },
  {
    "title": "No Fresh Notice to Heirs Needed after Section 13(2), SARFAESI Served: Srinagar Bench Clarifies",
    "description": "<p>The Srinagar Bench of the High Court of Jammu & Kashmir and Ladakh recently addressed a case regarding the Securitisation and Reconstruction of Financial Assets and Enforcement of Security Interest (SARFAESI) Act, 2002, specifically concerning the necessity of issuing a fresh Section 13(2) notice to the legal heirs of a deceased borrower. The case arose after Jammu & Kashmir Bank Ltd. initiated proceedings under Section 14 of the Act to take possession of a mortgaged property following the death of the borrower, Abdul Aziz Sofi, after a Section 13(2) notice had already been served to him during his lifetime.</p>\n\n<p>The legal heirs challenged the bank's action, arguing that a fresh Section 13(2) notice should have been issued to them, asserting that the proceedings violated principles of natural justice. The bank countered that Section 14 is a summary remedy focused on the secured asset and not a personal action against the borrower, emphasizing that the initial Section 13(2) notice was validly served.</p>\n\n<p>The Court ruled in favor of the bank, dismissing the writ petition. It clarified that the death of the borrower does not extinguish the bank's right to proceed against the mortgaged property, as the liability transfers to the estate. The Court emphasized that Section 14's provisos only require affirmation of compliance with Section 13(2) as it stood during the borrower's lifetime and do not mandate a second round of notices to the successors. While dismissing the petition, the judges added that the bank would consider any One-Time Settlement scheme application by the petitioners. The ruling underscores that SARFAESI focuses on the secured asset rather than the borrower's continued existence.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/section-132-sarfaesi.jpg"
  },
  {
    "title": "Supreme Court Reinforces SARFAESI Shield: No Stay on Bank Possession Without Demonstrated Pre-Existing Tenancy",
    "description": "<p>The Supreme Court, in *PNB Housing Finance Ltd. v. Manoj Saha & Anr.*, reversed a Calcutta High Court order, reaffirming the primacy of the Securitisation and Reconstruction of Financial Assets and Enforcement of Security Interest Act (SARFAESI Act), 2002. The case involved a tenant who failed to adequately demonstrate a pre-existing, protected tenancy prior to a property's mortgage and subsequent action under SARFAESI.</p>\n\n<p>The dispute arose when PNB Housing Finance initiated SARFAESI proceedings against a borrower who had mortgaged the property. A tenant on the property asserted rights under the West Bengal Premises Tenancy Act, 1997, after the bank took possession. The High Court initially restored possession to the tenant, but the Supreme Court overturned this decision.</p>\n\n<p>The Supreme Court emphasized that the 2016 amendment to SARFAESI provides a complete code, requiring tenants aggrieved by Section 13(4) measures to apply to the Debt Recovery Tribunal (DRT) under Section 17(4A), and if necessary, appeal to the Debt Recovery Appellate Tribunal. The Court found that the tenant's evidence of continuous possession prior to the Section 13(2) notice was lacking. The court also cited *Bajarang Shyamsunder Agarwal*, clarifying protections for tenants under oral or unregistered agreements are limited to one year from the Section 13(2) notice.</p>\n\n<p>The ruling reinforces the statutory framework of SARFAESI, highlighting that High Court intervention under Article 227 is inappropriate when an effective statutory remedy exists. The Supreme Court directed the DRT to promptly resolve the pending application, confirming PNB Housing Finance's possession of the secured asset and underscoring the importance of adhering to the established SARFAESI process.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/sc-upholds-sarfaesi-shield.jpg"
  },
  {
    "title": "India's FSSAI Notifies First Amendment to Food Products and Additives Standards: New Norms Effective February 2026",
    "description": "<p>The Food Safety and Standards Authority of India (FSSAI) has announced the Food Safety and Standards (Food Products Standards and Food Additives) First Amendment Regulations, 2025, effective from February 1, 2026.  These amendments, finalized after extensive stakeholder consultation following the draft publication on October 31, 2022, are issued under the Food Safety and Standards Act, 2006.</p>\n\n<p>Key technical changes include updated refractive index values for certain food products to enhance analytical precision in quality assessment. A new standard for meat sausages has been introduced, defining classifications, compositional criteria, and preparation processes, aiming to ensure uniformity and consumer safety.  Similarly, a new standard is set for dehydrated tarragon, prescribing detailed specifications for both whole and powdered forms, ensuring consistency and purity.</p>\n\n<p>Regulations for packaged drinking water have been updated, revising permissible packaging sizes for better consumer transparency.  The amendment omits certain safety-related footnotes regarding synthetic colors, streamlines regulatory text, and revises specifications for synthetic food color preparations, defining acceptable diluents and specifying labeling and dye content requirements.</p>\n\n<p>The FSSAI has removed steviol glycosides as an approved additive in specific beverage categories and updated Appendix C concerning processing aids. Furthermore, the amendment approves several new enzymes derived from genetically modified microorganisms for use in food processing, subject to stringent safety limits.  This comprehensive amendment reinforces India's commitment to scientific regulation, consumer protection, and alignment with international norms in the food industry.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/fssai-amends-food-products-and-additives-standards.jpg"
  },
  {
    "title": "Registered Deeds Now Mandatory Under RajRERA: A New Compliance Precedent",
    "description": "<p>RajRERA has issued Order No. F1(31) RJ/RERA/2019/1078, mandating that only registered partnership deeds and LLP agreements will be accepted for real estate project registration. This directive signifies a commitment to stricter promoter verification and legal enforceability. The order invokes Regulation 4(1)(B)(i) of the Rajasthan Real Estate Regulatory Authority (General) Regulations, 2017, requiring submission of identity and registration certificates relevant to the promoter's legal status.</p>\n\n<p>This new requirement necessitates that promoters seeking to register projects in Rajasthan under a partnership or LLP must ensure their partnership deeds or LLP agreements are duly registered with the relevant Registrar of Firms or Registrar of Companies. Non-compliance can lead to rejection or delay of project registration applications.</p>\n\n<p>The rationale behind this directive includes enhancing legal certainty, facilitating enforceability, and ensuring greater promoter accountability. While most State RERAs require submission of partnership or LLP deeds, Rajasthan uniquely demands registered deeds as a precondition for project registration, setting a new compliance benchmark. This move by RajRERA may serve as a model for future procedural tightening by other State RERAs.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/rajrera-mandates-registered-deeds.jpg"
  },
  {
    "title": "Delhi Transgender Rules, 2025: Legal Recognition Procedures and State-Wide Enforcement Mechanisms Notified",
    "description": "<p>On July 11, 2025, the Government of the National Capital Territory of Delhi notified the Delhi Transgender Persons (Protection of Rights) Rules, 2025, to implement the Transgender Persons (Protection of Rights) Act, 2019 within Delhi. These rules establish procedural and institutional frameworks for legal recognition, welfare entitlements, and accountability for transgender persons. They operationalize provisions of the 2019 Act, which recognizes the right to self-perceived gender identity and prohibits discrimination in various sectors.</p>\n\n<p>A key feature of the Delhi Rules is the establishment of a Transgender Welfare Board as the apex coordinating body for safeguarding the rights and welfare of transgender persons in Delhi. The board's responsibilities and composition are defined within the rules.</p>\n\n<p>The rules also outline duties for stakeholder departments, obligating them to implement and report on transgender-inclusive measures and adapt existing schemes to ensure non-discrimination and effective participation of transgender persons across various sectors like health, education, and employment. Grievance redressal mechanisms and safeguards are also addressed.</p>\n\n<p>Effective from July 11, 2025, the rules set a two-year timeline for the government to establish necessary infrastructure and procedures, including public awareness campaigns and training programs. The Delhi Rules represent a progressive step towards inclusion and legal empowerment of transgender persons in Delhi.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/delhi-transgender-rules-2025.jpg"
  },
  {
    "title": "Partnership Continuity Upheld: Supreme Court Rejects IOCL’s Arbitrary Interpretation of Dealership Terms",
    "description": "<p>The Supreme Court's ruling in *Indian Oil Corporation Limited & Ors. v. M/s Shree Niwas Ramgopal & Ors.* affirms the importance of well-drafted partnership deeds and fair conduct from state instrumentalities. The case arose from IOCL's decision to halt kerosene supplies to M/s Shree Niwas Ramgopal, a partnership firm, following the death of one of its partners, citing a rigid interpretation of its internal guidelines.</p>\n\n<p>The court emphasized that Section 42 of the Indian Partnership Act, 1932, regarding dissolution upon a partner's death, primarily applies to two-partner firms, especially when the partnership deed explicitly states continuity is maintained. The court found IOCL's actions arbitrary and in violation of Article 14, as they disregarded the partnership deed's provisions and imposed unreasonable demands on the firm to include all of the deceased's heirs, despite internal disputes.</p>\n\n<p>The Supreme Court upheld the Calcutta High Court's mandamus, directing IOCL to resume kerosene supplies. This decision reinforces the supremacy of partnership agreements and mandates a more pragmatic, fair approach from state entities when dealing with their commercial partners, favoring business continuity over bureaucratic inflexibility. The ruling serves as a reminder for public sector undertakings to act fairly and avoid unnecessary litigation that disrupts established businesses.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/sc-rejects-iocls-dealership-terms.jpg"
  },
  {
    "title": "Madras HC Sets Landmark Precedent Against Online NCII Abuse",
    "description": "<p>The Madras High Court, in *X v. Union of India & Ors.*, delivered a groundbreaking judgment addressing the proliferation of Non-Consensual Intimate Images and Videos (NCII) online. The ruling, prompted by the case of a young advocate whose intimate moments were recorded and circulated without her consent, emphasizes the violation of Article 21 of the Constitution, specifically the Right to Privacy and Dignity.</p>\n\n<p>The court established a concrete framework for addressing NCII abuse. It mandates the Ministry of Electronics and Information Technology (MeitY) to act within 48 hours of receiving complaints, requiring swift removal of content. Digital intermediaries and law enforcement agencies are legally bound to act within 24 hours of notification. The framework requires victims to submit detailed affidavits, sensitized grievance officers across platforms, and a multilingual and accessible National Cybercrime Reporting Portal. Furthermore, it imposes obligations on search engines to employ hash-matching technology to prevent the reappearance of removed content and envisions a government-backed encrypted platform for registering and hashing NCII content.</p>\n\n<p>Justice N. Anand Venkatesh reinforced the message that digital abuse will face swift legal consequences, and victims will not be left to fight alone. The judgment marks a turning point in India's battle against online sexual exploitation and lays a roadmap for reclaiming digital dignity.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/law-on-ncii-abuse-and-victim-rights.jpg"
  },
  {
    "title": "High Court Clarifies Locus Standi for Section 138 NI Act Complaints",
    "description": "<p>The Himachal Pradesh High Court's decision in *Shirgul Filling Station v. Kamal Sharma* emphasizes the strict procedural requirements for cheque dishonor cases under Section 138 of the Negotiable Instruments Act, 1881. The court upheld the dismissal of a complaint filed by a sole proprietorship due to a failure to adequately prove the proprietorship and the legal standing of the person initiating the proceedings.</p>\n\n<p>The Trial Court found that the complainant, Shirgul Filling Station, failed to provide conclusive proof that Shivani Gupta was the proprietor. The authority letter provided by Ankur Aggarwal was deemed invalid as it was issued after the legal notice was sent and the complaint filed, and was not a valid power of attorney. Furthermore, as the cheque was issued to Shirgul Filling Station, and Ankur Aggarwal failed to prove the proprietorship, he could not be considered the \"payee\" as required by Section 138.</p>\n\n<p>The High Court affirmed the Trial Court's decision, dismissing the criminal appeal and upholding the acquittal of Kamal Sharma. The judgment underscores the importance of adhering to procedural requirements, establishing clear locus standi with valid authorization, and ensuring authorization timeliness. This ruling serves as a reminder for litigants, especially those representing sole proprietorships, to ensure proper legal representation and meticulous observation of procedural formalities before initiating action under Section 138 of the NI Act. Failure to do so can result in dismissal, regardless of the underlying financial dispute.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/locus-standi-under-section-138-of-the-ni-act-clarified.jpg"
  },
  {
    "title": "Delhi High Court Quashes FIR in Live-In Relationship Dispute, Imposes Cost for Casual Use of Criminal Law",
    "description": "<p>The Delhi High Court, in a ruling on July 15, 2025, quashed an FIR registered under Sections 69 and 351(2) of the Bharatiya Nyaya Sanhita, 2023, highlighting the misuse of criminal proceedings in disputes arising from a live-in relationship. The case involved Anil Verma, the petitioner, and Respondent No. 2, who had been in a 15-year relationship and cohabitating since 2019.</p>\n\n<p>The initial FIR, filed by the Respondent No. 2 due to misunderstandings, led to allegations of criminal offences. However, the parties subsequently reached an amicable settlement, with the complainant admitting the complaint was filed during a period of emotional distress and no longer wished to pursue the matter. Despite the State's opposition, arguing against setting a compromising precedent in cases involving alleged sexual exploitation, the Court recognized the complainant's autonomy and the personal nature of the dispute.</p>\n\n<p>Justice Swarana Kanta Sharma emphasized that forcing a trial after reconciliation would be counterproductive. However, acknowledging the severity of initiating criminal proceedings based on misunderstandings, the Court imposed a cost of ₹20,000 on the complainant, payable to the Delhi High Court Legal Services Committee, to discourage the casual use of criminal law. Consequently, FIR No. 154/2025 and all related proceedings were quashed. The Court cautioned against using criminal law as a tool for emotional leverage in personal relationships, particularly given the severe legal and reputational consequences.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/live-in-relationship-dispute.jpg"
  },
  {
    "title": "Overpricing Beyond MRP Violates Consumer Law: Thrissur Forum Orders Refund and Compensation",
    "description": "<p>The Consumer Disputes Redressal Commission in Thrissur has reaffirmed the significance of the Legal Metrology Act and consumer rights, ruling that charging even a single rupee over the Maximum Retail Price (MRP) on pre-packaged goods constitutes an unlawful and unfair trade practice. This decision reinforces the protection afforded by the Consumer Protection Act, emphasizing the importance of adhering to the MRP displayed on product packaging.</p>\n\n<p>The case originated when a consumer, Lenish V.R., was charged Rs. 800 for a brandy bottle with an MRP of Rs. 740 at a Kerala State Beverages Corporation (KSBC) outlet. Despite KSBC acknowledging the overcharge, they failed to provide evidence justifying the additional amount. The Commission found that the consumer successfully demonstrated the violation, shifting the burden of proof to KSBC, which they could not fulfill.</p>\n\n<p>The Commission emphasized that as per the Legal Metrology Act, 2009, and the Packaged Commodities Rules, 2011, retailers are prohibited from selling pre-packaged commodities above the MRP, except in cases of valid tax revisions within a specific timeframe, which KSBC could not prove. The Commission also noted that, as a government-owned entity, KSBC has a responsibility to act as a model vendor, upholding consumer rights and statutory norms without exception.</p>\n\n<p>The Commission directed KSBC to refund the excess amount of Rs. 60, provide Rs. 5,000 in compensation for mental distress, and cover Rs. 10,000 in litigation costs, all with interest. Additionally, KSBC was instructed to immediately cease the practice of overcharging for pre-packaged commodities. This ruling serves as a clear warning to retailers, particularly government-owned establishments, regarding the sanctity of MRP and empowers consumers to actively protect their rights against unfair trade practices.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/overpricing-beyond-mrp-violates-consumer-law.jpg"
  },
  {
    "title": "Stamp Duty and Registration Fee Exemption Notified for Life Mission Housing in Kerala",
    "description": "<p>The Government of Kerala has issued an order, effective from July 14, 2025, granting a two-year exemption from stamp duty and registration fees for beneficiaries of the Life Mission housing scheme acquiring land for residential purposes. This initiative, aimed at enhancing housing affordability for economically weaker sections, aligns with the state's commitment to social welfare and housing rights.</p>\n\n<p>The exemption is enabled by the Kerala Stamp Act, 1959, and the Registration Act, 1908, which empower the State Government to remit or reduce stamp duty and registration fees in the public interest. The Life Mission scheme, Kerala’s flagship housing program, aims to provide secure housing to landless and homeless families through financial assistance and infrastructure support.</p>\n\n<p>To avail of the exemption, beneficiaries must present a certificate from the District Collector or authorised Tehsildar confirming their status as a Life Mission beneficiary and the land's exclusive use for constructing a residential dwelling under the scheme. This exemption reduces the financial burden on beneficiaries, potentially saving them 8-10% of the transaction value, while requiring compliance with procedural requirements. Developers and NGOs involved in Life Mission projects should also factor this exemption into their processes, while the state foregoes revenue in favor of long-term social infrastructure development.</p>\n\n<p>This exemption represents a strategic regulatory intervention supporting inclusive housing by removing cost barriers for vulnerable households and reinforcing the State's focus on welfare-centric governance. Legal and compliance professionals should integrate this exemption into relevant transactions, ensuring timely compliance with certification requirements and transaction timelines.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/kerala-exempts-stamp-duty-for-life-mission-housing.jpg"
  },
  {
    "title": "Assam's Coaching Institutes Act: Raising the Bar for Regulation",
    "description": "<p>The Assam Coaching Institutes (Control and Regulation) Act, 2025, represents a significant legislative effort to regulate India's private coaching industry. The Act mandates registration for all coaching institutes operating in Assam and establishes comprehensive standards for academic quality, operational practices, safety, and ethical conduct. A key feature is the prohibition of misleading advertisements, aligning with the Consumer Protection (E-Commerce) Rules, 2020 and raising the regulatory benchmark for the sector.</p>\n\n<p>While primarily targeting brick-and-mortar coaching centers, the Act's implications extend to digital platforms and EdTech companies operating in or targeting Assam. These platforms must ensure that only registered institutes are promoted and avoid misleading claims in their advertising. Institutes are also required to maintain updated websites with disclosures on fees, faculty, and student outcomes, consistent with consumer protection norms.</p>\n\n<p>The Act establishes District Authorities with the power to conduct inspections, register complaints, and enforce penalties for non-compliance, including fines and potential imprisonment. Unlike other states with administrative guidelines, Assam's law provides a structured and enforceable framework, marking a shift toward greater compliance in the marketing and delivery of education in India.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/assams-new-coaching-regulation-law-explained.jpg"
  },
  {
    "title": "Divorce in the Digital Age: SC Allows Secretly Taped Calls Between Spouses",
    "description": "<p>In *Vibhor Garg v. Neha*, the Supreme Court of India ruled that secretly recorded telephonic conversations between spouses are admissible as evidence in matrimonial proceedings like divorce, clarifying a key point of law in the digital age. The Court held that spousal privilege under Section 122 of the Indian Evidence Act, 1872, does not bar such recordings when the dispute is between the spouses themselves.</p>\n\n<p>The case involved a husband seeking to introduce audio recordings as evidence of cruelty in divorce proceedings. The Supreme Court overturned a High Court decision that had disallowed the evidence based on privacy concerns, affirming the Family Court's initial decision to admit the recordings. The Court clarified that Section 122 contains an exception for suits between spouses, and the right to privacy under Article 21, while fundamental, is not absolute and must be balanced against the right to a fair trial.</p>\n\n<p>The Supreme Court reaffirmed the existing test for admitting secretly recorded conversations, emphasizing that lack of consent alone does not render evidence inadmissible. Further, electronic records, including audio recordings, are admissible under Sections 65A and 65B of the Evidence Act, provided the necessary certification is submitted. While not issuing binding procedural safeguards, the Court acknowledged the need for caution and suggested factors for Family Courts to consider when evaluating such evidence, including proportionality, intent, and evidentiary safeguards. The ruling balances the right to privacy with the imperatives of justice, allowing relevant evidence to be considered while acknowledging the potential for misuse.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/sc-validates-secretly-recorded-telephonic-conversation.jpg"
  },
  {
    "title": "FSSAI Implements Strict Scrutiny of Annual Returns with Limited Correction Window",
    "description": "<p>The Food Safety and Standards Authority of India (FSSAI) has mandated a rigorous scrutiny regime for Annual Returns (ARs) filed by Food Business Operators (FBOs), effective July 7, 2025. This initiative aims to ensure accurate and truthful reporting as required by Clause 2.1.13 of the 2011 Licensing Regulations and subsequent orders mandating online filing via FoSCoS.</p>\n\n<p>Licensing Authorities are now required to meticulously verify all aspects of the AR, including production figures and compliance data. Discrepancies or false declarations will result in penal action under Section 61 of the FSS Act, 2006. While a paid correction window exists for FBOs to rectify errors, strict adherence to accurate record-keeping and timely corrections via FoSCoS is crucial.</p>\n\n<p>The new measures emphasize the importance of disciplined compliance for FBOs. Accurate disclosures are now non-negotiable, and failure to comply may lead to fines, suspension, or cancellation of licenses. By prioritizing verifiable records and utilizing the correction window, FBOs can maintain legal standing and enhance consumer trust.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/fssai-on-annual-returns-of-food-businesses.jpg"
  },
  {
    "title": "Trademark Protection Upheld: Himachal Pradesh High Court Grants Relief to Old Monk Manufacturer",
    "description": "<p>The Himachal Pradesh High Court recently issued an interim order in a trademark infringement case, restraining Eston Roman Brewery & Distillery Pvt. Ltd. from manufacturing and selling its \"Old Mist\" coffee rum. The ruling supports Mohan Meaking Ltd., the manufacturer of the globally recognized \"Old Monk\" coffee-flavored rum, finding a prima facie case of infringement.</p>\n\n<p>Mohan Meaking Ltd. initiated the suit against Eston Roman Brewery, alleging that the defendant's \"Old Mist\" product closely resembled their registered trademark, \"Old Monk Coffee.\" The plaintiff's trademark is valid until 2031, while the defendant possesses no such registration. The plaintiff argued that the visual and conceptual similarity between the products could mislead consumers, potentially damaging the plaintiff's brand reputation as the third-largest rum manufacturer globally.</p>\n\n<p>After examining the products, labels, and trademark certificates, the Court determined that Mohan Meaking Ltd. had established a strong case for trademark infringement. The Court expressed concern that the defendant's continued sales would result in unfair advantage, passing off, and irreparable harm to the plaintiff's established goodwill. Consequently, the Court granted the interim injunction, preventing the defendant from selling or distributing the infringing product until further notice, emphasizing the importance of protecting established trademarks within the liquor industry.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/old-monk-trademark-gets-relief-in-hp.jpg"
  },
  {
    "title": "Beyond the Marriage: Gujarat High Court Clarifies Scope of Dowry Death Law",
    "description": "<p>The Gujarat High Court, in *State of Gujarat v. Natubhai Golanbhai Khuman & Ors.*, upheld the acquittal of the accused in a dowry death case, emphasizing the necessity of strong evidence for convictions under Sections 304B, 306, 498A, and 114 of the IPC. The case involved a woman who allegedly committed suicide after her in-laws demanded money for legal expenses.</p>\n\n<p>The prosecution argued that the in-laws harassed the woman to procure ₹50,000 from her father for bail in an unrelated land forgery case, leading her to take her own life. Initially, the FIR was registered under Sections 306 and 498A IPC, and later Section 304B was added, but the trial court acquitted the accused due to lack of evidence.</p>\n\n<p>The High Court affirmed the acquittal, clarifying that not every post-marital demand qualifies as \"dowry\" under the Dowry Prohibition Act, 1961. The court reasoned that the demand for bail money was a post-marital financial dispute, not a dowry demand made \"in connection with the marriage.\" However, the court also cautioned that while the demand didn't constitute dowry, the conduct could still amount to \"cruelty\" under Section 498A or abetment to suicide under Section 306, provided sufficient evidence exists. The court's decision was based on unproven medical causes of death, a lack of credible evidence of financial harassment, and accused having sufficient funds that contradicted the prosecution's narrative.</p>\n\n<p>The judgment underscores the importance of prosecutors carefully framing charges, gathering reliable evidence, and distinguishing between dowry-linked demands and other forms of oppressive conduct. While the decision is legally sound regarding Section 304B, it should not diminish the seriousness of non-dowry related cruelty, which remains actionable under other IPC provisions.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/gujarat-hc-clarifies-dowry-death-law.jpg"
  },
  {
    "title": "Maharashtra Government Grants Full Stamp Duty Remission for Integrated Township Projects in MMR",
    "description": "<p>The Maharashtra government has announced a complete remission of stamp duty on the first instrument of conveyance for designated land parcels within the Mumbai Metropolitan Region (MMR) aimed at Integrated Township Projects. This decision, formalized through an order issued on July 7, 2025, by the Revenue and Forests Department, builds upon a previous order from June 20, 2023, which had already reduced stamp duty by 50% for properties within Development and Regional Plans approved for Integrated Township Projects.</p>\n\n<p>The full remission specifically applies to the development of Growth Centers within the MMR by the Mumbai Metropolitan Region Development Authority (MMRDA), executed through a Special Purpose Vehicle (SPV), M/s. Raigad Pen Growth Centre Ltd. This concession, deemed necessary in the public interest, covers the remaining 50% of the stamp duty for the initial conveyance related to 1217.71 acres of land parcels explicitly identified in the joint venture agreement and approved under the Maharashtra Regional and Town Planning Act, 1966. The conditions outlined in the June 20, 2023, order remain applicable.</p>\n\n<p>This complete stamp duty remission provides a significant financial incentive for large-scale integrated township projects by eliminating a substantial transaction cost. It is anticipated to accelerate development, attract greater investment in urban infrastructure, and contribute to meeting the growing demand for well-planned residential, commercial, and recreational spaces in the MMR. Stakeholders should carefully review the details of this order, in conjunction with the stipulations of the June 20, 2023, order, to maximize its benefits.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/stamp-duty-remission-for-integrated-township-projects-in-mmr.jpg"
  },
  {
    "title": "No Payout for Peril: Supreme Court Says Heirs Can’t Claim Insurance for Driver’s Own Negligence",
    "description": "<p>The Supreme Court of India upheld the Karnataka High Court's decision, reinforcing the principle that the legal heirs of a person who dies due to their own negligent driving cannot claim compensation under the Motor Vehicles Act, 1988. The case, *G Nagarathna & Ors. vs. G Manjunatha & Anr.*, stems from a fatal accident where the driver's excessive speed and traffic violations led to his death. His family's claim for compensation was rejected by both the Motor Accidents Claims Tribunal and the High Court.</p>\n\n<p>The Supreme Court, in dismissing the family's appeal, affirmed the established tort law principle that individuals cannot benefit from their own wrongdoing. The Court reasoned that a borrower of a vehicle assumes the responsibilities and risks of ownership, including the duty to drive safely. Awarding compensation in such cases would contradict fundamental tort principles and public policy.</p>\n\n<p>This ruling clarifies that while the legal heirs of a negligent driver cannot claim compensation for the driver’s death, valid claims made by third parties injured due to the deceased’s negligence remain actionable under the Motor Vehicles Act. The decision discourages reckless driving and safeguards the integrity of the insurance system by preventing individuals from profiting from their own negligent acts. It ensures that the compensation framework isn't an unintended incentive for unlawful behavior on the roads, and reinforces accountability under the Motor Vehicles Act.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/no-insurance-drivers-own-negligence.jpg"
  },
  {
    "title": "No Right to Reschedule Exams: Chhattisgarh HC Clarifies Scope of UGC’s Dual Degree Flexibility",
    "description": "<p>The Chhattisgarh High Court, in *Satyendra Prakash Suryawanshi v. State of Chhattisgarh & Ors.*, clarified the scope of the UGC's dual degree policy, stating that students pursuing two degrees simultaneously cannot demand judicial intervention to reschedule examinations due to overlapping schedules. The court emphasized that while the NEP 2020 and associated UGC guidelines permit dual enrollment, the responsibility for managing conflicting schedules lies with the student.</p>\n\n<p>The case arose from a petitioner enrolled in both a Master of Social Work program and an LL.B. program, whose final examination schedules clashed. He argued that this infringed upon his fundamental right to education. However, the court rejected this argument, asserting that the right to education does not extend to compelling universities to adjust their administrative functions for individual benefit.</p>\n\n<p>The ruling reinforces that universities retain administrative autonomy and are not legally obligated to modify examination schedules for individual student's convenience. The judgment serves as a caution to students, highlighting the need for careful planning and management of multiple academic commitments when pursuing dual degrees under the UGC framework. The court underscored that it will not intervene in the day-to-day administration of academic institutions to accommodate personal convenience.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/no-rescheduling-ugc-dual-degree.jpg"
  },
  {
    "title": "Rajasthan Eases Night Work Restrictions for Women in Commercial Establishments",
    "description": "<p>The Rajasthan Labour Department, effective July 8, 2025, has issued a notification allowing registered shops and commercial establishments to employ women during night hours under specified conditions, according to the Rajasthan Shops and Commercial Establishments Act, 1958. Employers must obtain explicit consent from women employees and provide appointment letters and photo ID cards.</p>\n\n<p>The notification emphasizes the employer's responsibility for the safety and security of women working at night. This includes providing safe transportation to and from work, separate restrooms and lockers, and maternity protection, exempting pregnant women from night duty three months before and after childbirth.</p>\n\n<p>Stringent measures to prevent sexual harassment are mandated, and any violation of these conditions will result in the automatic termination of the exemption, with the employer held responsible for legal action. The notification, issued by the order of the Governor aims to balance flexibility for businesses with the safety and welfare of women employees.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/night-work-restrictions-for-women.jpg"
  },
  {
    "title": "Insolvency and Bankruptcy Board of India Strengthens Corporate Insolvency Resolution Process with New Amendments",
    "description": "<p>The Insolvency and Bankruptcy Board of India (IBBI) has amended the Insolvency Resolution Process for Corporate Persons Regulations, 2016 (CIRP Regulations), effective July 4th, 2025. These amendments focus on bolstering transparency, accountability, and the handling of avoidance transactions within the corporate insolvency resolution process.</p>\n\n<p>A key change involves enhanced disclosure requirements for the Information Memorandum (IM). Resolution Professionals (RPs) are now obligated to include comprehensive details of identified avoidance transactions, fraudulent activities, or wrongful trading within the IM. This includes transactions potentially designed to defraud or unfairly disadvantage creditors. The RP must also keep the IM updated and provide it periodically to the Committee of Creditors (CoC), ensuring access to current and comprehensive information for informed decision-making.</p>\n\n<p>Furthermore, the amendments address the treatment of disclosed transactions in the resolution plan, restricting the assignment of any avoidance transactions or fraudulent or wrongful trading. The objective is to guarantee stakeholders are fully aware of potentially problematic transactions, enabling better decisions and maximizing the value of the corporate debtor's assets.</p>\n\n<p>The amendments are designed to facilitate informed decision-making by the CoC and resolution applicants, enhance transparency and accountability in the insolvency resolution process, and maximize the value of the corporate debtor’s assets through better price discovery. By mandating enhanced disclosure and regulating the treatment of disclosed transactions, the IBBI aims to foster a more transparent and accountable insolvency resolution process, thereby protecting the interests of creditors and other stakeholders.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/corporate-insolvency-resolution-process.jpg"
  },
  {
    "title": "Telangana Government Eases Working Hours for Commercial Establishments",
    "description": "<p>The Telangana government has introduced reforms to enhance the ease of doing business by allowing employees in commercial establishments (excluding shops) to work up to 10 hours per day, with a weekly limit of 48 hours. This change, implemented through a notification by the Labour, Employment, Training & Factories Department under the Telangana Shops and Establishments Act, 1988, exempts commercial establishments from certain sections of the act to provide more flexible working hours.</p>\n\n<p>Under these new regulations, employees are entitled to overtime wages for work exceeding the stipulated limits, and a mandatory 30-minute rest interval is required after six hours of work. The total work period, including rest, cannot exceed twelve hours per day. While employees can work beyond 48 hours per week with overtime pay, a quarterly limit of 144 overtime hours is enforced.</p>\n\n<p>To ensure compliance, the government has established oversight mechanisms, including the revocation of exemption orders for any violations. Published in the Telangana Gazette on July 8, 2025, these reforms aim to promote economic growth by supporting business efficiency while maintaining fair labor practices and protecting employee rights.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/telangana-eases-working-hours-for-commercial-establishments.jpg"
  },
  {
    "title": "Judicial Clarification on OPC Liability in Arbitration: Bombay High Court in Saravana Prasad v. Endemol India Pvt. Ltd.",
    "description": "<p>The Bombay High Court, in *Saravana Prasad v. Endemol India Pvt. Ltd.*, has clarified the liability of One Person Companies (OPCs) and their sole shareholders in arbitration proceedings. The Court set aside an arbitral tribunal's interim order imposing personal deposit and disclosure obligations on Mr. Saravana Prasad, the sole shareholder of Innovative Film Academy Pvt. Ltd. (an OPC), reaffirming the principle of limited liability under Indian corporate law.</p>\n\n<p>The dispute arose from a production agreement between Innovative and Endemol, resulting in ₹10.40 crores in unpaid invoices. The arbitral tribunal's interim order, under Section 17 of the Arbitration and Conciliation Act, 1996, directed both Innovative and Mr. Prasad to deposit the disputed amount and disclose assets.</p>\n\n<p>The Court ruled that while requiring Innovative to secure the disputed amount was fair, extending this obligation to Mr. Prasad personally was unsustainable. It emphasized that an OPC is a distinct legal entity under Section 2(62) of the Companies Act, 2013, offering limited liability. Being a sole shareholder or director does not equate to personal liability absent contractual liability, fraud, or misuse. Imposing personal obligations on Mr. Prasad undermined the legislative intent behind OPCs.</p>\n\n<p>The Bombay High Court partially allowed the appeal, setting aside the personal obligations imposed on Mr. Prasad while upholding the requirements for Innovative. This ruling reaffirms corporate separateness and limited liability, protecting individual entrepreneurs in OPCs from personal financial exposure unless specific legal thresholds are met.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/saravana-prasad-v-endemol-india-pvt-ltd.jpg"
  },
  {
    "title": "FSSAI Enhances Food Safety Standards for E-commerce Platforms in India",
    "description": "<p>The Food Safety and Standards Authority of India (FSSAI) has issued stringent directives to enhance food safety standards on e-commerce platforms nationwide. This initiative followed a meeting held on July 8, 2025, with over 70 representatives from leading e-commerce companies, emphasizing the critical importance of food safety within the rapidly growing online food supply chain.</p>\n\n<p>Key directives issued by the FSSAI require e-commerce platforms to prominently display their FSSAI license/registration numbers on all receipts and invoices, along with information about the Food Safety Connect App. Platforms must also disclose comprehensive details and regular photographic updates of all warehouses and storage facilities on the FoSCoS portal. Discussions included the potential display of “Date of Expiry/Use By” information for food products at the consumer interface.</p>\n\n<p>Furthermore, the FSSAI mandates strict adherence to hygiene and food safety protocols in all warehouses, compulsory FoSTaC training for all food handlers, and meticulous compliance with all SOPs under the FSS Act. Platforms are also required to share relevant data regarding warehouses and food handlers with the FSSAI to enhance transparency and accountability.</p>\n\n<p>The FSSAI emphasized that food safety is a collective responsibility, involving all entities in the supply chain. This proactive approach aims to guarantee that consumers receive safe and healthy food products purchased through e-commerce, reinforcing FSSAI's commitment to public health and consumer trust in the evolving landscape of online food delivery.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/food-safety-for-e-commerce.jpg"
  },
  {
    "title": "Bombay High Court Balances Redevelopment Rights with Possessory Protection in Matrimonial Dispute",
    "description": "<p>The Bombay High Court, in *Ritesh Haldar v. Elite Housing LLP*, ruled that redevelopment processes cannot circumvent legal eviction procedures for individuals in lawful possession, even without ownership. The case involved competing claims to a flat undergoing redevelopment, focusing on the intersection of matrimonial rights, property possession, and redevelopment logistics.</p>\n\n<p>The dispute centered on a flat being redeveloped by Elite Housing LLP, where Leena, the wife of one of the owner's brothers, resided with her children, claiming it as her matrimonial home. While she didn't claim ownership, she opposed the redevelopment without compensation and alternate accommodation. Ritesh, claiming ownership, sought to hand over the flat, viewing Leena as a gratuitous licensee.</p>\n\n<p>The court emphasized that redevelopment cannot replace formal eviction processes, reinforcing that Leena's eviction required a court decree. The court cited precedents highlighting that the person in actual possession at the time of redevelopment is entitled to transit rent and restoration of possession in the redeveloped property. While acknowledging Ritesh's ownership, the court directed the Permanent Alternate Accommodation Agreement (PAAA) be executed in his name, and that he receive hardship compensation, but this did not affect Leena’s possessory rights.</p>\n\n<p>Ultimately, the Court endorsed a dual-track approach, recognizing Ritesh’s rights as legal owner for purposes of contractual execution and compensation, while protecting Leena’s possessory rights during and after redevelopment. Leena will receive transit rent and possession of the redeveloped flat, subject to the outcome of an existing eviction suit. The ruling underscores the importance of lawful possession and due legal process in redevelopment projects, balancing ownership rights with possessory protection.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/redevelopment-rights-in-matrimonial-dispute.jpg"
  },
  {
    "title": "Allahabad HC Denies Bail, Orders Rapid Trial in Digital Crime Case Involving Obscene Image Circulation",
    "description": "<p>The Allahabad High Court denied bail to Ramdev, the primary accused in a case involving the unauthorized circulation of a woman's obscene images on WhatsApp. Justice Ajay Bhanot emphasized the judiciary's firm stance against cyber-enabled offenses, cautioning against the misuse of digital technologies that can inflict irreversible damage.</p>\n\n<p>The case, registered as Case Crime No. 5 of 2025, involves charges under the Bharatiya Nyaya Sanhita 2023 and the Information Technology Act, 2000. The prosecution is supported by digital evidence, including explicit photographs recovered from Ramdev's device, currently undergoing analysis at the Forensic Science Laboratory (FSL). The court expressed concern over the weaponization of digital tools for non-consensual sharing of private content, highlighting the trauma and virality associated with such acts.</p>\n\n<p>The High Court, in its June 2, 2025 ruling, cited the severity of the charges, the strength of digital evidence, and the risk of misuse as factors against granting bail. The court directed the trial court to conclude proceedings within one year. To expedite the process, the Deputy Director of the FSL was ordered to submit the final report within two months. The court also mandated strict witness management and empowered the trial court to impose costs for unwarranted delays. Police authorities were instructed to execute warrants promptly, and the Commissioner of Police, Prayagraj, must submit periodic affidavits on the execution status.</p>\n\n<p>The Allahabad High Court's order signifies a commitment to addressing cyber-crimes effectively and promptly, combining judicial scrutiny, digital-forensic prioritization, and institutional accountability.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/hc-acts-swiftly-in-digital-crime-case.jpg"
  },
  {
    "title": "Enabling the 24-Hour Workforce: Haryana’s 2025 Notification Opens Night Shifts to Women Workers",
    "description": "<p>The Haryana Labour Department issued a notification on July 4, 2025, permitting women to work night shifts (7:00 PM to 6:00 AM) in factories, marking a significant step toward gender inclusivity. This policy aligns with the growing trend of balancing equal opportunity with necessary workplace protections.</p>\n\n<p>Historically, Section 66(1)(b) of the Factories Act, 1948, restricted women from working night shifts, but this provision has been challenged as discriminatory. The Haryana notification, issued under No. 11/6/2022-4Lab, supersedes previous notifications and sets forth comprehensive conditions for factories employing women at night.</p>\n\n<p>Key requirements include voluntary written consent from women workers, full compliance with the POSH Act, enhanced workplace safety measures including CCTV surveillance, mandatory transportation, readily available medical assistance, and adherence to all applicable labor laws, including the Factories Act, 1948 and the Equal Remuneration Act. Employers must also report any untoward incident immediately, implement a self-certification mechanism, and be aware that the government may impose additional conditions. The exemption granted is valid for one year.</p>\n\n<p>This notification represents a progressive move, removing outdated restrictions while enhancing employer accountability. It positions Haryana alongside states like Maharashtra, Tamil Nadu, Karnataka, and Uttar Pradesh, which have similar exemptions, and supports India's expanding manufacturing base by promoting economic participation and gender justice in industrial employment.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/haryana-opens-night-shifts-for-women.jpg"
  },
  {
    "title": "IndiaLaw Monthly Newsletter – June Edition: Corporate & Commercial Highlights",
    "description": "<p>This newsletter summarizes key legal and regulatory updates in India's corporate and commercial landscape.</p>\n\n<p>The Reserve Bank of India (RBI) has mandated Know Your Customer (KYC) compliance and enhanced monitoring for Aadhaar-enabled Payment System (AePS) operators. This new compliance framework is set to take effect in January 2026, aiming to bolster security and transparency within the digital payment ecosystem.</p>\n\n<p>The Unique Identification Authority of India (UIDAI) has notified the first amendment to the Aadhaar Regulations, 2025. This amendment introduces changes impacting both individuals and institutions utilizing the Aadhaar system, the specifics of which are detailed in the full notification.</p>\n\n<p>The Calcutta High Court has reaffirmed the enforceability of arbitration clauses within purchase orders. The ruling in *Super Smelters Ltd. v. Universal Cables Ltd.* reinforces the importance of upholding contractual agreements for dispute resolution.</p>\n\n<p>Finally, a recent legal analysis clarifies the threshold for establishing pre-existing disputes under Section 8(2)(a) of the Insolvency and Bankruptcy Code (IBC). The analysis cautions against relying on vague communications, such as WhatsApp messages, as sufficient proof of a pre-existing dispute.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/indialaw-monthly-newsletter-june-edition.jpg"
  },
  {
    "title": "UIDAI Notifies First Amendment to Aadhaar Regulations, 2025: Implications for Individuals and Institutions",
    "description": "<p>On July 2, 2025, the Unique Identification Authority of India (UIDAI) issued the Aadhaar (Enrolment and Update) First Amendment Regulations, 2025, under Section 54(1) and (2) of the Aadhaar Act, 2016. These amendments aim to bolster identity integrity, streamline documentation, and rationalize Aadhaar procedures. The changes particularly impact Regulation 27 and Schedule II, and are relevant for entities across sectors including banking, fintech, insurance, education, HR, and immigration.</p>\n\n<p>The amendment addresses the issue of multiple Aadhaar numbers issued to the same person. It stipulates that when multiple Aadhaar numbers are found for a single individual, the earliest assigned Aadhaar number containing biometric information will be retained, and all others will be deactivated. If no Aadhaar number contains biometric data, the earliest assigned number will be retained.</p>\n\n<p>Furthermore, the notification replaces Schedule II with a comprehensive list of acceptable documents for enrolment and updates, categorized by specific parameters and includes special provisions. Entities relying on Aadhaar for authentication must update their systems, retrain staff, and conduct compliance audits to align with the new regulations. Failure to comply could lead to operational disruptions and regulatory scrutiny.</p>\n\n<p>In conclusion, the 2025 amendment to the Aadhaar (Enrolment and Update) Regulations enhances the reliability of Aadhaar-based identification by clarifying the treatment of multiple Aadhaar numbers and standardizing required documentation. Regulated entities must promptly update their compliance frameworks to ensure lawful use of Aadhaar credentials and mitigate associated risks.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/uidai-aadhaar-rules-amended.jpg"
  },
  {
    "title": "Determining Pre-Existing Disputes Under Section 8(2)(a) of the IBC: The Vague WhatsApp Message don’t prove pre-existing dispute",
    "description": "<p>In a recent ruling, the National Company Law Appellate Tribunal (NCLAT) overturned a National Company Law Tribunal (NCLT) decision regarding an insolvency case between Mrs. Leena Salot (Riddhim Textiles) and Ridham Synthetics Private Limited. The case hinged on the interpretation of debt and the existence of pre-existing disputes under the Insolvency and Bankruptcy Code, 2016 (IBC).</p>\n\n<p>Mrs. Salot filed a petition under Section 9 of the IBC to initiate the Corporate Insolvency Resolution Process (CIRP) against Ridham Synthetics for non-payment of an outstanding operational debt. The NCLT dismissed the petition, prompting Mrs. Salot to appeal to the NCLAT. Mrs. Salot argued that the outstanding amount was admitted by Ridham Synthetics in their ledger statements, through part payments and also contended that the Respondent had availed the benefit of Input Tax Credit under the CGST Act, 2017, indicating their acknowledgment of the invoices.</p>\n\n<p>Ridham Synthetics claimed that the invoices were for goods not delivered or of inferior quality. They cited a WhatsApp message as evidence of a pre-existing dispute regarding the quality of goods. They also contended that the Appellant had invoked arbitration, acknowledging the existence of pre-existing disputes, and thus the Section 9 petition was not maintainable.</p>\n\n<p>The NCLAT, referencing Section 9 of the IBC and the judgment in *Mobilox Innovations Pvt. Ltd. vs. Kirusa Software Pvt. Ltd.*, emphasized that disputes must be plausible. The tribunal found that Ridham Synthetics had acknowledged the debt in their ledger statements and through part payments. The NCLAT deemed the WhatsApp message vague and insufficient to prove a pre-existing dispute.</p>\n\n<p>Ultimately, the NCLAT set aside the NCLT’s order, restored the original petition, and directed both parties to reappear before the NCLT for further proceedings. This decision highlights the necessity of demonstrating a crystallized debt and providing concrete evidence to substantiate claims of pre-existing disputes under the IBC.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/whatsapp-message-dont-prove-pre-existing-dispute.jpg"
  },
  {
    "title": "Impleading Petitions Can Be Entertained at Any Stage Before Judgment: Madras High Court Clarifies",
    "description": "<p>The Madurai Bench of the Madras High Court, in *P. Marimuthu v. S.S. Prabhakaran*, reaffirmed that impleading petitions can be entertained at any stage before judgment, clarifying the application of Order I Rule 10(2) of the Code of Civil Procedure (CPC) and the doctrine of lis pendens. This decision strengthens the rights of transferees pendente lite.</p>\n\n<p>The dispute arose from a suit for specific performance where the defendant sold the property to P. Marimuthu during the suit's pendency. The trial court dismissed Marimuthu's impleading petition, arguing the suit was reserved for judgment. Marimuthu appealed, contending he was a bona fide purchaser entitled to be heard, while the plaintiff argued that the impleading application was belated and Marimuthu was bound by lis pendens.</p>\n\n<p>The High Court held that transfers pendente lite are subservient to the rights of parties in litigation under Section 52 of the Transfer of Property Act. However, relying on Supreme Court precedent, the court emphasized that transferees pendente lite have a significant interest in defending their title and should generally be allowed to participate, especially when the original party may not properly contest the suit. The Court explicitly rejected the notion that impleading petitions are inadmissible once a matter is reserved for judgment, stating that \"at any stage of the proceedings\" in Order I Rule 10(2) CPC means any time before judgment pronouncement. The Court allowed the appeal and directed the trial court to accept the impleading application, permit cross-examination of the plaintiff, and allow formal evidence regarding the sale deed.</p>\n\n<p>This judgment reinforces the principle that procedural technicalities should not defeat substantial rights, particularly when collusion or prejudice to a transferee exists. It reminds transferees pendente lite that while lis pendens limits their rights, it does not extinguish them. Trial courts are reminded to exercise their power to implead parties under Order I Rule 10(2) CPC sensitively, even at advanced stages of proceedings. Ultimately, *P. Marimuthu v. S.S. Prabhakaran* reaffirms the judiciary's commitment to protecting bona fide purchasers and upholding justice by allowing impleading petitions before judgment, balancing the sanctity of litigation with preventing procedural injustice.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/impleading-petitions-valid-till-judgment.jpg"
  }
]