[
  {
    "title": "Clock-Out Forever: How NCLT Told Ex-Workers That Missing the CIRP Deadline Means Missing the Money",
    "description": "<p>The National Company Law Tribunal (NCLT) Mumbai recently dismissed claims by former employees of Indo Global Soft Solutions and Technologies Pvt. Ltd., delivering a critical judicial pronouncement on the strict adherence to statutory timelines within the Corporate Insolvency Resolution Process (CIRP) under the Insolvency and Bankruptcy Code (IBC). Six former employees sought judicial intervention for unpaid salaries and dues, but their claims, submitted on October 25, 2023, were significantly past the initial deadline of May 4, 2022, and crucially, after the Committee of Creditors had already approved a resolution plan.</p>\n\n<p>The applicants contended ignorance of the CIRP process and deadlines. However, the NCLT unequivocally ruled that the public announcement made pursuant to IBC regulations constituted \"deemed knowledge.\" Further, their previous engagement with the Indian Institute of Insolvency Professionals contradicted their claims of unawareness. The Tribunal's decision was heavily influenced by Supreme Court precedents, which consistently emphasize the responsibility of stakeholders to remain vigilant and compliant with established IBC timelines.</p>\n\n<p>Dismissing the applications, the NCLT reinforced the fundamental principle that timely claims submission is paramount. It emphasized that entertaining such belated applications would contravene the essential spirit and structure of the IBC, potentially undermining the integrity and efficiency of the entire resolution process and prolonging it unnecessarily. This ruling serves as a definitive precedent, highlighting that all stakeholders, including employees, must exercise due diligence, remain informed, and be proactive in protecting their interests within the designated time frames, as claims of ignorance do not constitute valid grounds for exemption from statutory timelines.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/nclt-mumbai-late-cirp-claims-get-no-relief.jpg"
  },
  {
    "title": "Land Acquisition Arbitration and Writ Jurisdiction: Constitutional Limitations in the Wake of Suryadev Pathak vs. Union of India",
    "description": "<p>The Allahabad High Court's judgment in Suryadev Pathak vs. Union of India elucidates the jurisdictional limitations of constitutional courts when statutory remedies are available. The case stemmed from Suryadev Pathak, a landowner, seeking enhanced compensation for land acquired under the National Highways Act, 1956, for the Bharat Mala Scheme. Dissatisfied with the initial compensation, Pathak invoked the arbitration mechanism specified in Section 3G(5) of the Act.</p>\n\n<p>When the appointed arbitrator delayed rendering a decision for over two years, Pathak filed a writ petition under Article 226, alleging violations of his constitutional rights (Articles 14, 21, 300-A) and seeking expeditious resolution. The respondents countered, arguing that the High Court lacked jurisdiction as the Arbitration and Conciliation Act, 1996 (A&C Act), provides a comprehensive framework, including provisions for timeline extensions exclusively by designated civil courts, not constitutional courts.</p>\n\n<p>The High Court's analysis centered on the maintainability of writ jurisdiction when alternative statutory remedies exist, and the validity of mandating arbitration after statutory timelines expire. The court reasoned that upon the expiration of timelines prescribed by the A&C Act, specifically Section 29A, an arbitrator's mandate ceases. Consequently, any subsequent proceedings for timeline extensions must be adjudicated by competent civil courts, not through extraordinary writ jurisdiction, to prevent undermining legislative schemes and encouraging forum shopping.</p>\n\n<p>The court dismissed the writ petition, establishing three fundamental principles: arbitration under Section 3G(5) of the NH Act is governed by the A&C Act; constitutional courts cannot exercise writ jurisdiction where specific and efficacious statutory remedies exist; and only competent civil courts possess the authority to extend arbitration timelines after an arbitrator's mandate expires. This judgment reinforces the integrity of specialized legislative frameworks, emphasizing the primacy of statutory arbitration over extraordinary constitutional intervention in land acquisition disputes.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/allahabad-hc-limits-writs-in-land-arbitration-case.jpg"
  },
  {
    "title": "Judicial Intervention And The Seat Of Arbitration: Balancing Autonomy And Justice In India",
    "description": "<p>The \"seat of arbitration\" traditionally defines the juridical home of proceedings and the supervising courts, typically limiting judicial interference. However, recent Indian cases illustrate an evolving landscape, demonstrating a nuanced approach where courts balance party autonomy with the need for justice-oriented flexibility.</p>\n\n<p>In Engineering Projects (India) Ltd. v. MSA Global LLC, the Delhi High Court granted an interim injunction, halting a Singapore-seated arbitration due to concerns over procedural fairness and arbitrator bias. This rare intervention signals that party autonomy is not absolute, allowing Indian courts to act as guardians of justice in extraordinary circumstances.</p>\n\n<p>Conversely, in Rhutikumari v. Zanmai Labs Pvt. Ltd., the Madras High Court granted interim relief concerning domestic cryptocurrency assets in a Singapore-seated arbitration. The court reasoned that intervention was justified because the cause of action and the property were located in India, highlighting a willingness to protect domestic interests.</p>\n\n<p>Together, these cases reveal an emerging hybrid model in Indian arbitration jurisprudence. While the courts of the chosen seat generally retain supervisory control, Indian courts may exercise exceptional, limited intervention. This intervention is applied either to safeguard procedural fairness and prevent irreparable harm (as seen in Engineering Projects) or to protect domestic assets and interests (as in Rhutikumari). This approach ensures that the seat doctrine provides predictability and autonomy without sacrificing justice, reflecting India's pragmatic integration of global norms with equitable safeguards.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/judicial-intervention-and-the-seat-of-arbitration-in-india.jpg"
  },
  {
    "title": "Preserving Truth In The Digital Era: Blockchain As The Next Guardian Of Evidence Integrity",
    "description": "<p>This article explores the transformative potential of blockchain technology in reforming India’s property registration system, as spotlighted by the Supreme Court’s Samiullah v. State of Bihar (2025) judgment. The Court invalidated Bihar’s restrictive requirement of mutation proof for property registration, reaffirming the legal distinction between registration and ownership. This pivotal ruling highlighted the urgent need for systemic reforms, positioning blockchain as a powerful solution for achieving transparent, tamper-proof, and conclusive land title records.</p>\n\n<p>Blockchain offers a decentralized ledger that guarantees the immutability, transparency, and security of property records. Every entry is cryptographically linked, making data practically tamper-proof once recorded. Integrating blockchain with cadastral maps and revenue records can enhance transparency, drastically reduce fraudulent practices, and lower property-related disputes. The technology's ability to provide a verifiable, time-stamped audit trail also strengthens institutional trust, simplifies title searches, and ensures long-term preservation of evidence, addressing concerns about centralized system vulnerabilities.</p>\n\n<p>Beyond land records, blockchain could safeguard court filings, government orders, and contracts, bridging the gap between technological capability and legal certainty. The Samiullah ruling signals a paradigm shift, inviting policymakers and technologists to develop a verifiable digital chain of custody. Embracing blockchain represents a pivotal moment in modernizing property law, securing the integrity of justice, and ensuring that truth in the digital age remains as unassailable as it is on paper.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/blockchain-and-evidence-integrity-supreme-courts-vision.jpg"
  },
  {
    "title": "CIRP Cannot Be Reopened Post CoC Approval, Rules NCLT",
    "description": "<p>The National Company Law Tribunal (NCLT), Mumbai Bench, has dismissed six belated claims from former employees of Indo Global Soft Solutions and Technologies Pvt. Ltd., reinforcing that the Corporate Insolvency Resolution Process (CIRP) cannot be reopened post-Committee of Creditors (CoC) approval of a resolution plan.</p>\n\n<p>The employees submitted their claims for unpaid salaries, PF, and other dues nearly eighteen months after the statutory deadline of May 4, 2022. Crucially, these claims were filed only after the CoC had twice approved a resolution plan and the Tribunal had already reserved orders on the second plan in August 2025.</p>\n\n<p>The NCLT's decision rested on three pillars: strict adherence to IBC timelines (Regulation 12(1) and 13(1B)), finding a lack of bona fides in the applicants' conduct, and upholding the necessity of procedural discipline and finality in CIRP. The Tribunal rejected arguments of ignorance, noting employees had previously engaged professionally regarding claim rejections. It also emphasized that personal hardships, while regrettable, cannot override mandatory statutory obligations.</p>\n\n<p>Citing Supreme Court precedents (RPS Infrastructure v. Mukul Kumar), the NCLT concluded that allowing such extremely delayed claims would derail the time-bound nature of the CIRP and erode commercial certainty. This ruling underscores that timeliness is a substantive cornerstone of the insolvency framework, preventing tactical disruptions and strengthening the integrity of the resolution process.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/cirp-cant-be-reopened-after-coc-plan-approval-nclt.jpg"
  },
  {
    "title": "India’s Four Labour Codes: A Transformational Reform for the Nation’s Workforce",
    "description": "<p>On November 21, 2025, the Government of India implemented four consolidated Labour Codes (on Wages, Industrial Relations, Social Security, and Occupational Safety, Health and Working Conditions), replacing 29 fragmented colonial-era laws. This historic reform modernizes India's labour ecosystem, aligns it with global standards, and aims to ensure social justice and protection for all workers.</p>\n\n<p>The previous labour framework was outdated, complex, and struggled to accommodate new employment forms like gig and platform work. It created significant compliance burdens for employers and left vast sections of the workforce, including informal, gig, platform, and contract workers, without uniform protections like minimum wages, social security, or formal appointment letters.</p>\n\n<p>The new codes introduce several core reforms: mandatory appointment letters for all workers, universal social security coverage (PF, ESIC) extending to gig and platform workers with portable Aadhaar-linked Universal Account Numbers, and a statutory National Floor Wage ensuring minimum pay. They mandate timely wage payments, provide free annual health check-ups for workers over 40, and permit women to work night shifts and in all occupations with consent and safety measures. Compliance is significantly simplified with a single registration, pan-India license, and single return system, while dispute resolution mechanisms are streamlined.</p>\n\n<p>These reforms offer substantial benefits across diverse categories: fixed-term employees now receive equal benefits and gratuity after one year; gig workers gain social security via aggregator contributions; and contract workers receive enhanced protections. The codes explicitly prohibit gender discrimination, ensure equal pay, and strengthen protections for youth, MSME workers, and those in hazardous industries. This comprehensive, pro-worker, pro-women, pro-youth, and pro-employment framework balances worker dignity and expanded social security with a more conducive environment for business growth and employment generation, supporting India's vision of Aatmanirbhar Bharat.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/indias-labour-codes-a-new-era-for-workforce-reforms.jpg"
  },
  {
    "title": "The Scent Of Innovation: Reinventing Tyres For A Refreshing Driving Experience",
    "description": "<p>India's Trade Marks Registry has made a historic move by accepting Sumitomo Rubber Industries' application for an olfactory trademark—a floral rose fragrance for tyres. This landmark decision expands Indian intellectual property law to include sensory branding, moving beyond conventional visual marks.</p>\n\n<p>The journey to registration was marked by procedural controversy, with the Registry initially citing distinctiveness concerns, then abruptly shifting to claims of technological limitations in examining smell marks. Sumitomo, however, asserted that the Trade Marks Act mandates examination based on graphical representation and distinctiveness, not administrative system constraints.</p>\n\n<p>The applicant successfully demonstrated both inherent distinctiveness, due to the arbitrary nature of a rose scent on tyres, and acquired distinctiveness from decades of continuous use since 1995. They argued the mark is easily recognizable by the \"man of average intelligence and imperfect recollection.\" A significant hurdle, graphical representation, was overcome with a groundbreaking 7-dimensional vector model, developed with experts from IIIT Allahabad, meeting the clear, precise, and objective standards set by international precedents like Siekmann.</p>\n\n<p>Shri Pravin Anand, acting as amicus curiae, provided impartial expertise, emphasizing the mark's distinctiveness and the acceptability of such non-functional scent marks in other jurisdictions. The Registry's final reasoning adopted a flexible interpretation of graphical representation, accepting the scientific model, and recognizing the arbitrary nature and inherent distinctiveness of the rose scent. This progressive stance, influenced by global practices, ensures non-traditional marks are not excluded solely due to representational challenges if statutory criteria are met.</p>\n\n<p>This pioneering case, a testament to collaborative excellence spanning law and science, broadens intellectual property protections in India. It positions the nation among global leaders in recognizing smell as a powerful and unique brand identifier, paving the way for a new sensory dimension within trademark law.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/india-accepts-rose-scented-tyre-mark-a-trademark-milestone.jpg"
  },
  {
    "title": "Unconditional Stay Only in Exceptional Cases: Supreme Court Clarifies Section 36(3)",
    "description": "<p>The Supreme Court of India, in Popular Caterers v. Ameet Mehta & Ors., clarified the principles governing the grant of stays on arbitral awards, particularly monetary ones, under Section 36(3) of the Arbitration and Conciliation Act, 1996. The Court set aside a Bombay High Court order that had granted an unconditional stay on the execution of a ₹4-crore arbitral award, deeming it an exceptional relief granted without justifying circumstances.</p>\n\n<p>The Bombay High Court had erroneously undertaken an extensive, premature merits review, finding the award's findings \"perverse\" at the interim stage. The Supreme Court emphasized that an unconditional stay is permissible only in truly exceptional situations, such as when an award is prima facie induced by fraud or corruption, or is patently illegal, non-existent, or wholly without jurisdiction. It noted that no such allegations were raised by the award debtors, and the High Court had failed to consider the protective purpose of Section 36(3) to secure the award holder.</p>\n\n<p>Consequently, the Supreme Court directed the award debtors to deposit the principal amount of ₹4 crore with the Bombay High Court within eight weeks, for investment in a fixed-deposit account. The stay on the award was made conditional upon this deposit. The Court also instructed the Bombay High Court to expedite the disposal of the pending Section 34 petitions within six months. This ruling reinforces India's pro-enforcement arbitration framework, restricts premature merits reviews at the interim stage, and prevents award debtors from frustrating enforcement through unwarranted unconditional stays, thereby safeguarding the interests of award holders.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/supreme-court-limits-unconditional-stays-on-arbitral-awards.jpg"
  },
  {
    "title": "Defining Financial Debt: NCLT Judgment Confirms IBC Cannot Be Invoked for Recovery of Profit-Linked Investments",
    "description": "<p>The National Company Law Tribunal (NCLT), New Delhi, dismissed a Section 7 application by Modern Solar Private Limited against Claro Energy Private Limited, ruling that the ₹20 lakh advanced was an investment in a profit-sharing venture, not a loan. This landmark judgment emphasizes that these funds lacked the essential \"time value of money\" component, crucial for qualifying as \"financial debt\" under Section 5(8) of the Insolvency & Bankruptcy Code (IBC). Consequently, the IBC cannot be invoked to recover profit-linked investments or to convert failed commercial arrangements into insolvency proceedings.</p>\n\n<p>The dispute stemmed from Modern Solar's advancement of funds for a project, which it later claimed was a loan, while Claro Energy asserted it was a profit-sharing investment. The NCLT's analysis of email correspondence confirmed the original intent was an investment, and subsequent loan restructuring discussions were inconclusive. The Tribunal found no contractual basis for an 18% interest rate, thus failing to establish the \"time value of money.\" It also relied on judicial precedents like Jagbasera Infratech Pvt. Ltd. v. Rawal Variety Construction Ltd., which similarly held that investments in joint ventures or profit-sharing projects do not constitute \"financial debt.\"</p>\n\n<p>The Tribunal's decision reinforces the strict definition of \"financial debt\" and safeguards the IBC's integrity. It ensures the Code serves its intended purpose as an insolvency resolution mechanism, rather than being misused as a general debt recovery platform for business investments that carry inherent commercial risks, preventing retrospective conversion of such risks into fictional loans to invoke insolvency proceedings.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/nclt-profit-linked-investments-not-financial-debt-under-ibc.jpg"
  },
  {
    "title": "Constitution Day 2025: Strengthening Democracy Through All Citizens, Especially Youth",
    "description": "<p>India commemorates Constitution Day on November 26, celebrating the adoption of its Constitution in 1949. This day underscores the nation's core principles: democracy, justice, liberty, equality, fraternity, dignity, and unity. It serves as a powerful reminder of the Constitution's paramount role in safeguarding democracy and fostering national unity and harmony.</p>\n\n<p>The Constitution's monumental creation was led by visionary Dr. B. R. Ambedkar, Chairman of the Drafting Committee, who ensured the embodiment of justice, liberty, equality, and fraternity, alongside protections against social discrimination like untouchability. Constitution Day honors these framers, presenting the document not just as a legal text but as a living guide upholding democratic governance and fundamental individual rights.</p>\n\n<p>The observance inspires citizens, especially youth, to engage actively with constitutional values through activities such as reading the Preamble, debates, and seminars. It highlights fundamental rights and duties, cultivating a strong commitment to the rule of law and social justice. Youth play a critical role in promoting cultural respect, community dialogues, and spreading awareness, thereby strengthening democracy and national unity.</p>\n\n<p>Facing challenges like social inequalities and communal tensions, Constitution Day acts as a vital call to action for all citizens. It particularly urges the youth to embrace their constitutional rights and duties, becoming guardians of democratic ideals. Their active participation is crucial to champion inclusivity, combat discrimination, and foster societal unity, ensuring the Constitution's vision endures and thrives for generations to come.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/constitution-day-2025-celebrating-indias-democratic-spirit.jpg"
  },
  {
    "title": "India’s New Space Age: How A ₹1,000-Crore VC Fund And Indian Space Laws Are Powering The Next Frontier Of Start-Ups",
    "description": "<p>India's space sector is undergoing a profound transformation, shifting from state-led exploration to a market-driven ecosystem empowered by private startups. This new era is fundamentally driven by the operationalization of a ₹1,000-crore Space Venture Capital Fund and a robust, evolving legal framework, aiming to establish India as a global hub for space innovation.</p>\n\n<p>The fund, a joint initiative by IN-SPACe and SIDBI Venture Capital Ltd., provides crucial risk capital, targeting approximately 40 high-potential startups over five years with investments ranging from ₹10-60 crore. This financial impetus complements a comprehensive regulatory environment. Key policy pillars include the Indian Space Policy 2023, which opens the entire space value chain to private participation and redefines roles for ISRO (R&D) and IN-SPACe as a single-window authority. The anticipated Space Activities Bill will further solidify this legal framework, addressing licensing, liability, and intellectual property. Recent reforms in 2024 also permit significant Foreign Direct Investment, up to 100% in certain sub-sectors, attracting global capital and collaboration.</p>\n\n<p>These strategic initiatives are designed to propel India's space economy from its current US $8.4 billion to a projected US $44 billion by 2033. This growth is expected to foster innovation across launch systems, satellite manufacturing, data applications for various sectors, and in-space services. While challenges like the pending Space Activities Bill and clearer liability frameworks remain, this powerful synergy of capital and policy marks a pivotal moment, transforming India into a \"space-startup superpower\" driven by \"Law-enabled Innovation.\"</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/indias-space-laws-and-vc-push-shaping-a-new-tech-frontier.jpg"
  },
  {
    "title": "Menstrual Leave Becomes a Legal Entitlement in Karnataka Workplaces: No Certificate, No Carry-Over",
    "description": "<p>On November 20, 2025, Karnataka's Labour Department issued Government Order No. LD 466 LET 2023, establishing menstrual leave as a binding statutory entitlement. This mandate grants women workers aged 18-52 one paid leave day per menstrual cycle, capped at twelve days annually. Significantly, it is self-certification based, eliminating the need for medical proof.</p>\n\n<p>The entitlement stemmed from extensive deliberations by a multi-stakeholder committee formed in January 2024, followed by public consultation that showed strong support. The order invokes five central and state labour statutes, ensuring pan-sectoral coverage for all registered establishments and women employees, including contractual and outsourced workers.</p>\n\n<p>Key features of the leave include its compensatory and wage-protected nature, with monetary liability resting solely on the employer. It cannot be offset against other leave types. A statutory cap of twelve days per calendar year applies, with unused leave lapsing monthly—it cannot be accumulated, encashed, or carried forward. Employees simply need to intimate their intention to avail the leave within the same month. The order took immediate effect on November 20, 2025, requiring establishments to update systems and face penalties for non-compliance. This marks a pivotal shift from discretionary welfare to a statutory right, emphasizing employee dignity and administrative simplicity.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/karnataka-notifies-statutory-paid-menstrual-leave-for-women.jpg"
  },
  {
    "title": "IBBI (Insolvency Resolution Process for Personal Guarantors to Corporate Debtors) (Amendment) Regulations, 2025 Makes Accuracy and Punctuality Non-Negotiable for Resolution Professionals",
    "description": "<p>The Insolvency and Bankruptcy Board of India (IBBI) introduced the (Amendment) Regulations, 2025, on November 20, 2025, to address chronic issues of late and inaccurate filings by Resolution Professionals (RPs) in the insolvency resolution process for personal guarantors. This crucial amendment, effective immediately, inserts a new Regulation 23 into the 2019 Regulations, fundamentally transforming best practices into statutory duties and aiming to enhance creditor confidence and accelerate judicial proceedings.</p>\n\n<p>Regulation 23 mandates strict procedural discipline. RPs are now legally obliged to file all prescribed Forms and their enclosures electronically on the IBBI's designated platform by specified deadlines, allowing no discretion. Furthermore, RPs must certify that all submitted information is true, complete, and not misleading, effectively ending any \"file-now-correct-later\" approach. Non-compliance triggers an automatic penalty of ₹500 per Form for each calendar month of delay, applicable to initial filings, corrections, or updates. Beyond monetary fines, the IBBI is empowered to refuse to issue or renew an RP's \"Authorisation for Assignment\" for failures related to filing, accuracy, or timeliness, posing a significant professional and existential threat. These reforms leverage a central digital platform and stringent penalties to ensure data integrity, compress timelines, and deliver faster outcomes for all stakeholders.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/ibbi-2025-tightens-filing-rules-for-personal-guarantor-cases.jpg"
  },
  {
    "title": "Seven Day Cure Command: Supreme Court Halts NCLT Rejection for Skipping Section 7(5)(b) Notice",
    "description": "<p>The Supreme Court, in Civil Appeal No. 11766 of 2025, has definitively ruled that before rejecting a financial creditor's Section 7 petition under the Insolvency and Bankruptcy Code, 2016, the adjudicating authority must first issue a specific seven-day healing notice to the applicant under the second proviso to Section 7(5)(b). Failure to provide this direct notice constitutes a jurisdictional error. This landmark judgment stemmed from a dispute involving HDFC Bank Limited and the corporate debtor, Live-in Aqua Solutions Private Limited.</p>\n\n<p>The case highlighted a procedural lapse where HDFC Bank's petition contained defects, including an affidavit predating the verification date. The NCLT Registry refused registration after publishing a consolidated defect sheet, but no separate, specific seven-day notice under the Code's proviso was served directly to the bank. While the NCLAT later acknowledged the procedural error, the Supreme Court emphasized the mandatory nature of this notice, stating that a mere consolidated listing of defects is insufficient.</p>\n\n<p>The Supreme Court clarified that a defective affidavit is a curable irregularity, not a fatal flaw that renders the application non est. It reiterated that procedure should aid justice, not obstruct it. Although the NCLAT correctly identified the procedural lapse, the Supreme Court chided it for not directing the bank to file a fresh, compliant affidavit. Consequently, the Court mandated HDFC Bank to cure all defects, including filing a new affidavit, within seven days from the judgment date. Following this, the NCLT will proceed to decide the petition on its merits.</p>\n\n<p>This ruling underscores the imperative for tribunals to uphold procedural safeguards, branding the absence of the specific seven-day notice a jurisdictional flaw. It ensures that financial creditors are afforded a clear opportunity to rectify defects, reinforcing the principle of \"cure first, reject later\" within the IBC framework.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/supreme-court-restores-section-7-plea-over-missed-notice.jpg"
  },
  {
    "title": "IBBI (Insolvency Professionals) (Second Amendment) Regulations, 2025: An analysis",
    "description": "<p>The Insolvency and Bankruptcy Board of India (IBBI) promulgated the Insolvency and Bankruptcy Board of India (Insolvency Professionals) (Second Amendment) Regulations, 2025, effective November 21, 2025. Issued under the Insolvency and Bankruptcy Code, 2016, these regulations introduce critical amendments to the existing framework governing Insolvency Professionals (IPs), aiming to enhance efficiency and accountability within the insolvency resolution process.</p>\n\n<p>A significant change is the insertion of Regulation 7B, establishing a quantitative ceiling on assignments. Individual IPs (not insolvency professional entities) are now restricted to a maximum of ten concurrent assignments, covering roles such as Interim Resolution Professional, Resolution Professional, and Liquidator. Within this limit, no more than three assignments can pertain to processes with admitted claims exceeding INR 1000 crore each. IPs exceeding these thresholds upon commencement are prohibited from accepting new assignments until their active portfolio falls below the prescribed limits.</p>\n\n<p>Furthermore, amendments to the Code of Conduct (First Schedule) include replacing \"the approval of the Board\" with \"the prior approval of the Adjudicating Authority\" in Clause 6, thereby transferring sanctioning power from the IBBI to the National Company Law Tribunal. Clause 22 has also been omitted. These amendments signify a shift from self-declared workload management to a hard statutory ceiling, designed to mitigate timeline slippages and enhance fiduciary oversight. Stakeholders are advised to audit existing mandates and integrate these revised thresholds into their operational frameworks to ensure regulatory compliance.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/ibbi-2025-insolvency-professionals-assignment-cap-explained.jpg"
  },
  {
    "title": "SWIFT 2.0 Goes Live: FSSAI–CBIC Integration Reshapes Legal Architecture of Food-Import Clearance",
    "description": "<p>The Food Safety and Standards Authority of India (FSSAI) and the Central Board of Indirect Taxes and Customs (CBIC) have jointly announced the pilot launch of SWIFT 2.0, an upgraded interface designed to integrate food-safety oversight with customs control. This new system embeds FSSAI’s Food Import Clearance System (FICS) directly into CBIC’s ICEGATE portal, replacing SWIFT 1.0 with a real-time, two-way data conduit. The initiative aims to compress regulatory clearance times, eliminate duplicative filings, and reinforce the Government's commitments to \"Ease of Doing Business\" and \"Digital India.\"</p>\n\n<p>The primary objective is to streamline food import processes by providing a single-window design where importers can obtain the FSSAI No-Objection Certificate directly through the SWIFT portal. This eliminates the need for parallel applications, thereby reducing human interface, shortening cargo dwell time, and lowering the cost of doing business, all while maintaining transparency and accountability within the system.</p>\n\n<p>The pilot phase is strategically confined to four high-volume inland container depots—Dadri, Star Track, Albatross, and Patparganj—selected based on cargo density, existing digital infrastructure, and the presence of accredited laboratories. This approach ensures early identification of systemic bottlenecks without disrupting the wider import ecosystem. Upon successful validation, SWIFT 2.0 will be rolled out nationally to all major food-import entry points, underscoring India’s commitment to efficient, transparent, and technology-driven food-import processes and a strengthened food-safety ecosystem.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/swift-2-0-integrates-fssai-and-cbic-for-faster-food-imports.jpg"
  },
  {
    "title": "Streamlining Insolvency Appointments: IBBI’s Second (2025) Guidelines for Professionals",
    "description": "<p>The Insolvency and Bankruptcy Board of India (IBBI) released its Second Guidelines (2025) to streamline the appointment of Insolvency Professionals (IPs) as Interim Resolution Professionals, Liquidators, Resolution Professionals, and Bankruptcy Trustees. Effective for a six-month cycle from January 1 to June 30, 2026, these guidelines aim to eliminate administrative delays by pre-assembling zonewise and benchwise panels, operationalizing specific sections of the IBC 2016.</p>\n\n<p>Eligibility for the panel requires no pending disciplinary proceedings or recent convictions, an unconditional expression of interest (Form A submitted by December 22, 2025), and an Authorisation for Assignment (AFA) valid until June 30, 2026. IPs must consent to serve any assigned role or debtor and declare their sector experience. The common panel for all four roles, compiled by December 31, 2025, is disaggregated zonewise/benchwise, sorted by ongoing assignments and registration chronology. Insolvency Professional Entities are exempt from zone restrictions, eligible for pan-India appointments.</p>\n\n<p>Crucially, consent to be on the panel is irrevocable, signifying an undertaking to accept appointments. Unjustified refusal leads to immediate panel removal and a six-month debarment. Professionals must also maintain their registration and AFA during the panel's validity. While the Adjudicating Authority retains flexibility to appoint outside the panel if warranted, these guidelines enhance transparency and accountability. They replace the May 2025 framework, ensuring faster and more predictable insolvency appointments from January 2026, with clear obligations for professionals.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/ibbi-issues-new-2025-guidelines-for-faster-ip-appointments.jpg"
  },
  {
    "title": "The Right To A Livable Planet: The Intersection Of Vegan Rights, Human Dignity, And Environmental Justice",
    "description": "<p>Veganism is increasingly recognized as a fundamental human and consumer right, encompassing ethical, religious, and health-based dietary choices, protected under constitutional freedoms. This was powerfully affirmed in a 2025 Bengaluru consumer protection case where Rs. 1,05,146 (plus interest) was awarded to Nisha G., a vegan woman who received prawns in her \"vegan\" sandwich order via Swiggy from Paris Panini. The incident caused profound emotional distress and spiritual trauma, underscoring the serious implications of violating faith-based dietary restrictions. The Bengaluru Urban District Consumer Disputes Redressal Commission found both Swiggy and Paris Panini jointly liable for negligence.</p>\n\n<p>Beyond individual convictions, veganism plays a critical role in combating climate change and promoting global sustainability. Extensive research indicates that plant-based diets significantly reduce greenhouse gas emissions, land use, water consumption, and pollution compared to omnivorous diets. Thus, safeguarding vegan dietary rights aligns ethical consumption with vital planetary health goals, highlighting a crucial intersection of justice, health, and environmental welfare.</p>\n\n<p>This legal recognition of veganism not only protects consumer dignity and prevents discrimination but also holds businesses accountable for accurate food representation and empowers individuals to make climate-conscious choices. The ruling sends a clear message about upholding faith, ethical rights, and environmental commitments, emphasizing that evolving legal frameworks must support choices that safeguard both the planet and personal conviction for a sustainable and compassionate future.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/vegan-rights-ahimsa-and-climate-justice-in-indias-legal-sphere.jpg"
  },
  {
    "title": "IBBI Discussion Paper, 14 November 2025: Proposed Re-calibration of Valuation Architecture under the Insolvency and Bankruptcy Code, 2016",
    "description": "<p>The Insolvency and Bankruptcy Board of India (IBBI) has released a discussion paper addressing systemic issues in the valuation process, including non-uniform reports, divergent standards, an asset-centric definition of fair value, disproportionate costs for small debtors, and the absence of an integrated enterprise-level figure. These issues lead to litigation and reduced stakeholder confidence. The paper proposes five key amendments to subordinate legislation to enhance transparency, consistency, and predictability in fair and liquidation value determinations.</p>\n\n<p>Firstly, to improve consistency and auditability, the Board recommends an omnibus enabling clause to prescribe standardized report templates and obligatory documentation protocols via circulars for all insolvency proceedings. These templates will be modular, allowing for asset-class specific schedules while maintaining a common master format.</p>\n\n<p>Secondly, the paper proposes unifying valuation standards. It suggests replacing current references to \"internationally accepted valuation standards\" or the Companies (Registered Valuers and Valuation) Rules, 2017, with \"valuation standards as specified by the Board,\" thus granting the IBBI authority to promulgate a single, consistent standard.</p>\n\n<p>Thirdly, the definition of \"fair value\" is set to undergo a significant conceptual change. The revised definition will require valuers to estimate the corporate debtor's realizable value as an economic unit, incorporating tangible and intangible assets (e.g., brand, goodwill) and the synergistic premium of a going-concern transaction, rather than merely discrete assets.</p>\n\n<p>Fourthly, to mitigate the burden on small estates, the paper suggests a calibrated derogation allowing for the appointment of a single registered valuer per asset class for corporate debtors with an annual turnover not exceeding ₹500 crore or those qualifying as MSMEs. The Committee of Creditors retains discretion to mandate a second set with stated reasons.</p>\n\n<p>Finally, to synthesize individual asset-class estimates into a comprehensive enterprise-level figure, the paper introduces a \"Coordinator Valuer.\" This individual will integrate underlying valuations to furnish an Aggregate Fair Value (AFV) for the corporate debtor, with a mechanism for averaging AFVs and addressing significant deviations. An equivalent system is proposed for liquidation value.</p>\n\n<p>Stakeholder comments are invited on these proposals by December 7, 2025. If implemented, these amendments are expected to establish a rule-based, verifiable, enterprise-centric valuation architecture, thereby minimizing informational friction, curtailing litigation risk, and advancing the Code's objective of value maximization.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/ibbi-proposes-major-overhaul-of-ibc-valuation-framework.jpg"
  },
  {
    "title": "Regulating The Machine Mind: AI, Privacy, And Intellectual Property Under India’s 2025 AI Governance Guidelines",
    "description": "<p>India's Ministry of Electronics & Information Technology (MeitY) released its AI Governance Guidelines in November 2025, establishing the nation's first comprehensive, yet currently voluntary, framework for responsible AI. These guidelines aim to balance promoting innovation with safeguarding fundamental rights, guided by the philosophy of \"innovation over restraint.\" They introduce \"Seven Sutras\" for ethical AI, mirroring global standards while addressing India's unique socio-economic context.</p>\n\n<p>A core focus is data privacy, explicitly tethering AI governance to the Digital Personal Data Protection Act (DPDP) 2023. This mandates privacy-by-design, explicit consent for personal data use, purpose limitation, and transparency about AI interaction. Data principals' rights (access, correction, erasure) must be honored, requiring robust data governance and provenance tracking from AI actors.</p>\n\n<p>For intellectual property, the Guidelines acknowledge the ambiguity of AI-generated works under existing copyright law, which presupposes human authorship. They signal a review of the Copyright Act, 1957, potentially introducing \"related rights\" and clarifying fair dealing exceptions for text and data mining (TDM) for AI training. A licensing framework and dataset provenance documentation are encouraged to mitigate legal risks for developers and protect creators.</p>\n\n<p>The framework also addresses liability and accountability, proposing clear definitions for AI actors (developers, deployers, users) and shared responsibility, with future amendments to the IT Act, 2000, anticipated. To combat deepfakes and harmful AI-generated content, the Guidelines emphasize content authentication through digital watermarks and unique identifiers, advocating for multi-stakeholder collaboration on global standards. India's approach takes a middle path between the EU's stringent regulation and the US's innovation-driven model, aiming for a pragmatic balance as these voluntary guidelines are poised to transition into binding legislation. Businesses are urged to prioritize lawful data collection, secure IP clearances, and operationalize ethical AI principles.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/ai-privacy-and-copyright-under-indias-2025-governance-guidelines.jpg"
  },
  {
    "title": "Enforcing A 92-Year-Old Decree: The Supreme Court On Faith, Proof, And Possession",
    "description": "<p>In 2025, the Supreme Court of India resolved a 92-year-old temple dispute concerning Sangalappa Swamy, stemming from a 1933 compromise decree. The case involved the Kapadam and Kamatam families, both from the Kuruba community, who disputed hereditary rights to worship the deity and possess sacred items. The original decree mandated alternating idol possession, rotating ritual duties, a ₹2,000 payment from the Kamatams, and the appointment of trustees.</p>\n\n<p>Decades later, the Kapadam families initiated an execution petition, accusing the Kamatams of breaching the rotation agreement and unlawfully retaining the idols. The Kamatams argued that the 1933 decree's key conditions, including the payment and trustee appointments, were never implemented, and thus, the arrangement itself was never put into practice.</p>\n\n<p>The Supreme Court upheld the Andhra Pradesh High Court's decision, asserting that while the 1933 compromise decree was valid, its enforcement required concrete proof of violation. The Kapadams failed to provide evidence that the initial payment was made, trustees were appointed, or that the idols had ever rotated between the villages as per the decree. The Court emphasized that sentiment alone cannot enforce a decree; legal execution demands clear evidence of breach, with the burden of proof resting on the party seeking enforcement.</p>\n\n<p>This judgment highlights that religious and customary rights, though respected, must adhere to the same evidentiary standards as other legal claims. It underscores the critical importance for communities and trustees to maintain proper records and ensure transparency. The ruling serves as a vital lesson that justice, even in matters of profound devotion, fundamentally demands proof, ensuring that faith and law can coexist harmoniously through documented evidence.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/supreme-court-ends-92-year-old-temple-decree-dispute.jpg"
  },
  {
    "title": "Ctrl+Alt+Regulate: AI’s Takeover Of Media And Its Legal Crossroads",
    "description": "<p>Artificial Intelligence is profoundly transforming the media industry globally, enhancing content creation, personalization, and moderation. While AI-generated scripts, synthetic voices, and hyper-personalized recommendations augment or replace human creativity, this rapid evolution introduces significant legal, ethical, and societal concerns. Urgent regulatory frameworks are needed to address issues of legality, fair use, and accountability.</p>\n\n<p>India's legal system is actively grappling with these challenges, particularly concerning freedom of expression versus content moderation. AI-enabled content, including deepfakes and algorithmic filtering, complicates constitutional rights, necessitating adaptations to laws like the IT Act 2000 and its evolving rules (IT Rules 2021 and subsequent amendments). Indian courts are balancing free speech with legitimate state interests, pushing back against overbroad government controls while also addressing AI misuse of individual likeness and persona rights.</p>\n\n<p>Deepfakes, which are realistic AI-generated or altered content often created without consent, pose a severe threat to truth, trust, and privacy. Indian courts are increasingly protecting celebrities' personality rights (name, voice, image) against unauthorized AI misuse, issuing orders for immediate content removal. Despite potential challenges in international enforcement, domestic legal actions are crucial for setting precedents, deterring local misuse, and influencing future legislation, underscoring the need for agile legal frameworks to combat synthetic media and algorithmic bias.</p>\n\n<p>Furthermore, the complexities of \"untraceable\" URLs present both privacy benefits and accountability challenges. India is proactively developing AI-based detection systems, such as \"Cyber Swachhta Kendra,\" and crafting technology-neutral principles to strengthen its cybersecurity infrastructure. The upcoming Digital India Act aims to modernize digital governance by balancing security, accountability, and fundamental rights, positioning India as a global model for secure, rights-based digital governance.</p>\n\n<p>Ultimately, India must foster thoughtful regulation, robust enforcement, and industry self-regulation to responsibly harness AI's potential in media. This includes evolving laws to protect individual rights, ensure transparency, and uphold public trust in digital content, without compromising ethical or legal standards.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/ai-and-the-media-legal-challenges-on-the-new-frontier.jpg"
  },
  {
    "title": "Supreme Court Upholds Advocate-Client Privilege: A Barrier Against Investigative Overreach",
    "description": "<p>The Supreme Court of India has delivered a landmark judgment reaffirming the sacred nature of the advocate-client relationship and significantly curbing investigative agencies' authority to summon lawyers for questioning. In Summoning Advocates Who Give Legal Opinion or Represent Parties During Investigation of Case, the Court ruled that merely summoning advocates for representing or advising clients during an investigation undermines professional privilege and violates fundamental constitutional rights. This decision addresses concerns over a growing trend of investigative overreach, ensuring lawyers can act without fear of coercion and safeguarding a client's right to a fair defense.</p>\n\n<p>The case originated when an Ahmedabad advocate, representing an accused, received a police summons to \"reveal true details of the facts and circumstances.\" The Gujarat High Court dismissed his challenge, but the Supreme Court took suo motu cognizance, recognizing the broader constitutional implications for professional independence and client confidentiality. The Bar, through various associations, argued that Section 132 of the Bhartiya Sakshya Adhiniyam (BSA) 2023 (previously Section 126 of the Indian Evidence Act) guarantees absolute confidentiality, breach of which infringes Articles 19(1)(g) and 21. The State agreed on the inviolability of privilege but contended that existing statutes were sufficient, clarifying that lawyers are not immune if involved in illegal acts.</p>\n\n<p>The Court's reasoning emphasized that lawyers are not mere agents but public officers vital for justice. It held that confidential communications between a lawyer and client for legal advice are protected under Section 132 of the BSA, extending beyond litigation and remaining protected even after the professional relationship ends. Compelling disclosure would violate a client's right against self-incrimination (Article 20(3)). While acknowledging statutory exceptions for communications made in furtherance of an illegal purpose or concerning future crimes/frauds, the Court deemed the summons in this case illegal. To prevent misuse, the Court mandated that any summons to a practicing advocate must first receive written approval from a superior officer, not below the rank of Superintendent of Police, with reasons recorded and specific reference to a Section 132 exception. Such summons remain challengeable, ensuring judicial oversight. The Court also differentiated between practicing advocates and in-house counsel, stating full-time employees cannot claim privilege under Section 132.</p>\n\n<p>This judgment stands as a monumental affirmation of the advocate's role as a protector of justice and a citizen's shield against arbitrary power. By clarifying the limits of investigative authority and introducing administrative safeguards, the Supreme Court has rebalanced state power with professional independence and fundamental rights. It reinforces that the Bar, as a public institution, is indispensable to upholding the rule of law, and investigative agencies must not use summons as instruments of intimidation against lawyers, ensuring the foundational trust within the adversarial system remains intact.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/supreme-court-protects-advocate-client-privilege.jpg"
  },
  {
    "title": "Detailed Analysis of the Digital Personal Data Protection Rules, 2025 (hereafter “Rules 2025”), which are the subordinate rules under the Digital Personal Data Protection Act, 2023 (“DPDP Act”) in India",
    "description": "<p>The Digital Personal Data Protection Rules, 2025 (Rules 2025) mark a crucial progression in India’s data protection framework, acting as subordinate legislation to the Digital Personal Data Protection Act, 2023 (DPDP Act). These rules are designed to operationalize the DPDP Act, integrating international good practices related to consent, breach notification, data minimization, and data erasure. The analysis evaluates these rules, considering their purpose, merits, concerns, implications of key provisions, and their practical impact across various stakeholder segments.</p>\n\n<p>The article also includes a comparative analysis of the Digital Personal Data Protection Rules, 2025 with the EU General Data Protection Regulation (GDPR), illustrating India's approach in the global data protection landscape.</p>\n\n<p>In conclusion, while the Rules 2025 aspire to elevate India's data protection regime to international standards, their success is largely contingent on several critical elements. These include the clarity of definitions, the establishment of realistic operational timelines, the strength and effectiveness of oversight institutions, and the judicious balancing of business practicality with individual rights protection. Proper implementation holds the potential to significantly enhance data protection in India's digital economy; conversely, inadequate execution risks leading to regulatory burdens, ambiguity, and a decline in trust.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/dpdp-rules-2025-explained-compliance-duties-and-key-risks.jpg"
  },
  {
    "title": "SC Reaffirms That Counterclaims Are Maintainable Only Against Plaintiffs, Not Co-Defendants",
    "description": "<p>In a significant ruling, the Supreme Court of India in Sanjay Tiwari v. Yugal Kishore Prasad Sao & Ors. clarified that a counterclaim, as per Order VIII Rule 6A of the Code of Civil Procedure, 1908, can only be maintained against the plaintiff and not against a co-defendant. This decision reinforces procedural discipline and prevents the misuse of counterclaims to resolve disputes between co-defendants.</p>\n\n<p>The case originated from a suit for specific performance filed by Sanjay Tiwari (the plaintiff) against the first defendant concerning an alleged oral agreement for land sale. Following the first defendant's contention of non-joinder, defendants 2 and 3 were impleaded. Subsequently, defendants 2 and 3 filed a counterclaim against the first defendant, seeking conveyance of a portion of the same land based on their own alleged agreement. Both the Trial Court and the High Court allowed this counterclaim, reasoning that it would avoid multiplicity of proceedings. The plaintiff then appealed to the Supreme Court, arguing that a counterclaim cannot be raised against a co-defendant.</p>\n\n<p>The Supreme Court bench meticulously examined Order VIII Rule 6A CPC, emphasizing that a counterclaim is a defensive plea intended to be asserted by a defendant against the plaintiff to avoid multiple proceedings between these two parties. The Court highlighted that the provision does not envisage disputes between co-defendants. Citing previous judgments like Rohit Singh v. State of Bihar and J. Charitable Trust v. V.M.R. Janardana Iyengar, the Court affirmed that the scope of a counterclaim is strictly limited to claims against the plaintiff.</p>\n\n<p>Furthermore, the Supreme Court found the counterclaim by defendants 2 and 3 to be without substantive merit, noting inconsistencies in their claims, a lack of readiness and willingness to perform their part of the contract, and crucially, that the claim itself was time-barred, having been filed in 2006 for a cause of action that arose in 2002. The Court explicitly rejected the High Court's rationale that procedural efficiency could override statutory provisions governing counterclaims. Consequently, the Supreme Court allowed the appeal, setting aside the counterclaim of defendants 2 and 3 and remanding the original suit for specific performance to the Trial Court, with all other issues remaining open.</p>\n\n<p>This judgment serves as a vital precedent, underscoring that counterclaims must adhere strictly to the statutory framework and cannot be employed to resolve collateral disputes among co-defendants within the plaintiff's suit. It ensures that the judicial process maintains focus on the original cause of action and prevents the expansion of a suit's scope beyond its intended purpose.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/sc-clarifies-counterclaims-apply-only-against-plaintiffs.jpg"
  },
  {
    "title": "Applying Sub-Limit to Wrong Procedure Amounts to Deficiency in Service, Rules Ernakulam Consumer Commission",
    "description": "<p>The District Consumer Disputes Redressal Commission, Ernakulam, has ruled against Future Generali India Insurance Company Ltd. and its affiliate, finding them guilty of deficiency in service and unfair trade practice. This judgment stems from the insurer's wrongful curtailment of a medical insurance claim by misapplying a policy sub-limit intended for urinary stone removal to a distinct surgical procedure for urethral stricture, causing financial and emotional distress to the complainant.</p>\n\n<p>The complainant, Lype P. Joseph, underwent Visual Internal Urethrotomy (VIU) for bulbar urethral stricture at Apollo Adlux Hospital, incurring expenses of ₹71,553/-. Despite this, the insurer approved only ₹35,000, citing a special condition (h) related to \"Urinary Stone (including DJ stent removal for the same stone).\" Joseph disputed this, providing medical documentation confirming VIU as a stricture-relieving procedure, not stone removal, but his appeals to the insurer were unsuccessful, leading him to file a complaint.</p>\n\n<p>Future Generali defended its decision, arguing that the treatment was related to urinary stone disease, referencing the complainant's history and an email description. However, the Commission found that the insurer had wrongly invoked the sub-limit. It referenced the discharge summary and doctor's certificate, which unequivocally stated that VIU treats urethral stricture. Applying the principle of contra proferentem, which dictates that ambiguities in policy clauses must favor the insured, and citing the Kerala High Court's stance on unjustified claim denials violating the right to life, the Commission concluded that the insurer's actions were arbitrary, medically unfounded, and constituted a deficiency in service and unfair trade practice.</p>\n\n<p>Consequently, the Commission directed the insurer to pay the remaining claim amount of ₹36,553 with 9% interest from the complaint date, along with ₹10,000 as compensation for mental agony and suffering, and an additional ₹10,000 for litigation costs. This landmark ruling underscores that insurance policies are intended as a safety net, not a barrier, emphasizing the insurer's ethical and legal obligation for transparent, medically sound, and good-faith claim assessments, thereby reinforcing consumer rights and fostering accountability within the insurance sector.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/ernakulam-commission-fines-insurer-for-wrong-sub-limit-use.jpg"
  },
  {
    "title": "Supreme Court: Decree Passed in Favour of Deceased Parties is a Nullity, Trial Court Decree Revived for Execution",
    "description": "<p>The Supreme Court of India has unequivocally ruled that a judicial decree passed in favor of deceased parties, without the mandatory substitution of their legal heirs, is a nullity in law. In the case of Vikram Bhalchandra Ghongade v. State of Maharashtra & Ors., the Court reinstated a trial court decree, asserting that such a defective appellate decree, rendered in violation of Order XXII of the Code of Civil Procedure, 1908 (CPC), is devoid of legal effect and cannot supersede a valid prior judgment. This significant decision underscores the critical importance of procedural compliance in maintaining the legitimacy of judicial outcomes.</p>\n\n<p>The dispute originated from a two-decade-old land allotment matter, where legal heirs of an ex-serviceman, Mr. Arjunrao Thakre, secured a trial court decree in 2006, challenging an illegal re-allotment of his land. During the subsequent first appeal filed by the opposing parties, two appellants died before the appeal was heard, and their legal heirs were never brought on record. Despite this procedural lapse, the First Appellate Court proceeded to modify the trial court decree. This led to a complex legal trajectory, with the Executing Court and Bombay High Court initially upholding the appellate decree, leading to the appeal before the Supreme Court.</p>\n\n<p>The Supreme Court, setting aside the lower court orders, definitively held that the first appellate decree was a nullity. Its rationale was based on the fact that the decree was rendered in an appeal where both appellants had passed away prior to the hearing, and their legal heirs were not substituted as mandated by Order XXII CPC. The Court clarified that Order XXII Rule 6 CPC, which allows proceedings to continue if a party dies after arguments conclude but before judgment, was inapplicable as the deaths occurred before the hearing commenced. Consequently, the void appellate decree could not modify or supersede the valid trial court decree, which was thus revived for execution.</p>\n\n<p>This landmark ruling in Vikram Bhalchandra Ghongade v. State of Maharashtra & Ors. serves as a robust reaffirmation of the indispensable nature of procedural compliance in judicial proceedings. The Court explicitly affirmed that a decree passed in favor of deceased litigants without heir substitution constitutes a jurisdictional defect, rendering the decree void ab initio and subject to challenge at any stage, even during execution. The decision clarifies the limited scope of Order XXII Rule 6 CPC and reinforces the fundamental principle that judicial outcomes must rest on procedural fairness and due process, affirming that the law does not recognize decrees pronounced in favor of the dead.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/sc-decree-for-deceased-parties-void-trial-decree-revived.jpg"
  },
  {
    "title": "Madras HC Rules Technical Lapses Cannot Vitiate SARFAESI Auction Sale: A Guide to Rule 9 Validity",
    "description": "<p>The Madras High Court, in the case of M/s Lucky Footwear Components & Ors. v. Indian Bank & Ors., has affirmed that minor technical irregularities in the Securitisation and Reconstruction of Financial Assets and Enforcement of Security Interest Act, 2002 (SARFAESI Act) auction process cannot invalidate a sale. The Division Bench emphasized that judicial interference under Article 227 of the Constitution is limited and requires borrowers to demonstrate substantial prejudice, fraud, or collusion to challenge a concluded auction successfully.</p>\n\n<p>The case involved M/s Lucky Footwear Components, which defaulted on financial facilities from Indian Bank, leading to SARFAESI recovery proceedings and a subsequent public auction. The borrowers challenged the auction through the Debts Recovery Tribunal (DRT), Debt Recovery Appellate Tribunal (DRAT), and finally the High Court under Article 227. The High Court meticulously examined and rejected the borrowers' contentions, including claims of inadequate sale notice period (confirming \"not less than fifteen days\" was met without requiring \"clear days\"), insufficient property description, and outdated valuation. The Court noted that valuation by an approved valuer was sufficient and that minor deviations from internal policies or directory guidelines would not invalidate an auction without proven material prejudice or undervaluation. Furthermore, the borrowers' earlier communication was deemed a request for extension, not a formal objection under Section 13(3A), and new issues like loan classification were not entertained as they were not raised previously.</p>\n\n<p>Ultimately, the Division Bench dismissed the Civil Revision Petition, upholding the validity of the auction and affirming the decisions of the lower tribunals. Relying on Supreme Court precedent, the Court reiterated that concluded auction sales are not to be interfered with lightly unless tainted by fraud, collusion, or gross underpricing. The judgment underscores that Article 227 jurisdiction is supervisory, not appellate, and does not permit reappreciation of factual findings unless they are perverse or contrary to law.</p>\n\n<p>This decision reinforces the finality and integrity of SARFAESI auctions, signaling to borrowers that challenges must be based on concrete evidence of fundamental illegality, fraud, or substantial prejudice rather than minor procedural deviations. For banks, the ruling provides assurance that compliance with statutory requirements and engagement of approved valuers will protect their recovery actions from undue judicial interference.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/madras-hc-upholds-sarfaesi-auction-despite-technical-lapses.jpg"
  },
  {
    "title": "IBBI Tightens Transparency Norms: New Disclosure Templates for Resolution Applicants to Safeguard Section 32A Immunity",
    "description": "<p>The Insolvency and Bankruptcy Board of India (IBBI) has introduced a significant measure to enhance transparency and integrity in corporate insolvency resolution processes. Through a Discussion Paper released on 6 November 2025, the IBBI proposes mandatory disclosure templates for beneficial ownership and Section 32A eligibility for all Prospective Resolution Applicants (PRAs). This initiative aims to prevent the misuse of the \"clean slate\" immunity under Section 32A, which shields corporate debtors from prosecution for pre-insolvency offenses, by ensuring ineligible individuals with questionable backgrounds cannot acquire companies through opaque structures.</p>\n\n<p>This move stems from stakeholder feedback regarding the practical application of the Insolvency and Bankruptcy Code, 2016, and builds on the IBBI's prior emphasis in August 2025 for enhanced Section 32A disclosures. The proposed framework mandates amendments to Regulation 38 of the CIRP Regulations, compelling PRAs to submit a detailed beneficial ownership statement and a sworn affidavit on Section 32A eligibility. Crucially, the initiative aligns with the Reserve Bank of India’s updated Master Direction on Know Your Customer (KYC) norms, defining a \"beneficial owner\" as any natural person holding more than 10% ownership or control in companies, LLPs, and trusts, or over 15% in unincorporated bodies.</p>\n\n<p>The new disclosure requirements are detailed in two annexures. Annexure A outlines the beneficial ownership template, starting with basic corporate details and offering a streamlined disclosure path for listed entities that provide public filing links. For unlisted PRAs, it demands exhaustive details of natural person beneficial owners, including their nationalities, jurisdictions, percentage of control, identity documents, and a tier-wise ownership structure chart. Part IV of Annexure A requires a solemn declaration affirming the statement's accuracy and that no disclosed person is disqualified under Section 29A. Annexure B is a formal affidavit, to be sworn by the PRA’s authorized signatory, requiring an unequivocal declaration of eligibility for Section 32A immunity, a factual statement on prior connections to the corporate debtor, and confirmation that incoming management also meets Section 32A(1) criteria.</p>\n\n<p>The IBBI has invited public comments on these proposals until 16 November 2025, from a broad spectrum of stakeholders. These new norms are expected to significantly empower creditor committees to penetrate complex ownership structures, deter tainted promoters or shell companies from re-acquiring distressed assets, and facilitate inter-regulatory data sharing. Ultimately, this framework is anticipated to enhance the quality of resolution plans, fostering greater confidence among lenders and investors in India's distressed asset market.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/ibbi-mandates-new-disclosure-templates-for-insolvency.jpg"
  },
  {
    "title": "Beyond Nomenclature: SC Reinforces Substance Over Form in Arbitration Agreement Interpretation",
    "description": "<p>The Supreme Court of India, in a significant judgment delivered on November 6, 2025, in the case of M/s Alchemist Hospitals vs. M/s ICT Health Technology Services India, has unequivocally reaffirmed that the mere use of the term \"arbitration\" does not automatically validate a dispute resolution clause if it lacks the essential attributes of finality, neutrality, and binding effect. This ruling underscores the judiciary's commitment to prioritizing the true intent and substance of an agreement over its superficial form, particularly concerning Section 7 of the Arbitration and Conciliation Act, 1996.</p>\n\n<p>The dispute arose from a failed software implementation agreement between Alchemist Hospitals and ICT Health Technology Services. When technical issues led to the project's rollback, Alchemist Hospitals invoked Clause 8.28, titled “Arbitration,” seeking the appointment of a sole arbitrator. This clause outlined a three-tiered dispute resolution mechanism: initial negotiation, followed by mediation by the respective Chairmen of both parties (curiously termed \"Arbitrators\"), and critically, an explicit provision allowing either party to seek remedies through courts of law if the dispute remained unresolved after fifteen days. Both the High Court of Punjab & Haryana and the Supreme Court ultimately deemed this clause invalid as an arbitration agreement.</p>\n\n<p>The High Court initially rejected the application for an arbitrator, observing that Clause 8.28's terminology was loosely employed, facilitating only internal negotiation and mediation, rather than a binding adjudicatory process. The designation of the parties' own Chairmen as \"arbitrators\" was found incompatible with the impartiality required by the A&C Act, and crucially, the provision allowing recourse to civil courts after fifteen days negated the fundamental requirement of finality for any arbitration agreement. The Supreme Court affirmed this stance, grounding its analysis in the seminal six-factor test from K.K. Modi v. K.N. Modi, which mandates a binding decision, impartial adjudication, and legal enforceability. The Court emphasized that the explicit option to approach civil courts demonstrated a clear lack of intent for a conclusive process, distinguishing this case from precedents where post-agreement conduct clarified genuine, albeit ambiguous, arbitration clauses. It stressed that such conduct cannot create an arbitration agreement where none existed ab initio.</p>\n\n<p>Concluding its comprehensive analysis, the Supreme Court dismissed the appeal, holding that Clause 8.28 failed to meet the statutory prerequisites of Section 7 of the A&C Act. The judgment clarified that the appellant remained free to pursue remedies before a competent civil court. This decision serves as a crucial reminder to drafters of the necessity for precision and clarity in arbitration clauses, cautioning against mere label-sticking. By insisting on the core attributes of finality, impartiality, and binding commitment, the Supreme Court has fortified the integrity of arbitration as a distinct and reliable dispute resolution mechanism, reinforcing that the path to arbitration must be unequivocally marked, not obscured by ambiguous processes leading back to litigation.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/sc-clarifies-substance-over-form-in-arbitration-clauses.jpg"
  }
]