[
  {
    "title": "From Shelf to Scooter: The Legal Mess Behind India’s 10-Minute Commerce Boom",
    "description": "<p>India's burgeoning quick commerce sector, characterized by companies promising deliveries in 10 minutes or less, faces substantial legal and regulatory hurdles. These challenges range from zoning violations due to strategically located \"dark stores\" in residential areas to food safety concerns and questions surrounding the rights and classifications of gig workers as \"independent contractors\". The article also considers the impacts on cost per order, profitability, and service fees on consumer interests.</p>\n\n<p>Regulatory compliance remains a major concern. Quick commerce platforms, often classified as IT companies, navigate grey areas to sidestep stringent retail regulations and labor laws which enable them to engage in predatory pricing practices. This has prompted investigations from the Competition Commission of India (CCI).</p>\n\n<p>The sector also grapples with economic sustainability. High operational costs and initially low average order values (AOV) present profitability challenges. While some platforms have managed to increase their AOV, this often involves offering higher-value product categories, each bringing its own regulatory and compliance complexities. Service fees and packaging costs further impact consumer interest and raise concerns from consumer protection agencies.</p>\n\n<p>Consumer protection is another critical area of focus. The Central Consumer Protection Authority (CCPA) scrutinizes delivery time claims and addresses issues like differential pricing based on device type. The CCPA is also cracking down on \"dark patterns\" through self-audits required of e-commerce platforms, designed to promote ethical and transparent user interfaces.</p>\n\n<p>Furthermore, the gig worker model employed by many quick commerce platforms has been under the scanner. Concerns arise regarding fair working conditions, lack of social security benefits, and pressures leading to unsafe practices. States like Rajasthan and Karnataka are introducing ordinances and acts to protect gig workers' rights and ensure welfare.</p>\n\n<p>Food safety is also a major area of regulatory focus. The Food Safety and Standards Authority of India (FSSAI) has issued comprehensive guidelines and licensing requirements for e-commerce food businesses, addressing concerns over hygiene and standards. Compliance is critical, with penalties for violations.</p>\n\n<p>Moreover, compliance with Legal Metrology (Packaged Commodity) Rules, 2011, is crucial to prevent misleading practices in quantity declaration and product labeling. Similarly, data privacy concerns arise from the vast amounts of consumer data collected by these platforms, with the Personal Data Protection Act, 2023, aiming to regulate data collection, usage, and storage.</p>\n\n<p>Foreign Direct Investment (FDI) in retail e-commerce in India is allowed up to 100% under the automatic route for marketplaces, while inventory-based e-commerce is not permitted, balancing the need for foreign capital with the protection of domestic businesses. Lastly, ensuring quality standards through hallmarking and adherence to BIS (Bureau of Indian Standards) is essential for products like jewelry and electronics to protect consumers from substandard goods.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/indias-10-minute-commerce-boom-its-legal-tangle.jpg"
  },
  {
    "title": "Consumer Rights Vs. Corporate Responsibility: A Legal Perspective",
    "description": "<p>The District Consumer Disputes Redressal Commission, Mumbai Suburban, recently addressed a consumer complaint, *Gargi Prakash Joshi & Another v. Wow Momos Foods Pvt. Ltd.*, concerning alleged deficiency in service under Section 35(1)(a) of the Consumer Protection Act, 2019. The case centered on the serving of non-vegetarian food instead of vegetarian, raising issues of consumer rights and corporate responsibility.</p>\n\n<p>The complainants alleged that despite specifically requesting vegetarian momos at a Wow Momos outlet, they were served chicken momos, resulting in mental trauma and hurt religious sentiments. They sought Rs. 6,00,000 in compensation for deficiency in service and emotional distress. The opposing party refuted these claims, stating the invoice indicated a non-vegetarian order, and that clear labeling was available. They further argued that the complainants did not qualify as \"consumers\" under the Act due to a processed refund and rejected goodwill compensation offer.</p>\n\n<p>Ultimately, the Commission dismissed the complaint, citing a lack of sufficient evidence to prove the complainants ordered vegetarian momos or consumed non-vegetarian items unintentionally. The commission found the labelling on the display board provided clarity.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/consumer-rights-vs-corporate-responsibility-a-legal-perspective.jpg"
  },
  {
    "title": "Bombay High Court Grants Full Reimbursement for Heart Surgery, Prioritizing Right to Life",
    "description": "<p>In a significant ruling, the Bombay High Court in *Anirudh Prataprai Nansi v. Union of India* directed the Central Government to fully reimburse ₹22,08,440 to Mr. Nansi, a retired government employee, for a heart transplant conducted at a private hospital. The court emphasized the primacy of Article 21 of the Constitution, safeguarding the right to life, in cases where essential medical treatment is unavailable through government-sponsored channels.</p>\n\n<p>The case arose from Mr. Nansi's urgent need for a heart transplant due to severe cardiomyopathy. Because no Central Government Health Scheme (CGHS)-approved hospital in Mumbai was equipped to perform the procedure at the time, he underwent the transplant at a private facility. The CGHS authorities initially approved a reimbursement based on an outdated CGHS-Mumbai rate of ₹69,000, which was significantly lower than the actual expenses.</p>\n\n<p>The High Court strongly criticized the CGHS's narrow, technical approach, asserting that rigid procedural compliance should give way to compassion and constitutional values in life-saving situations. The court highlighted that heart transplants are inherently urgent, the right to health is integral to Article 21, and the government has the power to relax guidelines in medical emergencies. It also emphasized that the lack of empanelled facilities cannot justify denying essential care and questioned the outdated and discriminatory reimbursement rates. The judgment reinforces that public health policies must prioritize the well-being and constitutional rights of individuals, especially in critical medical situations.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/hc-grants-full-reimbursement-for-surgery.jpg"
  },
  {
    "title": "IndiaMART vs. PUMA: Balancing IP Protection and Intermediary Liability in the Digital Age",
    "description": "<p>The Delhi High Court's judgment in *IndiaMART Intermesh Limited vs. PUMA SE* addresses the complex intersection of intellectual property rights and intermediary liability in the context of a B2B digital marketplace. The case centered on PUMA's claim that IndiaMART facilitated trademark infringement by allowing unauthorized sellers to use \"PUMA\" as a keyword, leading to the sale of counterfeit goods on its platform. PUMA argued that IndiaMART was directly infringing its registered trademarks under Section 29 of the Trade Marks Act, 1999.</p>\n\n<p>IndiaMART, however, contended that it acted solely as an intermediary under Section 2(1)(w) of the Information Technology Act, 2000, providing a platform for sellers to list products without altering their content. The platform argued that it should not be held liable for third-party information listed on its website, citing Section 79(1) of the IT Act which provides a \"safe harbor\" for intermediaries. PUMA countered that IndiaMART's actions amounted to passing off and that they had received consumer complaints of counterfeit PUMA products being sold on IndiaMART's platform.</p>\n\n<p>The Delhi High Court overturned the Single Judge’s order, stating that merely offering \"PUMA\" as a keyword did not constitute trademark infringement under Section 29 of the Trade Marks Act. The court found that IndiaMART provided listing services where buyers and sellers negotiated directly, functioning more like a directory facilitating product classification. Furthermore, the court upheld IndiaMART's immunity as an intermediary under Section 79(1) of the IT Act, emphasizing that intermediaries are not liable for third-party content unless they have \"actual knowledge\" of unlawful content based on court orders or governmental notifications.</p>\n\n<p>In conclusion, the ruling clarifies that intermediary platforms like IndiaMART are not directly liable for trademark infringement based solely on user-generated listings or keyword metadata. The judgement strikes a balance between protecting intellectual property rights and enabling innovation in the digital economy by requiring platforms to have compliant content moderation systems, and emphasizes collaboration between intermediaries, brand owners, and regulatory bodies to combat counterfeit goods.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/indiamart-puma-ip.jpg"
  },
  {
    "title": "Consumer Forum Rejects Insurer's Restrictive Interpretation of 'Accident' in Rabies Death Case",
    "description": "<p>The Uttarakhand State Consumer Disputes Redressal Commission ruled in favor of the complainant, Smt. Meera Srivastava, against IFFCO Tokio General Insurance Co. Ltd., reinforcing that insurers must base claim denials on explicit policy provisions rather than vague interpretations. The case stemmed from the insurer's refusal to honor a personal accident insurance claim following the death of Smt. Srivastava's husband due to complications from rabies.</p>\n\n<p>The insurer repudiated the claim, arguing that the policy covered events like road accidents or burns, not infectious diseases. However, the Commission found that the policy lacked any specific exclusion for rabies or related infections, rejecting the insurer's restrictive interpretation of \"injury\" as defined by the policy.</p>\n\n<p>The Commission invoked the principle of *contra proferentem*, stating that any ambiguity in the policy wording must be interpreted in favor of the policyholder. They held that the insurer's repudiation was unjustified and constituted a deficiency in service. As a result, the Commission directed IFFCO Tokio to pay the insured amount, along with compensation for mental anguish and litigation costs. This decision underscores the importance of clear and consistent policy language, ensuring that insurers honor the reasonable expectations of policyholders and avoid unjustified claim denials.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/rabies-death-forum-rejects-insurers-take-on-accident.jpg"
  },
  {
    "title": "Redefining KYC: SEBI’s Directives for Universal Accessibility",
    "description": "<p>The Securities and Exchange Board of India (SEBI) and the Supreme Court of India are taking significant steps to ensure digital Know Your Customer (KYC) processes are accessible and inclusive, particularly for persons with disabilities (PwDs). This push aligns with the Digital India Programme, the Rights of Persons with Disabilities Act, 2016, and the UN Convention on the Rights of Persons with Disabilities. The Supreme Court's judgment in Pragya Prasun v. Union of India has broadened the scope of Article 21 of the Constitution to include digital accessibility as a fundamental right.</p>\n\n<p>The legal framework emphasizes equal rights for individuals with disabilities, mandating access to information and communication technologies. Sections of the RPwD Act guarantee financial autonomy and require service providers to achieve accessibility compliance. Enforcement involves nodal officer appointments, periodic audits with visually impaired individuals, and alternative liveness verification methods for KYC. Inclusive communication options, such as sign language and accessible formats, are crucial for equitable access.</p>\n\n<p>SEBI has directed registered intermediaries to adopt alternative verification methods, moving beyond traditional practices that may exclude PwDs. These alternatives include head movements, OTP-based authentication, and real-time video recordings, ensuring equal access to financial services. This initiative is monumental in redefining inclusivity, fostering autonomy, and emphasizing the responsibility of service providers to adopt universal design principles. By mandating accessibility audits and alternative KYC methods, the Supreme Court has reinforced the need for inclusive digital services, highlighting the State’s responsibility to ensure equitable access for persons with disabilities.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/sebi-kyc-guidelines-boost-accessibility.jpg"
  },
  {
    "title": "New CERSAI Compliance: Source of Funds Now Mandatory for SI Filings",
    "description": "<p>CERSAI has announced a new compliance requirement mandating financial institutions to disclose the source of funds when registering a security interest. This initiative seeks to enhance regulatory oversight and transparency, particularly in lending arrangements involving on-lending or refinance structures.</p>\n\n<p>Established under the SARFAESI Act, CERSAI maintains a central registry of charges over various assets, ensuring the legal enforceability of security interests and preventing fraudulent multiple financing. The new mandate introduces mandatory fields for lenders to specify the \"Type of Lending\" (direct, on-lending, or refinance), the \"Source of Fund Entity ID\" (of the original lending institution like NABARD), and the \"Source of Fund Security Interest ID\" (for refinance secured by a prior charge).</p>\n\n<p>These changes will impact banks, NBFCs, and other lending institutions, requiring them to adapt their registration processes. Institutions are advised to proactively update their systems and procedures to incorporate the new mandatory fields, ensuring compliance and uninterrupted legal enforceability of their secured interests. This regulatory development aims to bring greater clarity and control over lending chains and fund flows, particularly in multi-layered credit structures, thus enhancing the governance of secured lending.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/new-cersai-compliance-alert.jpg"
  },
  {
    "title": "Madras High Court Affirms Same-Sex Couples Can Constitute a Family, Even Without Marriage",
    "description": "<p>In the case of MA v Superintendent of Police, the Madras High Court has reinforced the recognition of same-sex couples as a family unit, despite the absence of legal same-sex marriage in India. The ruling stemmed from a habeas corpus petition, filed under Article 226 of the Constitution, alleging unlawful detention and coercion against an individual by their natal family due to their sexual orientation.</p>\n\n<p>The court's decision, delivered by Justice G.R. Swaminathan and Justice V. Lakshminarayan, favored the petitioner and emphasized the detainee's right to personal autonomy and choice in relationships. The judgment acknowledged that the definition of family extends beyond traditional norms to include chosen families, particularly those within the LGBTQIA+ community. This aligns with evolving jurisprudence, including landmark cases like NALSA v. Union of India and Navtej Singh Johar v. Union of India, which have contributed to the decriminalization and recognition of LGBTQIA+ rights.</p>\n\n<p>The High Court criticized societal prejudices and police insensitivity, highlighting the state's duty to protect LGBTQIA+ individuals' rights. The court ultimately allowed the detainee to leave with the petitioner, restraining the natal family from interfering and mandating police protection for the couple. This ruling marks a crucial step in safeguarding the rights and liberties of LGBTQIA+ individuals in India, particularly in the ongoing absence of comprehensive legislative recognition for same-sex relationships.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/madras-high-court-affirms-same-sex-couples-can-constitute-a-family-even-without-marriage.jpg"
  },
  {
    "title": "Revisiting FIR Quashing: Supreme Court’s Perspective in Abhishek Singh V. Ajay Kumar & ORS",
    "description": "<p>The Supreme Court of India, in *Abhishek Singh v. Ajay Kumar & Ors*, addressed the principles governing the quashing of FIRs, particularly in cases involving allegations of fraud and misappropriation. The case arose from a loan agreement where the appellant, Abhishek Singh, pledged gold ornaments as collateral, later discovering the gold was deemed counterfeit by the bank after he repaid the loan.</p>\n\n<p>The Patna High Court had quashed Singh's FIR, considering it a retaliatory measure lacking prima facie evidence and citing procedural non-compliance. However, the Supreme Court overturned this decision, emphasizing that an FIR should only be quashed if it doesn't disclose a prima facie case. The Supreme Court found that the High Court had improperly engaged in evidentiary appreciation, a function reserved for trial.</p>\n\n<p>The Supreme Court reiterated that the allegations in Singh's FIR did present a prima facie case, warranting further investigation through a trial. The Court clarified that its decision does not reflect any opinion on the merits of the case or the guilt of either party. Ultimately, the Supreme Court restored the FIR and directed the trial court to proceed with the matter in accordance with the law, reinforcing the need for caution when considering the quashing of an FIR.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/abhishek-singh-v-ajay-kumar-ors.jpg"
  },
  {
    "title": "Supreme Court Rules: Developer Not Liable for Homebuyer’s Loan Interest Due to Delay in Flat Possession",
    "description": "<p>In a judgment on June 4, 2025, the Supreme Court of India addressed a consumer rights issue involving the Greater Mohali Area Development Authority (GMADA) and homebuyers Anupam Garg and Rajiv Kumar, stemming from delays and changes in the 'Purab Premium Apartments' project launched in 2011. The court examined the legal responsibilities of developers and consumer rights under Indian law.</p>\n\n<p>The dispute arose when Anupam Garg, after being allotted a flat in 2012 with a possession date of May 21, 2015, found no progress on-site and opted out, filing a consumer complaint after GMADA's delayed possession offer in June 2016 included unilateral project changes.</p>\n\n<p>The State Consumer Disputes Redressal Commission (SCDRC) and the National Consumer Disputes Redressal Commission (NCDRC) ruled in favor of Garg, directing GMADA to refund the deposit with 8% interest, compensate for mental distress and litigation costs, and cover the loan interest paid by Garg.</p>\n\n<p>GMADA appealed to the Supreme Court, arguing against liability for loan interest. The Supreme Court, referencing precedents, concluded that the already awarded 8% interest adequately compensated for the delay, clarifying that while Commissions can grant compensation, it must be tied to specific losses suffered. The Court ruled GMADA was not liable for the respondent's loan interest.</p>\n\n<p>The Supreme Court's decision clarified that while reasonable compensation is necessary for delays or service deficiencies, it must be based on the actual losses incurred, preventing undue financial burdens on developers while ensuring accountability and fairness in the housing market.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/supreme-court-rules-developer-not-liable-for-homebuyers-loan-interest-due-to-delay-in-flat-possession.jpg"
  },
  {
    "title": "Bombay High Court Allows Accused to Travel Abroad Amid Matrimonial Dispute",
    "description": "<p>The Bombay High Court granted permission to a Non-resident Indian (NRI) employed in the United States to travel abroad for work, despite facing charges in a matrimonial case. The ruling in *Sukrutkumar Babasaheb Bhandare vs. State of Maharashtra & Anr.* demonstrates a balanced judicial approach, considering both the accused's livelihood and the integrity of legal proceedings.</p>\n\n<p>The petitioner, Sukrutkumar Babasaheb Bhandare, was charged under various sections of the Indian Penal Code based on a complaint filed by his wife. He sought permission to return to the US, where he is employed. The Sessions Court initially rejected his plea, citing potential disruption to the investigation and mediation. Subsequently, the petitioner filed a Writ Petition.</p>\n\n<p>The High Court considered arguments from both parties, including the husband's cooperation with authorities and the wife's concern regarding withheld documents. Through joint request and exploration, both parties agreed to certain conditions. The conditions are that the husband hand over all documents and certificates belonging to the wife, provide electronic data stored on his laptop,andundertaking to participate and cooperate in the trial without causing any obstruction or delay.</p>\n\n<p>Justice Ashwin D. Bhobe, appreciating the cooperative approach, set aside the previous order and allowed the husband to travel, contingent upon adherence to the agreed-upon conditions. This case underscores the value of flexibility and cooperation in legal processes, showcasing how a balanced approach can lead to a just resolution that respects the rights and needs of all parties involved.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/bombay-hc-nri-travel-abroad-matrimonial-dispute.jpg"
  },
  {
    "title": "Section 95 IBC: NCLAT Chennai Bars Consecutive Insolvency Applications Against Same Guarantor",
    "description": "<p>The National Company Law Appellate Tribunal (NCLAT) in Chennai recently addressed the issue of consecutive insolvency resolution proceedings against a personal guarantor under Section 95 of the Insolvency and Bankruptcy Code (I&B Code) in the case of \"Indian Bank v. K R Tirumuruhan.\" This case clarifies the legal constraints when multiple financial creditors attempt to initiate insolvency proceedings against the same guarantor.</p>\n\n<p>The NCLAT upheld the NCLT's decision to dismiss Indian Bank's application, citing Section 96 of the I&B Code, which bars subsequent applications once proceedings have been initiated by another financial creditor. The ruling referenced a similar prior judgment, Indian Bank, SAMB, Chennai Vs T. Prabhakar, reinforcing the principle that the initial application takes precedence.</p>\n\n<p>The final decision dismissed the appeal, emphasizing the importance of adhering to the I&B Code and legal precedents. The NCLAT also directed the NCLT to expedite the pending Section 95 proceedings that prompted the appeal. This judgment reinforces the need for financial creditors to be aware of existing proceedings before initiating new ones to ensure the efficient and fair resolution of insolvency cases.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/section-95-ibc-nclat.jpg"
  },
  {
    "title": "Industrial Disputes Act and Article 19(1)(g): Supreme Court Upholds Right to Close Business",
    "description": "<p>The Supreme Court of India, in *Harinagar Sugar Mills Ltd. (Biscuit Division) versus the State of Maharashtra*, addressed the legality of industrial closures under the Industrial Disputes Act, 1947, and the constitutional right to close a business per Article 19(1)(g). The case stemmed from Harinagar Sugar Mills Limited's (HSML) closure of its biscuit division following the termination of a long-standing job work agreement with Britannia Industries Limited (BIL).</p>\n\n<p>HSML applied for closure, but the Government of Maharashtra requested additional information, which HSML provided. When the authorities requested resubmission, HSML argued that closure permission was automatically granted per Section 25-O(3) of the Industrial Disputes Act, 1947, due to the government's failure to respond within 60 days. The Bombay High Court dismissed HSML's petitions, deeming the application incomplete.</p>\n\n<p>The Supreme Court overturned the High Court's decision, holding that the initial request for information was not an order and the Deputy Secretary lacked the authority to request resubmission. The Court emphasized that the right to close a business is intrinsic to the right to conduct business under Article 19(1)(g), albeit subject to reasonable restrictions in the public interest under Article 19(6). The Court ruled that the 60-day period for deemed closure should be calculated from the initial application date, implying closure approval. HSML was directed to pay an additional Rs. 15 crores as compensation to the affected employees.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/industrial-disputes-act-close-business.jpg"
  },
  {
    "title": "RBI's Lending Against Gold and Silver Collateral Directions, 2025",
    "description": "<p>On June 6, 2025, the Reserve Bank of India (RBI) released the Reserve Bank of India (Lending Against Gold and Silver Collateral) Directions, 2025, a unified regulatory framework designed to harmonize the treatment of loans secured by gold and silver across all regulated entities (REs). The reform aims to enhance prudence, borrower protection, and operational transparency within the gold loan sector.</p>\n\n<p>The new Directions consolidate and repeal over 30 circulars issued between 1964 and 2023, addressing inconsistencies and supervisory gaps arising from the previously fragmented regulatory structure. Applicable to a wide range of REs, the Directions will be fully effective by April 1, 2026, with loans sanctioned prior to this date remaining subject to the guidelines in effect at the time of issuance.</p>\n\n<p>Key provisions include restricting permissible collateral to gold and silver jewellery, ornaments, and coins, while prohibiting lending against primary gold/silver bullion or financial instruments backed by such assets. Loan-to-Value (LTV) caps have been introduced and must be maintained throughout the loan tenure, alongside standardized assaying and valuation procedures. Consumer protection measures, operational restrictions, AML checks, guidelines for top-up loans and renewals, collateral management, auction transparency, and provisions for unclaimed collateral are also outlined. Furthermore, lenders are required to disclose detailed loan portfolio information relating to gold and silver-backed loans in their financial statements.</p>\n\n<p>The RBI's 2025 Directions represent a forward-looking regulatory stance, unifying legacy norms into a single set of principles to promote responsible and transparent gold loan practices. Financial institutions are encouraged to view these guidelines as an opportunity to build trust and better serve customers, particularly those who rely on gold loans for short-term liquidity.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/rbi-gold-silver-guideline.jpg"
  },
  {
    "title": "Authorized Officials Can Testify: J&K High Court Eases Cheque Bounce Procedure",
    "description": "<p>The Jammu & Kashmir High Court, in *Iftikhar Ashraf Trumboo v. Furqan Ahmad Rather*, has streamlined procedures for cheque dishonor cases under Section 138 of the Negotiable Instruments Act, 1881. The Court ruled that the personal appearance of a Branch Manager is not mandatory for proving bank records. Any duly authorized bank official with access to the necessary records is competent to testify, thereby overturning a Trial Magistrate's overly strict procedural interpretation.</p>\n\n<p>The case originated from a Section 138 complaint where a cheque was dishonored due to insufficient funds. When the complainant presented an authorized bank representative in lieu of the Branch Manager, the Trial Magistrate refused to record their testimony, demanding a formal substitution application. The High Court found this insistence on procedural formalities to be excessive and legally incorrect.</p>\n\n<p>Justice Sanjay Dhar clarified that any responsible bank officer with access to account records in the ordinary course of business can testify to documentary evidence, such as cheque return memos, without needing personal knowledge. The Court also deemed the invocation of Section 302 of the Criminal Procedure Code unnecessary, as it obstructs the summary nature of Section 138 proceedings. The admissibility of such evidence is governed by Sections 65B and 67 of the Indian Evidence Act, 1872, which facilitate the admission of electronic and documentary records maintained in the ordinary course of business.</p>\n\n<p>This decision aligns with existing legal principles promoting swift justice in cheque dishonor cases, as emphasized by the Supreme Court in *Indian Bank Association v. Union of India (2014)*. The J&K High Court's ruling reinforces the importance of efficient resolution of cheque bounce disputes, preventing procedural technicalities from hindering prompt justice under Section 138 of the NI Act.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/officials-jk-hc-cheque-bounce-procedure.jpg"
  },
  {
    "title": "CCPA Mandates Self-Audit for E-Commerce Platforms to Eliminate Dark Patterns",
    "description": "<p>The Central Consumer Protection Authority (CCPA) issued an advisory on June 5, 2025, mandating all e-commerce platforms in India to conduct self-audits to identify and eliminate dark patterns within three months. This directive, issued under the Consumer Protection Act, 2019, aims to foster a transparent and ethical digital ecosystem that prioritizes consumer interests.</p>\n\n<p>This action builds upon the \"Guidelines for Prevention and Regulation of Dark Patterns, 2023,\" by introducing a proactive compliance mechanism. Dark patterns are defined as manipulative design elements used to deceive users into unintended actions, such as unwanted purchases or unknowingly sharing personal data. The CCPA aims to ensure consumers are not subjected to coercive or misleading digital experiences.</p>\n\n<p>The Department of Consumer Affairs has already issued notices to 11 e-commerce platforms for violating the 2023 guidelines, demonstrating the seriousness of non-compliance. Platforms must prioritize adhering to CCPA principles, including design teams, legal and compliance departments, and marketing. Non-compliance could result in regulatory scrutiny, penalties, and reputational damage.</p>\n\n<p>This advisory signifies a crucial step towards a safer and more equitable digital economy in India, compelling e-commerce platforms to prioritize consumer welfare over manipulative growth tactics, emphasizing proactive compliance and responsible governance.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/ccpas-dark-patterns-mandates-self-audit.jpg"
  },
  {
    "title": "Mandatory Induction of CNG or Electric Vehicles by Aggregators and E-Commerce Entities in Delhi NCR",
    "description": "<p>The Commission for Air Quality Management (CAQM) has issued a directive mandating that all new fleet additions by motor vehicle aggregators, delivery service providers, and e-commerce platforms in Delhi-NCR must exclusively consist of compressed natural gas (CNG) or electric vehicles (EVs). This policy intervention aims to significantly reduce vehicular emissions in the highly polluted National Capital Region.</p>\n\n<p>The CAQM invoked its authority under the Commission for Air Quality Management in National Capital Region and Adjoining Areas Act, 2021, issuing Direction No. 94 dated 03.06.2025. This directive applies to entities operating fleets of 25 or more vehicles and requires a phased transition to CNG and EV fleets.</p>\n\n<p>Vehicular pollution, especially from commercial vehicles, significantly contributes to air pollution in the NCR. The rapid growth of e-commerce and app-based logistics has exacerbated this issue. This policy aligns with national initiatives like the National Electric Mobility Mission Plan (NEMMP), the Faster Adoption and Manufacturing of Hybrid and Electric Vehicles (FAME) schemes, and state EV policies, promoting a cleaner transport ecosystem. The CAQM directive represents a key regulatory effort to decarbonize commercial transportation in the NCR and achieve sustainable logistics with legal backing.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/cng-evs-aggregators-e-commerce-delhi.jpg"
  },
  {
    "title": "Delhi High Court Upholds Maintenance Obligations Under Section 24 Of The Hindu Marriage Act",
    "description": "<p>The Delhi High Court, in *Subhash v. Mamta @ Raksha*, reaffirmed that a husband's obligation to maintain his wife and child under Section 24 of the Hindu Marriage Act (HMA), which provides for interim maintenance during matrimonial proceedings, cannot be diminished by citing personal financial commitments like loan EMIs or insurance premiums. The court emphasized that maintenance calculations should be based on the husband's earning capacity and gross income, excluding voluntary expenses, thus safeguarding dependent spouses and children from attempts to evade maintenance responsibilities.</p>\n\n<p>The case arose from a marital dispute where the wife sought interim maintenance after the husband filed for divorce. The Family Court ordered the husband, with a declared monthly income of ₹47,000, to pay ₹15,000 monthly for the wife and child. The husband challenged this, arguing reduced disposable income due to loan obligations and insurance payments. The High Court rejected these arguments, stating that voluntary financial obligations cannot supersede the primary duty to maintain dependents.</p>\n\n<p>The Court's analysis aligned with the Supreme Court’s stance in *Manish Jain v. Akanksha Jain*, emphasizing that financial commitments like home loans cannot dilute the legal duty of maintenance. The court also found the wife's unemployment to be genuine due to caregiving responsibilities, consistent with *Shailja & Anr. v. Khobbanna*, which affirms a qualified wife's entitlement to maintenance if she's not earning due to legitimate duties. The ruling reinforces the judiciary's commitment to protecting the financial well-being of spouses and children post-separation. Voluntary personal expenses cannot reduce statutory maintenance. The judgement makes maintenance an effective financial safeguard.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/hc-obligation-hindu-marriage-act.jpg"
  },
  {
    "title": "Safeguarding Consumer Communication: Addressing Unsolicited Commercial Communication",
    "description": "<p>Unsolicited Commercial Communication (UCC), or spam, poses significant challenges in the digital age, including privacy violations and cybersecurity risks. These unrequested messages, promoting goods or services, necessitate robust regulations and technological solutions to protect consumers. The Telecom Commercial Communications Customer Preference Regulations (TCCCPR), 2018, and its subsequent amendments, aim to tackle UCC through enhanced measures.</p>\n\n<p>The TCCCPR defines UCC as any commercial communication that doesn't align with the recipient's consent, excluding transactional and government-issued messages. The Second Amendment, introduced in 2025, refines the framework by classifying mixed promotional content as promotional, requiring prior notification for auto-diallers, and implementing stricter provider obligations such as communication authentication and adherence to regulations. A key update is the abolishment of inferred consent from existing business relationships, mandating fresh consent after service contract termination.</p>\n\n<p>A streamlined complaint mechanism, featuring a standardised format and quicker response times, is now in place to bolster consumer control. Consumers can report UCC with minimal information, and service providers must respond within five days. Violators face penalties ranging from fines to blacklisting and service disconnection. Technical measures, consumer education campaigns, and proactive registration with \"do-not-disturb\" services further aid in combating spam.</p>\n\n<p>Globally, countries are employing various strategies, with India's blockchain-based Distributed Ledger Technology (DLT) framework setting a high standard by ensuring transparency, accountability, and explicit consent. This contrasts with the US CAN-SPAM Act's opt-out mechanisms and the EU GDPR's focus on explicit consent. Effective UCC mitigation requires collaborative efforts among regulators, telecom providers, and consumers, along with ongoing innovation and the adoption of best practices to foster trust and integrity in digital communication.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/unsolicited-commercial-communication.jpg"
  },
  {
    "title": "Kerala High Court Upholds Right to Religious Identity in Educational Records: Sudhin Krishna Case",
    "description": "<p>The Kerala High Court, in the case of *Sudhin Krishna C. S. v State of Kerala and Ors*, reaffirmed an individual's constitutional right under Article 25 to freely choose and reflect their religious identity in official records. The ruling, delivered by Justice D.K. Singh, centered on a petitioner's request to amend his name and religion in his educational documents.</p>\n\n<p>Sudhin Krishna C.S., originally registered as Mohammed Riyazudeen C.S., sought to correct his records to reflect his Hindu identity, which he adopted upon reaching adulthood. The District Educational Officer (DEO) denied his request, citing the Kerala Education Rules (KER), 1959, as not explicitly allowing such changes. The petitioner then appealed to the Kerala High Court, arguing that Rule 3(1) of Chapter VI of the KER permitted such amendments.</p>\n\n<p>The petitioner contended that Rule 3(1) of Chapter VI of the KER explicitly allows changes to details such as name, religion, and caste, citing the violation of religious freedom under Article 25 of the Constitution. The respondents countered that the KER primarily addressed corrections to dates of birth, limiting the Commissioner of Examinations' authority to make broader changes.</p>\n\n<p>The High Court interpreted Rule 3(1) of Chapter VI of the KER to encompass alterations beyond just the date of birth, extending to personal details like name, religion, and caste. The court directed the respondents to amend the petitioner's educational records to accurately reflect his chosen name and religion, underscoring the principles of personal liberty, self-determination, and the right to an accurate representation of one’s chosen identity in official documents.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/right-to-religious-educational.jpg"
  },
  {
    "title": "Karnataka's 2025 Tobacco Law Overhaul: Implications for Businesses and Citizens",
    "description": "<p>On May 30, 2025, the Government of Karnataka enacted the Cigarettes and Other Tobacco Products (Prohibition of Advertisement and Regulation of Trade and Commerce, Production, Supply, and Distribution) (Karnataka Amendment) Act, 2024, amending the COTPA, 2003. Key changes include raising the legal age for purchasing tobacco products from 18 to 21 years and increasing the maximum fine for violations from ₹200 to ₹1,000. The legislation aims to strengthen tobacco control and reduce consumption, particularly among youth.</p>\n\n<p>The amendment broadens the prohibition of tobacco use in public places to include both smoking and spitting, while allowing designated smoking areas in larger hotels, restaurants, and airports that meet specific requirements. A complete ban on hookah bars has also been introduced, reflecting the state's effort to regulate tobacco consumption in social environments. The sale of tobacco products is now restricted to individuals 21 years and older, and increased scrutiny will be applied to sales near educational institutions.</p>\n\n<p>Significant penalties have been introduced for operating hookah bars, including imprisonment from one to three years and fines ranging from ₹50,000 to ₹1,00,000. Dr. U.S. Vishal Rao, a member of Karnataka’s High-Powered Committee on Tobacco Control, believes these amendments are a crucial step in curbing tobacco use among the younger population. Bengaluru Police Commissioner B. Dayananda has emphasized strict enforcement, urging establishments to adhere to COTPA guidelines for designated smoking areas.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/karnataka-2025-tobacco-law-businesses.jpg"
  },
  {
    "title": "Supreme Court Reaffirms Finality in AGR Dues: Dismisses Vodafone Idea’s Writ Petitions",
    "description": "<p>The Supreme Court of India dismissed writ petitions filed by Vodafone Idea Ltd. and other telecom operators, reaffirming the finality of its previous rulings on Adjusted Gross Revenue (AGR) dues. The petitions, filed under Article 32 of the Constitution, challenged the imposition of interest, penalties, and interest on penalties related to AGR.</p>\n\n<p>The core issue stems from differing interpretations of AGR between telecom operators and the Department of Telecommunications (DoT). A 2019 Supreme Court judgment sided with the DoT, significantly increasing the financial liabilities of telecom companies. While the Court allowed payment in ten annual installments in 2020, the operators sought further relief in 2025, arguing that interest and penalties were economically unsustainable.</p>\n\n<p>The Supreme Court bench dismissed the petitions, emphasizing that Article 32 cannot be used to reopen conclusively decided matters. The Court underscored the importance of judicial discipline and the finality of its judgments, signaling that the remedy for economic grievances lies in policy engagement, not repeated litigation. This decision reinforces legal certainty for the telecom sector, urging companies to focus on operational stability and financial restructuring within the established framework of AGR liabilities and payment timelines.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/sc-agr-due-vodafone-ideas-writ-petition.jpg"
  },
  {
    "title": "Stamp Duty Compliance Just Got Smarter: Rajasthan Launches Mandatory API-Based Calculator For All Digital Document Executions",
    "description": "<p>The Government of Rajasthan has launched a mandatory automated Stamp Duty Calculator API for all digitally executed documents within the state's Digital Document Execution (DDE) platform, effective May 30, 2025. This initiative, developed in collaboration with Stock Holding Corporation of India Limited (SHCIL) and National E-Governance Services Ltd. (NeSL), aims to standardize stamp duty assessment and eliminate errors associated with manual calculations.</p>\n\n<p>This new system enhances the DDE workflow by ensuring uniformity and accuracy in stamp duty calculation for transactions executed in Rajasthan, and it is intended to ensure accuracy by removing the possibility of manual entry errors.</p>\n\n<p>The introduction of the Rajasthan Stamp Duty Calculator API represents a significant advancement in e-governance for digital legal documentation. By enforcing standardized, automated duty computation, the initiative strengthens regulatory compliance, reduces human error, and enhances operational efficiency for financial institutions. Stakeholders are advised to adapt quickly to ensure full compliance.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/stamp-duty-rajasthan-api-calculator-digital-document.jpg"
  },
  {
    "title": "Calcutta High Court Upholds Scientific Merit Over Moral Speculation in Patent Law",
    "description": "<p>The Calcutta High Court recently ruled in favor of ITC Limited regarding their patent application for a \"Heater Assembly to Generate Aerosol,\" overturning the Controller of Patents' initial rejection. The Controller had cited Section 3(b) of the Patents Act, 1970, expressing concerns about public health and morality related to the device's potential use, particularly given the Prohibition of Electronic Cigarettes Act, 2019.</p>\n\n<p>The Court emphasized that patent denials based solely on moral or public health grounds require independent scientific or technical evidence, and subjective notions are insufficient justification. The Controller's assumption that the invention was exclusively intended for tobacco products was incorrect, as the device could be used with various substrates.</p>\n\n<p>Justice Ravi Krishnan Kapur clarified that the e-cigarette ban addresses commercial activities, not the inherent patentability of an invention. Furthermore, the Controller's reliance on undisclosed documents violated principles of natural justice, denying ITC an opportunity to respond and rendering the decision procedurally flawed. The court has reaffirmed that bans on sale or distribution of products do not automatically equate to a ban on innovation and that health regulations should not unduly influence patent decisions.</p>\n\n<p>In conclusion, the High Court set aside the Controller's order and remanded the matter for a fresh decision, stressing the need for a hearing and adherence to scientific and technical grounds. This ruling underscores the importance of relying on evidence-based assessments in patent law and establishes a narrower interpretation of Section 3(b), reinforcing the separation between health regulations and patent eligibility.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/calcutta-hc-favors-science-in-itc-aerosol-patent-ruling.jpg"
  },
  {
    "title": "Breaking the Mold: Can Courts Now Rewrite Arbitral Awards?",
    "description": "<p>In *Gayatri Balasamy v. ISG Novasoft Technologies Ltd.*, a Supreme Court Constitution Bench addressed the power of Indian courts to modify arbitral awards under Sections 34 and 37 of the Arbitration and Conciliation Act, 1996. The 4:1 majority held that limited judicial modification is permissible in specific circumstances, including clerical errors, severable portions, post-award interest, and under Article 142. This departs from the earlier decision in *NHAI v. Hakeem*, raising concerns about judicial overreach and its impact on the finality and autonomy of arbitration.</p>\n\n<p>The case arose from conflicting judicial opinions regarding the power of Indian courts to modify arbitral awards, with some allowing it and others ruling against it. The Supreme Court aimed to resolve whether courts can modify awards or only set them aside. The Arbitration Act, modeled on the UNCITRAL Model Law, emphasizes limited court intervention, primarily allowing courts to set aside awards on specific grounds. However, the *Balasamy* ruling permits modifications in limited cases, sparking debate.</p>\n\n<p>Supporters argue that limited judicial modifications promote judicial economy and prevent delays. Opponents maintain that such powers conflict with the legislative intent of the Arbitration Act, potentially undermining arbitration's core principles and inviting further litigation. The ruling endorses judicial modifications under narrow circumstances and constitutional powers under Article 142. This interpretation has raised concerns about the integrity and indivisibility of arbitral awards, as well as potentially breaching the separation of powers.</p>\n\n<p>The majority's expansive view of Section 34 risks tactical litigation, weakens tribunal authority, and erodes arbitration’s finality. Arbitral awards are generally unified instruments, and selectively modifying them compromises their coherence. Justice K.V. Viswanathan's dissent underscores that Article 142 cannot override clear statutory provisions, stressing judicial restraint and respect for legislative boundaries. Ultimately, the *Balasamy* decision introduces a nuanced approach, allowing limited court modifications, including severing invalid portions, correcting errors, modifying post-award interest, and invoking Article 142 to ensure complete justice.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/mold-courts-rewrite-arbitral-awards.jpg"
  },
  {
    "title": "Supreme Court Rules on Retirement Age for Disabled Employees: A Summary of *Kashmiri Lal Sharma v. Himachal Pradesh State Electricity Board*",
    "description": "<p>The Supreme Court of India, in the case of *Kashmiri Lal Sharma v. Himachal Pradesh State Electricity Board*, addressed the issue of retirement age disparities among employees with disabilities. The appellant, a 60% locomotor-disabled electrician, challenged his retirement at age 58, arguing it violated Article 14 of the Constitution due to an earlier Office Memorandum (OM) that allowed visually impaired employees to work until 60. The State later withdrew this OM, reverting the retirement age to 58 for all categories.</p>\n\n<p>The Court reaffirmed that setting the retirement age is a policy decision within the executive's purview, subject to the principles of equality. The appellant contended that the disparity violated Article 14 and that he had a legitimate expectation to work until 60 due to the OM's earlier existence. Conversely, the State argued that the OM's withdrawal negated any claims for extended retirement.</p>\n\n<p>Referencing the Persons with Disabilities (PWD) Act, 1995, and the Rights of Persons with Disabilities (RPWD) Act, 2016, the Court emphasized the need for equal treatment regarding employment benefits for individuals with benchmark disabilities. While partially allowing the appeal, the Court ruled that the appellant was entitled to full wages and benefits until the OM's withdrawal date (November 4, 2019) and that his pension should be calculated accordingly. The Court firmly stated that employees do not have a vested right to continue employment beyond the date of the OM's withdrawal, reinforcing the executive's right to determine retirement age through policy decisions, while still adhering to constitutional principles of fairness and equality.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/no-absolute-right-retirement-timing.jpg"
  },
  {
    "title": "Admission of CIRP Under Section 7 of the IBC, 2016, is Liable to Be Recalled Upon Establishment of Fraud or Malicious Intent Under Section 65 of the Code",
    "description": "<p>The National Company Law Appellate Tribunal (NCLAT) upheld the Adjudicating Authority's decision to terminate the Corporate Insolvency Resolution Process (CIRP) against a corporate debtor, based on findings that the insolvency proceedings were initiated fraudulently and with malicious intent. This ruling underscores the importance of Section 65 of the Insolvency and Bankruptcy Code (IBC), 2016, which safeguards against the abuse of the Code's process.</p>\n\n<p>The case involved a dispute where the Appellants initiated CIRP under Section 7, claiming to be financial creditors. The Respondent argued that the CIRP was a fraudulent attempt to defeat ongoing litigation related to the illegal dilution of their shareholding. The Adjudicating Authority terminated the CIRP, citing collusion, document fabrication, and misuse of the insolvency process.</p>\n\n<p>The NCLAT affirmed the NCLT’s findings, emphasizing that the existence of debt and default does not shield a Section 7 application from scrutiny under Section 65 when collusion or abuse is proven. The Tribunal found significant documentary inconsistencies, violations of corporate law, manipulation of timing, and corroborative evidence of fraud. The Court clarified that terminating the CIRP was an adjudication on fraud and not a review of the admission order.</p>\n\n<p>This decision reinforces the judiciary's commitment to preventing the strategic abuse of the IBC, 2016. While Section 7 allows creditors to initiate CIRP based on financial debt and default, this mechanism is subject to scrutiny. Section 65 empowers the Adjudicating Authority to annul proceedings tainted by fraud or bad faith, thereby protecting the integrity of the Code.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/admission-cirp-under-section-7-ibc-2016.jpg"
  },
  {
    "title": "Government Cracks Down On E-Commerce Dark Patterns",
    "description": "<p>The Indian government, through the Ministry of Consumer Affairs, has initiated enforcement action against eleven leading e-commerce and technology platforms for violating the \"Guidelines for Prevention and Regulation of Dark Patterns, 2023.\" Notices were issued on May 28, 2025, citing deceptive user interface practices that mislead consumers.</p>\n\n<p>These guidelines, effective since November 30, 2023, define dark patterns as manipulative design techniques that exploit cognitive biases to influence consumers into unintended actions, such as unwanted purchases or data sharing. Common examples include drip pricing, basket sneaking, and subscription traps, prevalent across various digital platforms.</p>\n\n<p>The 2023 guidelines, legally binding under the Consumer Protection Act, 2019, identify thirteen specific types of dark patterns and encourage consumers to report violations. Despite this, several companies persisted in using these practices, prompting the government's action, which centered around deceptive advertising, forced actions, and subscription traps.</p>\n\n<p>This enforcement aims to enhance transparency and fairness in online transactions, ensuring consumer consent and control. Businesses must now prioritize ethical design and compliance, facing potential penalties for non-compliance. This initiative marks a significant stride towards ethical digital engagement, safeguarding consumer rights and fostering responsible innovation in the digital economy.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/misled-shopping-online-govt-e-commerce.jpg"
  },
  {
    "title": "PESO Introduces Online Module for Licensing Compressed Hydrogen Dispensing Stations in India",
    "description": "<p>The Petroleum and Explosives Safety Organisation (PESO), under the Government of India, launched an online module on May 14, 2025, to streamline the application process for licenses for Compressed Hydrogen Dispensing Stations under the Gas Cylinder Rules 2016. This initiative aims to enhance safety, promote efficiency, and modernize the regulatory framework within the petroleum and explosives industry.</p>\n\n<p>The new online module mandates that all new applications be submitted through the PESO website, eliminating manual submissions. Existing operators with trial permissions are also directed to use the online module to obtain necessary approval licenses.</p>\n\n<p>The application process involves logging in to the PESO website, completing the online form with details such as site address, capacity, and validity, uploading required documents and drawings, and making the required payment online. This standardization reduces the risk of errors, enhances transparency, and improves the overall efficiency of the licensing process. The initiative also supports the government's broader efforts to promote digital transformation and regulatory modernization.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/pesos-module-hydrogen-stations-in-india.jpg"
  },
  {
    "title": "Streamlining Insolvency Professional Appointments: The IBBI’s 2025 Guidelines for Insolvency Professionals",
    "description": "<p>The Insolvency and Bankruptcy Board of India (IBBI) has released the “Insolvency Professionals to act as Interim Resolution Professionals, Liquidators, Resolution Professionals and Bankruptcy Trustees (Recommendation) Guidelines, 2025,” effective from July 1, 2025, to December 31, 2025. These guidelines aim to streamline the appointment process of Insolvency Professionals (IPs) by the National Company Law Tribunal (NCLT) and Debt Recovery Tribunal (DRT), enhancing transparency and efficiency in corporate and individual insolvency cases under the Insolvency and Bankruptcy Code, 2016 (IBC).</p>\n\n<p>The guidelines, issued under various sections of the IBC and related rules, specify eligibility criteria for IPs seeking inclusion in the panel. These criteria include the absence of pending disciplinary proceedings, no convictions in the last three years, submission of an expression of interest in Form A by June 22, 2025, and holding a valid Authorization for Assignment (AFA). The expression of interest constitutes an unconditional consent to act in any specified role.</p>\n\n<p>The IBBI will create a zone-wise and bench-wise common panel of IPs valid for six months, which will be shared with the Adjudicating Authority. The sorting criteria will be based on the volume of ongoing assignments related to liquidation and corporate insolvency resolution processes, with the registration date with the Board serving as a tie-breaker. IPs included in the panel are expected to accept appointments unless otherwise permitted by the NCLT, DRT, or IBBI, with unjustified refusals resulting in removal from the panel for six months.</p>\n\n<p>These guidelines also stipulate that IPs must not surrender their registration or membership during the panel's validity. While the Adjudicating Authority retains the discretion to appoint any IP from the panel, the overarching goal of the new guidelines is to ensure a streamlined and efficient IP appointment process, thereby improving the effectiveness of the IBC. The 2024 guidelines have been repealed.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/ibbi-2025-guidelines-insolvency-professional.jpg"
  },
  {
    "title": "FSSAI Issues Guidelines for Acceptance of Recycled PET as Food Contact Material",
    "description": "<p>On May 23, 2025, the Food Safety and Standards Authority of India (FSSAI) issued a notification outlining guidelines for the acceptance of recycled Polyethylene Terephthalate (PET) as Food Contact Material (FCM-rPET). These guidelines, under the Food Safety and Standards (Packaging) Regulations, 2018, aim to ensure the safety and quality of recycled PET used in food packaging.</p>\n\n<p>The guidelines cover the recycling process of post-consumer PET used in food applications, specifying acceptance criteria for FCM-rPET resin, and apply only to recycling technologies approved by FSSAI. Key definitions include the Food Authority (FSSAI), manufacturer (recycling process operator), Virgin PET (vPET), Post-Consumer Food Grade PET, PET Resin, and Recycled Polyethylene Terephthalate (FCM-rPET).</p>\n\n<p>Stringent testing procedures are mandated, including the Challenge Test, Extraction Test, and Migration Test, all conducted in NABL/ILAC accredited labs. Process requirements ensure the purity and safety of recycled PET, with input meeting minimum quality standards and validation criteria using the challenge test. The level of decontamination must be below 220 µg/kg in the resin or below 10 µg/kg in the food for each surrogate contaminant.</p>\n\n<p>The acceptance criteria for FCM-rPET resin require conformity to specifications, including decontamination levels and validation tests. Food contact materials made from FCM-rPET resin must carry a specific symbol, FCM-rPET-X (X representing the percentage of recycled resin used), and indicate that the packaging material is made with recycled PET.</p>\n\n<p>Manufacturers, converters, beverage bottlers, food packers, and Food Business Operators (FBOs) must maintain and provide documentation, including a Declaration of Compliance, a Regulatory Opinion, and supply chain records. Manufacturers must apply for authorization using Form I, subject to an annual audit, with the FSSAI either authorizing or rejecting applications based on assessment (Form II). Conditions for authorization include the right to inspect records and facilities, compliance with FSSAI criteria, and maintenance of specified documents.</p>\n\n<p>The FSSAI's notification is a significant step towards ensuring the safety and quality of food packaging materials by outlining guidelines for testing, process requirements, acceptance criteria, marking, documentation, and authorization to safeguard public health and promote sustainable practices.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/fssai-recycle-pet-food-contact-material.jpg"
  },
  {
    "title": "India Imposes Ban on Import and Transit of Goods from Pakistan",
    "description": "<p>On May 2, 2025, India's Directorate General of Foreign Trade (DGFT), under the Ministry of Commerce and Industry, issued Notification 06/2025-26, effectively banning the import and transit of all goods originating in or exported from Pakistan. This action, taken under the Foreign Trade Policy (FTP) 2023 through the insertion of Paragraph 2.20A, is aimed at safeguarding national security and public policy.</p>\n\n<p>The legal basis for the ban is rooted in Section 3 read with Section 5 of the Foreign Trade (Development & Regulation) Act, 1992, as well as Paragraphs 1.02 and 2.01 of the FTP 2023. These provisions grant the Central Government the authority to regulate trade activities that could pose a threat to national interests. The prohibition covers all goods, regardless of existing trade regulations.</p>\n\n<p>While the ban is comprehensive, the notification allows for potential exceptions with prior approval from the Government of India. This measure reflects a significant shift in India-Pakistan trade relations and is likely to impact businesses and industries dependent on imports from Pakistan, potentially leading to a re-evaluation of trade policies. The ban remains in effect until further notice, underscoring the government's commitment to national security and public policy.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/india-ban-import-transit-goods-pakistan.jpg"
  },
  {
    "title": "High Court of Punjab and Haryana: Proportionality in Punishment is Key in Disciplinary Actions",
    "description": "<p>The High Court of Punjab and Haryana has reduced the punishment of a police officer penalized for a single day's absence, underscoring the importance of proportionality in disciplinary actions. The case, *Satyaveer Singh vs State of Haryana and others*, highlights the court's commitment to ensuring punishments are commensurate with the offenses committed.</p>\n\n<p>Satyaveer Singh, a Constable in the Haryana Police Force, was initially dismissed for being absent from duty for 24 hours and 20 minutes. This dismissal was later reduced to forfeiture of 10 annual increments. Singh then challenged this decision, arguing the punishment was disproportionate. The respondent argued that being part of a disciplined force, Singh was expected to maintain high standards.</p>\n\n<p>The High Court, referencing Rule 16.2 of the Punjab Police Rules, 1934, and Supreme Court judgments like *Om Kumar v. Union of India* and *Bhagat Ram v. State of Himachal Pradesh*, emphasized the principle of proportionality and its basis in Article 14 of the Constitution of India. It concluded that forfeiting 10 annual increments for a single day's absence was excessive. To avoid further litigation, the court reduced the punishment to forfeiture of one increment with cumulative effect, emphasizing the need for proportionate punishments.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/high-court-of-punjab-and-haryana-proportionality-in-punishment-is-key-in-disciplinary-actions.jpg"
  },
  {
    "title": "Karnataka Enacts Groundbreaking Ordinance For Gig Worker Welfare",
    "description": "<p>The Government of Karnataka has introduced the Karnataka Platform Based Gig Workers (Social Security and Welfare) Ordinance, 2025, a pioneering policy initiative designed to protect the rights and welfare of gig workers within the state's growing gig economy. This ordinance establishes a legal framework that defines the obligations of aggregators and digital platforms, ensuring the provision of social security and welfare benefits for gig workers.</p>\n\n<p>The ordinance applies to all aggregators and platforms operating in Karnataka that offer services listed in the Schedule. It provides a legal basis for social security, occupational health and safety, transparency in automated monitoring systems, and effective dispute resolution mechanisms. A \"gig worker\" is defined as an individual performing work based on a contract with a specified rate of payment, typically through a digital platform. Platforms are digital arrangements that assign tasks, while aggregators are digital intermediaries. A welfare fee, ranging from 1% to 5% of a worker's payout, will be levied on platforms to fund these entitlements.</p>\n\n<p>To administer the ordinance, a dedicated Karnataka Platform Based Gig Workers Welfare Board will be established, comprising government officials, worker and aggregator representatives, civil society members, and technical experts. This statutory body, headquartered in Bengaluru, will have the power to acquire assets, enter into contracts, and initiate legal action. Platforms are required to register with the Board, provide fair contracts, and ensure transparency in algorithmic management.</p>\n\n<p>A Karnataka Gig Workers Social Security and Welfare Fund will be created, financed by welfare fees, voluntary contributions, government grants, and other permitted sources. Financial transactions will be audited annually, and a Payment and Welfare Fee Verification System (PWFVS) will monitor payouts. Non-compliance will result in penalties, and the State Government is authorized to issue rules for enforcement.</p>\n\n<p>This ordinance marks a significant development in India's digital economy, establishing a comprehensive legal framework to protect gig workers' rights, regulate platform responsibilities, and ensure access to social security. By recognizing gig workers as a distinct labor category entitled to social protection, Karnataka sets a national precedent and establishes a model for other states and the central government.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/karnataka-groundbreaking-gig-worker.jpg"
  },
  {
    "title": "CDSCO Clarifies Permissions for Overprinting, Stickering, and Stamping of Imported Drugs",
    "description": "<p>The Central Drugs Standard Control Organization (CDSCO), under the Directorate General of Health Services, issued an Office Memorandum on May 26, 2025, to clarify comprehensive permission for importing drugs for labelling, overprinting, and stickering under Rule 104A of the Drugs and Cosmetics Rules, 1945. This clarification builds upon a previous directive from January 29, 2020, and addresses specific requirements for these activities.</p>\n\n<p>Rule 104A generally prohibits alterations to drug labels, but allows for exceptions with Licensing Authority permission. The memorandum specifies conditions for permissible alterations, especially for imported drugs. The key provision outlines that labelling, overprinting, or stickering is allowed only for imported drugs, and importers must possess a valid manufacturing license to undertake these activities.</p>\n\n<p>Licensees are required to have adequate storage, ancillary areas, and labelling facilities. They must also appoint at least one qualified manufacturing and QA personnel, as determined by the State Licensing Authority (SLA). While a QC laboratory and personnel may not be mandatory, qualified personnel must ensure adherence to regulatory standards. The labelling process must comply with existing Drugs and Cosmetics Rules, ensuring the original label remains visible and the License number and activity performed are clearly indicated. For instance, drugs intended for CGHS supply should be labelled with \"CGHS Supply Overprint\" to clearly denote their intended use.</p>\n\n<p>In conclusion, the CDSCO's memorandum provides essential guidance on importing drugs for labelling and overprinting under Rule 104A. It specifies requirements for importers, facilities, personnel, and compliance, ensuring regulatory adherence while facilitating the import of necessary drugs.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/cdsco-104a-drugs-cosmetics-rules-1945.jpg"
  },
  {
    "title": "Navigating the Roadmap for DPDP Compliance: What Companies Need to Start On",
    "description": "<p>The impending Digital Personal Data Protection (DPDP) Rules 2025 in India necessitate that organizations proactively adapt their data governance to comply and demonstrate a commitment to data protection. This shift can foster customer trust and differentiate businesses in a privacy-conscious market. The DPDP Act emphasizes key principles such as accountability, transparency, data minimization, and proactive risk management, requiring a reevaluation of existing strategies.</p>\n\n<p>To prepare for compliance, organizations should begin by performing a gap assessment of their current data handling practices against the DPDP Act requirements. This includes determining applicability and specific obligations as data fiduciaries or processors. Priority should be given to tasks with external implications, such as implementing compliant consent management, ensuring clear communication with data principals, and retaining consent logs.</p>\n\n<p>Enhancing data security through advanced data governance measures is also crucial. This includes implementing encryption, access controls, and regular security audits. Furthermore, internal tasks such as data mapping, establishing data lifecycle management practices, and appointing a Data Protection Officer (DPO) are essential for comprehensive compliance. Significant Data Fiduciaries (SDFs) will also need to conduct Data Protection Impact Assessments (DPIAs) and audits.</p>\n\n<p>Additional strategic recommendations include establishing a robust incident response plan with assigned roles and periodic simulations, developing customizable breach notification templates, fostering cross-departmental collaboration and staff training, and strengthening data security infrastructure through state-of-the-art verification technologies. By taking these steps, organizations can proactively address compliance requirements, mitigate data privacy risks, and foster trust in the digital economy.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/dpdp-compliance-companies-need-start-on.jpg"
  },
  {
    "title": "CCPA Issues New Guidelines for E-Commerce Sale of Radio Equipment",
    "description": "<p>The Central Consumer Protection Authority (CCPA) has introduced \"Guidelines for the Prevention and Regulation of Illegal Listing and Sale of Radio Equipment including Walkie-Talkies on E-Commerce Platforms, 2025,\" under Section 18 of the Consumer Protection Act, 2019. These guidelines aim to regulate the sale of radio equipment, including walkie-talkies, on e-commerce platforms to ensure compliance with national telecommunications and security standards. They apply to all e-commerce platforms catering to Indian consumers, as well as manufacturers, importers, and sellers of radio equipment, defining key terms like \"Radio Equipment\" and \"Unauthorized Devices.\"</p>\n\n<p>The guidelines mandate that no radio equipment requiring frequency assignment from the Department of Telecommunications (DOT) can be listed or sold unless purchased from an authorized dealer. Platforms are prohibited from listing mobile signal boosters and wireless jammers. Product listings must specify frequency ranges, technical parameters, and regulatory approval proof like Equipment Type Approval (ETA). Platforms must implement automated scanning systems to detect non-compliant listings and provide a user-friendly reporting mechanism for the public.</p>\n\n<p>E-commerce platforms must ensure sellers certify the authenticity of test reports and remove non-compliant listings within 24 hours of receiving directions from the Department of Consumer Affairs (DoCA) or DOT. They are also required to cooperate with regulators for real-time takedowns, enforcement actions, and submit regular audits and compliance reports. Non-compliance can lead to penalties under the Consumer Protection Act, 2019, and other applicable laws, including blacklisting of sellers and platform liability.</p>\n\n<p>The guidelines also emphasize collaboration with regulatory authorities for enforcement actions and public awareness. Platforms must display notices about the risks of purchasing unauthorized devices and educate users on frequency compliance to promote informed consumer behavior. These measures aim to protect consumers, maintain security standards, and ensure adherence to legal and technical standards.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/ccpa-radio-equipment-ecommerce-platform.jpg"
  },
  {
    "title": "FSSAI Advisory: Discontinuation of the Term “100%” on Food Product Labels and Promotional Materials",
    "description": "<p>The Food Safety and Standards Authority of India (FSSAI) issued an advisory on May 28, 2025, addressing the potentially misleading use of the term “100%” on food product labels and promotional materials. The FSSAI has observed an increase in the use of this term, which, although seemingly straightforward, is ambiguous and can convey a false sense of absolute purity or superiority, potentially misleading consumers.</p>\n\n<p>Issued under the authority of the Food Safety and Standards Act, 2006, and referencing the Food Safety and Standards (Advertising and Claims) Regulations, 2018, the advisory highlights that claims must be truthful, unambiguous, and not misleading. Sub-regulation 10(7) of these regulations strictly prohibits any advertisement or claim that undermines other manufacturers or influences consumer perception in a misleading manner.</p>\n\n<p>The advisory directs all Food Business Operators (FBOs) to discontinue the use of the term “100%” on food product labels, packaging, and promotional content, whether used alone or with other descriptors. The FSSAI emphasizes that the term is undefined in the FSS Act, 2006, or its related regulations, and its use can lead to consumer confusion and misinterpretation. This measure is intended to prevent misleading claims, ensure transparency and accuracy in marketing practices, and maintain high standards of food safety and consumer protection within the food industry.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/discontinuation-100-food-product-labels.jpg"
  },
  {
    "title": "Delhi High Court Terminates Arbitrator's Mandate Due to Unexplained Delay",
    "description": "<p>The Delhi High Court has terminated the mandate of a sole arbitrator in the case of *Great Eastern Energy Corporation Limited vs Sopan Projects*, citing an unacceptable delay of over eight years in delivering the arbitral award. This decision underscores the judiciary's dedication to the timely resolution of disputes through arbitration, as mandated by the Arbitration and Conciliation Act, 1996.</p>\n\n<p>The case originated from a 2010 Work Order between Great Eastern Energy Corporation Limited (Petitioner) and Sopan Projects (Respondent) for the construction of an underground MDPE pipeline. Disputes arose when the Respondent allegedly abandoned the project before completion, leading to the invocation of arbitration in October 2015. A sole arbitrator was nominated, and final arguments concluded in March 2020. However, with no award issued after three years, the Petitioner sought termination of the arbitrator's mandate under Section 14 of the Arbitration and Conciliation Act, 1996.</p>\n\n<p>The Petitioner argued that the delay contravened public policy, while the Respondent contended that unpaid fees and periods covered by a Supreme Court order justified the delay. The Respondent also claimed the Petitioner did not attempt to follow up with the arbitrator.</p>\n\n<p>The Delhi High Court, referencing Section 14 of the Arbitration and Conciliation Act, 1996, and previous Supreme Court rulings, emphasized the importance of expeditious arbitration proceedings. The court concluded that the arbitrator's unexplained three-year delay warranted termination of their mandate, reinforcing the necessity for efficient dispute resolution in accordance with the Arbitration and Conciliation Act, 1996.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/delhi-hc-terminate-arbitrators-mandate-delay.jpg"
  },
  {
    "title": "Environmental Impact of Pharmaceutical Waste: A Review of The Recent Guidance Document On Disposal Of Expired/ Unused Drugs Issued By CDSCO",
    "description": "<p>The Director General of Health Services, CDSCO, issued a guidance document on May 26, 2025, providing detailed instructions for the safe and responsible disposal of expired and unused medicines. Prompted by concerns raised by researchers and discussions within the Drugs Consultative Committee (DCC), the document aims to mitigate ecological and public health risks associated with improper pharmaceutical waste management.</p>\n\n<p>The guidance document addresses the severe consequences of improper disposal, including water contamination, potential misuse of expired drugs, and the emergence of adverse drug reactions. Its primary objective is to provide clear instructions for the safe disposal of expired and unused drugs, aligning with the Drugs and Cosmetics Act and Rules while minimizing environmental impact, especially in relation to antimicrobial resistance (AMR).</p>\n\n<p>The document outlines several disposal methods, including landfill in engineered sites, waste immobilization via encapsulation and inertization, and sewer disposal for certain liquid pharmaceuticals. It discourages open burning and recommends medium to high-temperature incineration for specific waste types, with chemical decomposition as an alternative when incineration is not feasible. Existing regulations for imported drugs, retail/wholesale outlets, and manufacturing waste are referenced, aligning with the Bio-Medical Waste (Management and Handling) Rules, 2016.</p>\n\n<p>The guidance document details the procedures for various stakeholders, including retailers, wholesalers, manufacturers, hospitals, and government agencies, emphasizing the return of expired/unused drugs to manufacturers or proper disposal according to the outlined guidelines. It also specifies requirements for maintaining detailed records for regulatory verification and the handling and transportation of expired/unused drugs, including cytotoxic, radioactive, and controlled substances, using yellow non-chlorinated plastic bags or containers.</p>\n\n<p>For the general public, the document suggests establishing \"Drug take back\" sites and provides guidance on medicines that can be flushed down the sink or toilet to prevent accidental ingestion and misuse, aiming to minimize risks to people and pets. Adherence to these guidelines is essential for all stakeholders to protect human health and the environment by significantly reducing the environmental impact and public health risks associated with improper disposal practices.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/environment-impact-pharmaceutical-waste.jpg"
  },
  {
    "title": "IBBI Notifies Fourth Amendment Regulations to Insolvency Resolution Process for Corporate Persons",
    "description": "<p>The Insolvency and Bankruptcy Board of India (IBBI) has announced the Fourth Amendment Regulations to the Insolvency Resolution Process for Corporate Persons, effective May 26, 2025. These amendments aim to enhance the efficiency, transparency, and fairness of the corporate insolvency resolution process, aligning with the goals of the Insolvency and Bankruptcy Code, 2016 (IBC).</p>\n\n<p>Key changes include the insertion of a new sub-regulation allowing the committee of creditors to invite interim finance providers as observers to meetings, fostering better financial management. Furthermore, resolution professionals, with committee approval, can now solicit expressions of interest for resolution plans covering the entire corporate debtor or individual assets, broadening potential solutions.</p>\n\n<p>Additional amendments focus on creditor equity and regulatory clarity. A new provision ensures financial creditors who did not support the resolution plan receive proportional and prioritized payments. Revisions to Regulation 39 enhance compliance by explicitly including non-compliant plans in the review process, reinforcing adherence to the IBC and its regulations.</p>\n\n<p>Overall, the Fourth Amendment Regulations represent a significant effort by the IBBI to refine the insolvency resolution framework. By increasing flexibility, ensuring fair treatment of creditors, and clarifying regulatory language, these amendments aim to benefit all stakeholders, including corporate debtors, creditors, and the overall economy through a more robust and transparent insolvency resolution process.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/ibbi-fourth-amendment-regulations-2025.jpg"
  },
  {
    "title": "Bail is the Rule, Jail is the Exception — State of Rajasthan v. Balchand alias Baliay (1977)",
    "description": "<p>In <b>State of Rajasthan v. Balchand alias Baliay (1977)</b>, the Supreme Court of India, led by Justice <b>V.R. Krishna Iyer</b>, affirmed the principle that <b>bail is the rule and jail is the exception</b>.</p>\n\n<p>The accused, <b>Balchand alias Baliay</b>, was convicted of housebreaking and theft under <b>Sections 457</b> and <b>380</b> of the <b>Indian Penal Code</b>. During his appeal against the conviction, he was granted interim bail, which the <b>State of Rajasthan</b> challenged on the grounds that a conviction extinguishes the presumption of innocence.</p>\n\n<p>The Court considered whether a conviction automatically deprives an accused of the right to bail pending appeal, and how to balance <b>societal security</b> with an individual’s <b>fundamental liberty</b>. The prosecution contended that conviction nullifies the presumption of innocence and mandates bail cancellation, while the defense argued that the appeal process is an extension of the trial and preserves the accused’s right to liberty until final judgment.</p>\n\n<p>Justice Krishna Iyer’s judgment emphasized that the <b>presumption of innocence</b> endures until all appellate remedies are exhausted. He underscored that under <b>Article 21</b> of the Constitution, personal liberty must be deprived only through a process that is just, fair, and reasonable. The Court held that “<b>bail is the rule</b>” and that bail may be denied only in exceptional circumstances such as flight risk, tampering with evidence, or threat to public order. It ruled that bail cannot be revoked automatically upon conviction, but must be assessed on a case-by-case basis, ensuring the justice system protects both liberty and public interest.</p>\n\n<p>This ruling established the foundation of modern <b>bail jurisprudence</b> in India, affirming that even a convicted person retains dignity and the right to judicial review. It has guided subsequent judgments to resist mechanical denials of bail and reinforced that restrictions on liberty must be grounded in substantial reasons.</p>\n\n<p>In simple terms, the decision balances <b>personal freedom</b> and <b>public safety</b>, favoring release unless compelling reasons demand custody. As Justice Krishna Iyer eloquently stated: “<b>Bail is the rule and jail is the exception.</b>”</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/Bail is the Rule, Jail is the Exception.jpg"
  },
  {
    "title": "Commander K.M. Nanavati vs. State of Maharashtra (1959) — A Landmark Case in Indian Legal History",
    "description": "<p>The case of <b>Commander K.M. Nanavati v. State of Maharashtra</b> (1959) remains one of the most significant criminal trials in Indian jurisprudence, fundamentally altering perceptions of jury trials and the defense of provocation.</p>\n\n<p>Commander Kawas Manekshaw Nanavati, a distinguished officer of the Indian Navy, lived in Mumbai with his wife Sylvia and their children. When Sylvia’s extramarital affair with Prem Ahuja, a wealthy businessman, came to light, Nanavati confronted them. In an emotionally charged encounter, he took his service revolver and went to Prem Ahuja’s residence, where he fatally shot him.</p>\n\n<p>Key legal questions arose: whether Nanavati’s act amounted to murder under <b>Section 302 of the Indian Penal Code (IPC)</b>, and whether it could be reduced to culpable homicide not amounting to murder under <b>Exception 1 to Section 300 IPC</b> for grave and sudden provocation.</p>\n\n<p>At the Bombay Sessions Court, a jury trial returned a “Not Guilty” verdict by 8:1. The Sessions Judge, deeming the jury’s decision perverse and influenced by media sympathy, referred the case to the Bombay High Court under <b>Section 307 of the Code of Criminal Procedure</b>. The High Court reversed the jury’s verdict, finding Nanavati guilty of murder—a conviction later upheld by the Supreme Court of India.</p>\n\n<p>The courts examined whether provocation was truly sudden and overwhelming. Finding that Nanavati had time to plan—retrieving his revolver and traveling to Ahuja’s home—the defense of sudden provocation was rejected. The case also exposed media influence on juries, leading to the abolition of jury trials in Indian criminal law during the 1960s.</p>\n\n<p>Nanavati served his sentence but was subsequently pardoned by the Governor of Maharashtra after significant public and political support. His story inspired numerous films, books, and debates, most famously the Bollywood movie <b>Rustom</b>.</p>\n\n<p>The <b>Nanavati case</b> stands as a milestone in Indian criminal law, clarifying the limits of the provocation defense, highlighting the vulnerabilities of jury-based trials, and prompting the end of the jury system in India.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/Commander K.M. Nanavati vs. State of Maharashtra (1959).jpg"
  },
  {
    "title": "Cheque Bounce Recovery in India: Your Legal Options Explained",
    "description": "<p>In India, a <b>cheque bounce</b>, technically known as <b>dishonor of cheque</b>, is a criminal offense punishable under Section 138 of the <b>Negotiable Instruments Act, 1881</b>. This happens when a bank refuses to honor a cheque due to insufficient funds in the drawer's account, or for other reasons like signature mismatch. For an ordinary citizen, receiving a bounced cheque can be a frustrating experience, but it's crucial to understand the legal options available to recover the owed amount.</p>\n\n<p>The process for <b>cheque bounce recovery</b> begins with sending a legal notice to the issuer of the cheque. This notice must be sent within 30 days from the date the bank informs you about the dishonor of the cheque. The notice should demand payment of the cheque amount within 15 days. If the issuer fails to make the payment within this period, you have the right to file a criminal complaint in the court of a Metropolitan Magistrate or a Judicial Magistrate of the First Class, within one month from the date of expiry of the 15-day notice period. This initiates legal proceedings under Section 138 of the <b>Negotiable Instruments Act</b>.</p>\n\n<p>A critical aspect of the <b>Section 138</b> case is establishing that the debt or liability exists. The onus is on the complainant to prove that the cheque was issued in discharge of a legally enforceable debt or other liability. The drawer of the cheque has the opportunity to defend themselves, and the court will consider both sides before delivering a judgment. If the court finds the accused guilty, they can be sentenced to imprisonment for a term which may extend to two years, or with a fine which may extend to twice the amount of the cheque, or with both.</p>\n\n<p>Beyond the criminal proceedings under Section 138, it's also possible to initiate a civil suit for recovery of money. While the criminal case aims to penalize the defaulter, a civil suit aims to recover the outstanding amount along with interest and other costs. Filing a civil suit doesn't preclude initiating criminal proceedings, and both can proceed simultaneously. The legal recourse available to an individual who receives a <b>bounced cheque</b> provides substantial protection, ensuring that financial transactions are honored and that remedies are available when defaults occur.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/Cheque-Bounce-Recovery-in-India-Your-Legal-Options-Explained.jpg"
  },
  {
    "title": "Indian Landlord Rights: Eviction Rules You Need to Know",
    "description": "<p>In India, landlords have specific rights when it comes to evicting a tenant, governed primarily by the respective state's <b>Rent Control Act</b>. These Acts vary across states, but generally, a landlord cannot evict a tenant at will. A valid and legal ground for eviction must exist, such as non-payment of rent, causing nuisance, subletting without permission, or using the property for illegal activities. It's crucial for landlords to understand the specific provisions of the Rent Control Act applicable in their state to ensure any eviction process complies with the law.</p>\n\n<p>The process of eviction typically involves serving a legal notice to the tenant, clearly stating the reason for eviction and giving them a reasonable timeframe to vacate the premises. If the tenant fails to comply, the landlord can then file an eviction suit in the appropriate court. The court will then hear both sides of the argument, examining the evidence presented by both the landlord and the tenant. The burden of proof usually lies with the landlord to demonstrate that a valid ground for eviction exists under the relevant <b>Rent Control Act</b>. Landlords must keep accurate records of rent payments, communication with the tenant, and any violations of the rental agreement to support their case.</p>\n\n<p>It's important to note that even with a valid reason for eviction, a landlord cannot use force or illegal means to evict a tenant. Such actions can result in legal repercussions for the landlord, including penalties and damages. The eviction process must be carried out through the court, obtaining a court order for eviction if necessary. The Supreme Court has repeatedly emphasized the importance of following due process of law in eviction matters. For example, the landmark case of *Raghunath G. Panhale (Dead) By Lrs. v. M/S. Chaganlal Sundarji And Co* highlighted the need for strict adherence to procedural laws in eviction proceedings.</p>\n\n<p>For ordinary citizens who are landlords, understanding these <b>eviction rules</b> is crucial for protecting their property rights while also acting within the bounds of the law. Seeking legal advice from a lawyer specializing in property law is highly recommended before initiating any eviction proceedings. This ensures compliance with the state's specific Rent Control Act and minimizes the risk of legal complications. Moreover, familiarizing oneself with relevant case laws can provide a better understanding of how courts interpret and apply these laws in practice. Remember that a fair and legal eviction process protects both the landlord's rights and the tenant's rights, promoting a more equitable rental relationship.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/Indian-Landlord-Rights-Eviction-Rules-You-Need-to-Know.jpg"
  },
  {
    "title": "Online Fraud Refund: Your Rights Under Indian Law",
    "description": "<p>If you've fallen victim to <b>online fraud</b> in India, knowing your rights concerning a <b>refund</b> is crucial. Indian law provides avenues for recovering lost funds, though the process can sometimes be complex. The primary legislation governing such issues is the <b>Information Technology Act, 2000</b>, which addresses cybercrimes and provides a framework for holding fraudsters accountable. Banks and payment service providers also have a responsibility to ensure secure transactions, and their negligence can lead to liability.</p>\n\n<p>The liability of banks in cases of <b>unauthorized electronic transactions</b> is often governed by the Reserve Bank of India (RBI) guidelines. These guidelines typically differentiate liability based on customer reporting timelines. If the customer reports the fraudulent transaction promptly (usually within 3 days), the liability is often limited or even zero. Delay in reporting can increase the customer's potential liability. Banks are required to have a robust dispute resolution mechanism to handle customer complaints regarding fraudulent transactions and provide a refund, if warranted. It is important to document all communications with the bank and file a formal complaint with evidence of the <b>fraudulent transaction</b>.</p>\n\n<p>Beyond banking regulations, Section 43 of the <b>IT Act</b> deals with compensation for damages caused to computer systems and networks due to unauthorized access or disruption. While it may not directly guarantee a <b>refund</b>, it allows for claiming damages. Furthermore, depending on the nature of the <b>online fraud</b>, the Indian Penal Code (IPC) provisions related to cheating, forgery, and criminal breach of trust can also be invoked. Registering a First Information Report (FIR) with the police is a crucial step in initiating a criminal investigation and strengthens your case for seeking legal remedies.</p>\n\n<p>For ordinary citizens, the practical implication is to be vigilant and proactive. Immediately report any <b>online fraud</b> to your bank and the cybercrime cell. Keep records of all transactions and communication. File a police complaint to initiate formal investigation. Familiarizing yourself with RBI guidelines on limiting liability in fraudulent transactions can greatly help navigate the process of claiming a <b>refund</b>. Remember, acting quickly and diligently is essential to maximizing your chances of recovering your funds.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/Online-Fraud-Refund-Your-Rights-Under-Indian-Law.jpg"
  },
  {
    "title": "Live-in Relationships in India: Know Your Legal Rights",
    "description": "<p>In India, a <b>live-in relationship</b> refers to an arrangement where two individuals choose to cohabit and share their lives together without being legally married. This form of relationship has gained increasing social acceptance, and the Indian legal system has gradually recognized certain rights and protections for couples in such arrangements. However, it's crucial to understand that live-in relationships don't automatically grant the same rights as a marriage. Proof of a relationship resembling marriage, including factors like duration, shared household, pooling of resources, and intent to marry, is often essential for claiming legal entitlements.</p>\n\n<p>Several landmark court judgments have shaped the legal landscape surrounding live-in relationships. The Supreme Court, in cases like D. Patchaiammal v. D. Velusamy, has laid down guidelines for determining the validity and nature of a live-in relationship. To be considered a valid relationship warranting legal protection, the couple must hold themselves out to society as being akin to spouses. Importantly, not all cohabitation qualifies as a live-in relationship entitled to legal rights. The court has emphasized the necessity of a long-standing and genuine relationship similar to marriage. These judicial pronouncements primarily aim to prevent exploitation and protect vulnerable partners within such arrangements.</p>\n\n<p>The legal implications for women in <b>live-in relationships</b> are particularly significant. While not explicitly covered under the Hindu Marriage Act, certain legislations like the Protection of Women from Domestic Violence Act, 2005, provide some recourse. This Act recognizes women in live-in relationships as being in a relationship \"in the nature of marriage,\" thereby entitling them to protection from domestic violence, including physical, emotional, and economic abuse. They can seek remedies such as residence orders, monetary relief, and protection orders under this Act. Further, children born out of live-in relationships are considered legitimate and have inheritance rights in their parents’ property, as established by various court decisions.</p>\n\n<p>It’s important to note that establishing legal rights within a <b>live-in relationship</b> can often be challenging. Unlike a formal marriage certificate, there's no single document that automatically proves the existence of the relationship or its nature. Individuals need to gather evidence, such as joint bank accounts, utility bills with both names, photographs, and testimonies of friends and family, to demonstrate the validity and characteristics of their relationship to the court. Seeking legal advice from a qualified lawyer is highly recommended for individuals in live-in relationships to understand their rights and obligations and to navigate the legal complexities effectively. This is especially crucial in cases involving property disputes, maintenance claims, or inheritance matters.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/Live-in-Relationships-in-India-Know-Your-Legal-Rights.jpg"
  },
  {
    "title": "Supreme Court Imposes Year-Long Firecracker Ban in Delhi-NCR",
    "description": "<p>The Supreme Court has imposed a comprehensive, year-long ban on the use, manufacture, sale, and storage of firecrackers in the Delhi-National Capital Region (NCR). This decision extends beyond the previous 3-4 month restrictions, aiming to address the region's persistent air quality issues.</p><p>The Court emphasized that the prevailing air pollution levels in Delhi-NCR necessitate stringent measures. Consequently, no exceptions will be made, including for 'green crackers,' which are only marginally less polluting than traditional ones. The ban also encompasses online sales of firecrackers.</p><p>In its ruling, the Court underscored the fundamental right to health under Article 21 of the Constitution, highlighting the adverse effects of air pollution on citizens' well-being. The bench stated that no religious practices advocate for activities that harm the environment or public health.</p><p>This landmark judgment reflects the judiciary's commitment to ensuring a cleaner environment and safeguarding public health in the face of escalating pollution concerns in the capital region.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/Supreme%20Court%20Imposes%20Year-Long%20Firecracker%20Ban%20in%20Delhi-NCR.jpg"
  },
  {
    "title": "Supreme Court Affirms State Commissions' Authority Over Inter-State Power Supply Affecting State Grids",
    "description": "<p>The Supreme Court has clarified that State Electricity Regulatory Commissions (SERCs) retain the authority to regulate open access to electricity transmission within their states, even when it involves inter-state power supply, if such transactions impact the state's grid.</p><p>While the Central Electricity Regulatory Commission (CERC) oversees inter-state electricity transmission under Section 79(1)(c) of the Electricity Act, 2003, this does not preclude SERCs from exercising jurisdiction over intra-state aspects of open access. Specifically, Section 42(2) empowers SERCs to ensure fair and non-discriminatory access to transmission and distribution networks within their respective states.</p><p>This ruling underscores the collaborative regulatory framework envisioned by the Electricity Act, 2003, balancing the roles of both central and state commissions in managing the nation's electricity infrastructure.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/Supreme-Court-Affirms-State-Commissions-Authority-Over-Inter-State-Power-Supply-Affecting-State-Grid.jpg"
  },
  {
    "title": "Supreme Court: S-138 NI Act Complainant Not Required to Prove Financial Capacity at Threshold",
    "description": "<p>The Supreme Court has clarified that under Section 138 of the Negotiable Instruments Act, a complainant is not required to prove their financial capacity at the initial stage of the proceedings. This decision emphasizes that the focus should be on the alleged offense rather than the economic standing of the complainant.</p><p>In its ruling, the Court noted that the procedural threshold is meant to ensure that valid complaints are heard without undue burden on the complainant, thereby upholding the principles of accessible justice. This approach reinforces the idea that the legitimacy of the complaint does not hinge on the complainant’s ability to demonstrate financial robustness.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/Supreme-Court-S-138-NI-Act-Complainant-Not-Required-to-Prove-Financial-Capacity-at-Threshold.jpg"
  },
  {
    "title": "Supreme Court Upholds Cancellation of 25,753 West Bengal SSC Appointments",
    "description": "<p>The Supreme Court has upheld the Calcutta High Court's decision to invalidate approximately 25,753 teaching and non-teaching staff appointments made by the West Bengal School Service Commission (SSC) in 2016.</p><p>The Court found that the selection process was marred by widespread fraud and manipulation, rendering it irreparably tainted. Consequently, the services of the affected candidates are to be terminated, and they are required to refund any salaries received.</p><p>This ruling underscores the judiciary's commitment to maintaining integrity and transparency in public recruitment processes.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/Supreme-Court-Upholds-Cancellation-of-25-753-West-Bengal-SSC-Appointments.jpg"
  },
  {
    "title": "Supreme Court Rejects Partition Suit Filed 45 Years After Property Sale",
    "description": "<p>The Supreme Court recently dismissed a partition suit that was initiated a staggering 45 years after the property's sale deed was registered.</p>  <p>The Court emphasized that the registration of a sale deed serves as a public notice, implying that any party with an interest in the property is presumed to be aware of such transactions from the date of registration. This means that the limitation period for filing claims starts from that moment.</p>  <p>In this particular case, the plaintiffs' prolonged inaction—spanning over four decades—was deemed unacceptable. The Court reiterated that, according to the law, any claims or disputes regarding property transactions should be raised within the prescribed limitation period, which, in this context, had long expired.</p>  <p>This ruling serves as a stark reminder of the importance of timely legal action in property disputes and the weight that registered documents carry as public notices.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/Supreme-Court-Rejects-Partition-Suit-Filed-45-Years-After-Property-Sale.jpg"
  }
]