[
  {
    "title": "Bombay High Court Upholds Mother’s Right To Custody After Father’s Death",
    "description": "<p>The Bombay High Court, Aurangabad Bench, in *Parvati Swati v. Vyankat & Anr.*, reaffirmed a mother's right to custody following the father's death, emphasizing the paramount importance of the child's welfare under the Hindu Minority and Guardianship Act, 1956. The ruling underscores that while grandparents can provide love, the mother, as the natural guardian, holds the inherent right and responsibility unless proven unfit.</p>\n\n<p>The case arose after the father's death, where the paternal grandparents sought guardianship of the minor child, whose custody had been granted to the father in a prior divorce decree. The mother filed a counter-application seeking custody, which was initially rejected. The High Court addressed whether the grandparents could claim custody in preference to the mother, citing Section 6(a) of the Act, which favors the mother as the natural guardian after the father's death, especially for children below five.</p>\n\n<p>The Court considered arguments from both sides, including the mother's improved financial stability and the child's established relationship with the grandparents. Justice Chapalgaonkar, reiterating the child's welfare as paramount, ruled in favor of the mother, citing precedents that a natural parent's custody should only be denied if they are demonstrably unfit. The Court granted custody to the mother while providing visitation rights to the grandparents, balancing the child's legal right to maternal care with the importance of maintaining family bonds. This judgment reaffirms the principle that a mother's care is irreplaceable while emphasizing the need for compassion and justice in guardianship law.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/bombay-hc-upholds-mothers-right-to-child-custody.jpg"
  },
  {
    "title": "RBI's Draft Directions on Lending to Related Parties: A Summary",
    "description": "<p>The Reserve Bank of India (RBI) has released the Draft Reserve Bank of India (Lending to Related Parties) Directions, 2025, seeking public input by October 31, 2025. This draft aims to establish a unified, principle-based framework for transactions between regulated entities (REs) and their related parties, an area of long-standing concern regarding governance and prudential oversight.</p>\n\n<p>Currently, regulations on lending to related parties are fragmented across various regulatory frameworks, leading to potential arbitrage and ambiguity. The new draft directions intend to harmonize governance standards, enhance transparency in related-party exposures, and strengthen market discipline across all REs, including banks, NBFCs, and cooperative banks.</p>\n\n<p>Key provisions include a broad definition of \"related parties\" aligned with Indian Accounting Standards (Ind AS 24), materiality-based thresholds for Board or committee approval of transactions, and a principle-based exemption to Section 20(1)(b) of the Banking Regulation Act, 1949. The draft also mandates comprehensive reporting and disclosure obligations to align with international best practices.</p>\n\n<p>The proposed framework emphasizes ethical governance and conflict of interest management, requiring financial institutions to embed robust governance and risk management practices. Non-compliance may lead to regulatory action and reputational consequences. This initiative, part of broader reforms promoting uniformity and sound corporate governance, follows the Final Co-Lending Framework. The RBI invites stakeholder feedback before finalizing the directions, which will supersede existing circulars.</p>\n\n<p>Ultimately, the Draft Lending to Related Parties Directions, 2025, represent a crucial step toward promoting integrity, transparency, and uniform governance in India's financial system, balancing operational flexibility with prudential discipline to enhance resilience and credibility.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/rbis-draft-lending-rules-redefine-governance-standards.jpg"
  },
  {
    "title": "Allahabad High Court Clarifies Bank Liability in Cases of Alleged Unauthorized Electronic Transactions",
    "description": "<p>The Allahabad High Court, in *Suresh Chandra Singh Negi and Another v. Bank of Baroda and Others*, addressed the liability of banks in cases of alleged unauthorized electronic transactions, specifically when the customer's credentials and devices were used. The court examined the Reserve Bank of India’s 2017 Circular on customer protection and clarified the extent of customer and bank liability in digital banking operations.</p>\n\n<p>The case involved petitioners claiming unauthorized transfers from their accounts despite using internet banking facilities. They argued cyber fraud, citing a blocked SIM card preventing OTP receipt, and relied on the RBI circular mandating banks to restore debited amounts if notified within three days. The Bank of Baroda, however, presented evidence showing the transactions were initiated by the petitioners themselves using their login credentials, registered devices, and OTPs, with a password change following the transfers.</p>\n\n<p>The Allahabad High Court found that the evidence indicated the transactions were carried out by the petitioners, noting the use of their login, OTPs, and the addition of beneficiaries. The court also highlighted the delay in reporting the issue as inconsistent with genuine cyber fraud victims. Analysis of the RBI circular revealed that while the bank bears the burden of proof, the Bank of Baroda successfully demonstrated customer liability. The court also distinguished precedents cited by the petitioners, noting that those cases involved third-party fraud and prompt reporting, unlike the present case.</p>\n\n<p>Ultimately, the court ruled there was no unauthorized withdrawal and dismissed the petition, emphasizing that the RBI circular protects genuine cyber fraud victims, not those attempting to escape consequences of their own negligence. The decision reinforces that digital vigilance is a shared responsibility, and liability cannot be shifted to the bank when transactions are executed using the customer’s own credentials.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/allahabad-hc-clarifies-bank-liability-in-online-frauds.jpg"
  },
  {
    "title": "Driving E-Mobility Forward: India’s Big Move to Localize EV Component Manufacturing",
    "description": "<p>The Ministry of Heavy Industries in India has amended the Phased Manufacturing Programme (PMP) under the PM E-DRIVE Scheme, targeting e-buses and N2 category e-trucks. Published on September 30, 2025, in The Gazette of India, these modifications aim to bolster domestic manufacturing of critical electric vehicle components, specifically the Traction Motor. The amendments introduce aggressive timelines, beginning September 1, 2025, and continuing into 2026, to ensure local production of these vital EV components.</p>\n\n<p>The changes for e-buses primarily focus on upgrading the requirements for the Traction Motor. New mandates are also detailed for N2 category e-trucks, covering both stand-alone Traction Motors and integrated systems.</p>\n\n<p>These amendments reflect a strong push towards deep localization, requiring manufacturers to establish robust domestic supply chains for advanced EV components. By setting mandatory deadlines for local manufacturing of the Traction Motor and its integrated systems, the Ministry of Heavy Industries reinforces its commitment to the ‘Make in India’ initiative within the electric mobility sector.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/india-pushes-local-ev-component-manufacturing-ahead.jpg"
  },
  {
    "title": "Bombay High Court Imposes Exemplary Costs on Auto Credit Corporation for Abusing Process of Law",
    "description": "<p>The Bombay High Court, in *Auto Credit Corporation & Anr. v. Mukesh Bansilal Shah & Ors.*, levied exemplary costs of ₹25,00,000 on Auto Credit Corporation and Rekha Prakash Jain for abusing judicial proceedings and obstructing justice. Justice Kamal Khata's judgment emphasizes the limits of locus standi in testamentary matters and aims to deter manipulation of probate proceedings.</p>\n\n<p>The case stemmed from the applicants' attempt to intervene in a testamentary suit, claiming tenancy rights to a property under the administration of Mr. Ketan Trivedi. They sought to remove the seal on the premises, alleging unauthorized sealing and continuous possession since 1991. The applicants relied on dismissed eviction suits and pending civil revision applications to support their claim.</p>\n\n<p>The Administrator countered that the premises were locked, the applicants lacked valid tenancy proof, and they had tampered with the seal. The Court found the Chamber Summons misconceived, noting that tenancy issues fall under the Small Causes Court's jurisdiction, not the Probate Court. Citing *Dnyandeo Sabaji Naik v. Pradnya Prakash Khadekar*, the Court emphasized the need to prevent misuse of the legal system and imposed exemplary costs to deter frivolous litigation.</p>\n\n<p>The Court dismissed the Chamber Summons, directing payment to the Armed Forces Battle Casualties Welfare Fund and issuing a show-cause notice for contempt proceedings regarding tampering with sealed premises. Failure to pay would result in property attachment. This ruling affirms judicial intolerance toward procedural abuse and underscores the importance of respecting judicial orders and estate administration.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/bombay-hc-fines-litigants-%e2%82%b925l-for-abusing-process.jpg"
  },
  {
    "title": "Consumer Commission Fines Builder for Deficiency in Service, Directs Flat Possession",
    "description": "<p>The Delhi State Consumer Disputes Redressal Commission ruled in favor of homebuyers, holding E-Homes Infrastructure Pvt. Ltd. guilty of deficiency in service for demanding additional, unjustified payments for Service Tax and GST and wrongfully canceling a flat allotment of Mr. Rajeev Menon and others. The Commission directed the builder to hand over possession of the flat within two months and provide compensation for mental agony and litigation expenses.</p>\n\n<p>The case originated when the complainants, having paid 95% of the total sale consideration for a flat in “The Jewel of Noida,” received a demand for an additional ₹15,25,120 towards Service Tax and GST, which was not indicated in the original agreement. When they objected, the builder canceled the allotment. The Commission examined whether the complainants were consumers and whether the builder's actions constituted a deficiency in service.</p>\n\n<p>The Commission determined that the complainants were indeed consumers, as the builder failed to prove any commercial intent behind their purchase. It also found the builder's demand for additional taxes to be without legal or contractual basis, constituting a deficiency in service and an unfair trade practice. The order reaffirms that builders cannot impose arbitrary financial demands retroactively, especially when not stipulated in the initial agreement and that contractual terms must be upheld in fairness to the buyer.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/delhi-consumer-commission-orders-flat-possession-fines-builder.jpg"
  },
  {
    "title": "Understanding TRAI’s UCC Rules: Compliance Insights For Corporates",
    "description": "<p>The National Commodity Clearing Limited (NCCL) has issued a circular directing members to comply with the amended Telecom Commercial Communications Customer Preference Regulations (TCCCPR), 2018, issued by the Telecom Regulatory Authority of India (TRAI). This underscores the importance of protecting consumers from Unsolicited Commercial Communications (UCC) and the responsibilities of corporations in managing mass communications.</p>\n\n<p>The TCCCPR, grounded in the Telecom Regulatory Authority of India Act, 1997, aims to regulate commercial communications and empower consumers to control the messages they receive. Recent amendments prohibit the use of standard 10-digit mobile numbers for commercial communications, mandating the use of designated 1600-series numbers for transactional and service-related messages to enhance traceability and oversight.</p>\n\n<p>NCCL's circular emphasizes the need for corporates to whitelist URLs, mobile applications, and digital assets used in communications, as well as ensuring that SIP/PRI connections comply with TCCCPR standards. Cooperation with the Indian Cybercrime Coordination Centre (I4C) and TRAI is also crucial, requiring companies to report and respond to advisories, integrating cybersecurity, consumer protection, and regulatory compliance.</p>\n\n<p>Non-compliance can lead to monetary penalties, blocked communication channels, and restrictions on services, as well as potential liabilities under the Information Technology Act, 2000, related to unauthorized access and cyber fraud. Reputational risks and loss of customer trust are also significant concerns. Therefore, corporate legal and compliance teams must integrate TCCCPR compliance into standard operating procedures, including regular audits, whitelisting tools, adherence to 1600-series numbers, and comprehensive staff training.</p>\n\n<p>The NCCL circular indicates a broader regulatory trend in India towards stricter consumer protection and digital security in corporate communications. By proactively aligning systems with TRAI's amendments, businesses can mitigate legal and operational risks, while strengthening consumer trust. Compliance must be a core component of operational strategy to protect consumers, uphold corporate integrity, and avoid regulatory and reputational fallout.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/trai-tightens-ucc-rules-compliance-mandate-for-corporates.jpg"
  },
  {
    "title": "Unravelling the Conflict: Insolvency Proceedings and Dishonoured Cheques",
    "description": "<p>This case summary details a criminal writ petition filed by Ortho Relief Hospital and Research Centre against M/s. Anand Distilleries and its Directors, following the dishonoring of a cheque issued as security for a loan. The hospital had extended a loan to the company, receiving a post-dated cheque as security. After periodic interest payments ceased, the hospital learned of insolvency proceedings initiated against M/s. Anand Distilleries under the Insolvency and Bankruptcy Code, 2016 (IB Code).</p>\n\n<p>Despite the insolvency proceedings, the respondents requested that the cheque be presented, which was subsequently dishonored due to insufficient funds. A legal notice was issued, followed by a complaint under Section 138 of the Negotiable Instruments Act, 1881 (NI Act), and Sections 406 and 420 of the Indian Penal Code. The trial court discharged the respondents from the Section 138 NI Act offense, citing the ongoing insolvency proceedings, leading to the hospital challenging this discharge order in the Bombay High Court.</p>\n\n<p>The central issue before the High Court was whether the initiation of insolvency proceedings under the IB Code prior to the filing of a complaint under Section 138 of the NI Act nullifies the latter proceedings. The Bombay High Court, referencing relevant Supreme Court judgments, ruled that the trial court had erred in discharging the respondents. The court emphasized that the moratorium for corporate debtors under the IB Code does not extend to the personal criminal liability of directors and individuals under the NI Act. Consequently, the High Court allowed the Criminal Writ Petition, quashing the trial court's orders and reinstating the complaint, reinforcing the principle that personal penal liability persists despite corporate insolvency proceedings.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/insolvency-vs-cheque-bounce-bombay-hc-clarifies-liability.jpg"
  },
  {
    "title": "Foreign Currency Settlement System Framework Notified by IFSCA for GIFT IFSC",
    "description": "<p>On October 3, 2025, the International Financial Services Centres Authority (IFSCA) formalized the rules, bye-laws, and regulations for the Foreign Currency Settlement System (FCSS) in Gujarat International Finance Tec-City (GIFT IFSC). This notification provides a clear legal and operational framework for settling foreign currency transactions within the IFSC. This enhancement provides regulatory clarity, risk management, and operational efficiency for market participants.</p>\n\n<p>The FCSS is established under the Payment and Settlement Systems Act, 2007, with IFSCA authorizing CCIL IFSC Limited (CIL) to operate the payment system. IFSCA also notified CIL's bye-laws, rules, and regulations, making them legally binding. The framework aligns with the International Financial Services Centres Authority Act, 2019, empowering IFSCA to regulate payment systems within IFSCs. The International Financial Services Centres Authority (Payment and Settlement Systems) Regulations, 2024, provide specific operational guidance, solidifying the FCSS as a regulated settlement system in GIFT IFSC.</p>\n\n<p>The formalization of FCSS strengthens GIFT IFSC's infrastructure, enhancing its attractiveness to international financial institutions. By providing a domestic, regulated foreign currency settlement platform, the FCSS reduces dependence on offshore systems, enhancing operational efficiency and cost-effectiveness. This will provide international banks, corporates, and financial institutions operating in GIFT IFSC with regulatory certainty, improved risk mitigation, and compliance clarity.</p>\n\n<p>In conclusion, the IFSCA's notification codifies the legal and operational framework for foreign currency settlements in GIFT IFSC, laying a foundation for secure, efficient, and compliant cross-border transactions. This further enhances GIFT IFSC’s position as a globally competitive financial hub.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/ifsca-notifies-foreign-currency-settlement-rules.jpg"
  },
  {
    "title": "Gujarat Urja Vikas Nigam Wins In Supreme Court; Essar Power Liable To Reimburse Fixed Electricity Charges",
    "description": "<p>The Supreme Court ruled in favor of Gujarat Urja Vikas Nigam Limited (GUVNL) in its dispute with Essar Power Limited (EPL) regarding the diversion of electricity to Essar Steel Limited (ESL) under a Power Purchase Agreement (PPA). The case, stemming from a 1996 agreement for EPL to supply electricity to both GUVNL and ESL, centered on EPL's alleged breach of proportionate allocation by supplying more power to ESL than agreed, leading to claims of wrongful diversion.</p>\n\n<p>The dispute moved through multiple adjudicative bodies, including the Gujarat Electricity Regulatory Commission (GERC) and the Appellate Tribunal for Electricity (APTEL). Previous rulings had addressed issues such as capacity declaration, compensation for diversion, and the appropriate methodology for computing the diverted electricity. The Supreme Court's intervention became necessary to settle the matter.</p>\n\n<p>The Supreme Court emphasized the importance of adhering to its 2016 decision, which established the proportionate allocation obligation and capacity declaration requirement under the PPA. A key aspect of the judgment was the entitlement of GUVNL to reimbursement of fixed charges for electricity diverted to ESL, distinct from compensation for diversion. The court also upheld the GERC's methodology for computing electricity diversion, using hourly periods until February 23, 2005, and half-hourly periods thereafter, acknowledging a subsequent consensual change implemented by both parties. Additionally, the court affirmed the method of calculating compensation for wrongful diversion, which is based on the HTP-1 Tariff Energy Charge rate reduced by variable costs. The Supreme Court upheld APTEL's decision to remand specific issues, such as discrepancies in Deemed Generation Incentive amounts, to GERC for further factual examination and determination. The ruling directed GUVNL to receive reimbursement of fixed charges and compensation for wrongful diversion, following the specified computation methodologies, and instructed each party to bear its own costs.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/supreme-court-rules-in-favour-of-gujarat-urja-vikas-nigam.jpg"
  },
  {
    "title": "Consumer Authority Fines Drishti IAS for Deceptive UPSC Selection Advertisement",
    "description": "<p>The Central Consumer Protection Authority (CCPA) has fined Drishti IAS ₹5 lakh for a misleading advertisement claiming \"216+ selections in UPSC CSE 2022.\" The CCPA, empowered by the Consumer Protection Act, 2019, found that the advertisement deceptively implied a significant contribution to the success of candidates, the majority of whom (162 out of 216) only participated in the institute's free Interview Guidance Programme (IGP) after already clearing the preliminary and mains stages.</p>\n\n<p>The Authority determined that this concealment of material information constituted a misleading advertisement under Section 2(28) of the Act, violating students' right to informed choice. This marked the second instance of such misconduct, following a previous penalty of ₹3 lakh in September 2024 for a similar advertisement regarding the 2021 UPSC CSE results.</p>\n\n<p>The CCPA emphasized that the concealment of material facts, particularly the distinction between paid and free programs, distorted the competitive market and exploited aspirants' trust. The Authority has directed Drishti IAS to cease such misleading practices and has issued numerous other notices and penalties to coaching institutes for similar offenses, underscoring the importance of truthful advertising and accountability within the education sector. The decision aims to ensure that educational service providers provide accurate information about course participation, preventing inflated success claims and promoting transparency in the industry.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/ccpa-fines-drishti-ias-%e2%82%b95-lakh-for-misleading-upsc-ad.jpg"
  },
  {
    "title": "Project Financing in India: A Comprehensive Overview",
    "description": "<p>Project financing is a critical mechanism for funding large-scale infrastructure and industrial projects in India, relying on projected cash flows rather than sponsor balance sheets. It has become increasingly important for India's economic growth as the country develops essential infrastructure. The project financing ecosystem in India consists of equity, debt, and government support mechanisms and is underpinned by both public and private sector investment, as well as growing institutional support.</p>\n\n<p>Project finance is widely used across multiple infrastructure sectors in India. However, despite its growth, this ecosystem faces several persistent and emerging challenges, including those related to the legal and regulatory framework.</p>\n\n<p>Recent trends emphasize the need to strengthen project preparation, enhance risk-sharing mechanisms, deepen bond markets, promote dispute resolution reforms, and leverage innovative financing tools like InvITs, ESG bonds, and blended finance. As India aims for a $5 trillion economy, robust project finance mechanisms will be vital for mobilizing the necessary capital for sustainable infrastructure development.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/project-financing-in-india-key-insights-and-trends.jpg"
  },
  {
    "title": "Music Legend Asha Bhosle Sues AI Firm and E-Commerce Sites Over Voice and Image Misuse",
    "description": "<p>The Bombay High Court has granted ad-interim protection to playback singer Asha Bhosle, recognizing her personality rights against unauthorized use of her voice, image, and likeness by AI platforms and online marketplaces. This ruling sets a precedent in India's jurisprudence on deepfakes, AI exploitation, and publicity rights by acknowledging the legal protection of a celebrity's persona, extending to voice cloning, AI-generated content, and digital merchandise.</p>\n\n<p>The case arose from the misappropriation of Asha Bhosle's voice, name, image, and likeness without her consent. AI platforms were developing tools to clone her voice, allowing users to generate songs in her style, which were then circulated on platforms like YouTube. Additionally, online marketplaces like Amazon and Flipkart were selling unauthorized merchandise featuring her image. Bhosle argued these actions violated her personality rights and moral rights under Section 38-B of the Copyright Act, 1957.</p>\n\n<p>The Bombay High Court concluded that Bhosle had established a strong prima facie case, emphasizing the unauthorized technological exploitation of her identity and reputation. The court issued ad-interim injunctions, restraining the defendants from misusing her personality attributes.</p>\n\n<p>This judgment significantly shapes India's response to AI, deepfakes, and personality rights. It affirms that a celebrity's voice, name, and likeness are protectable attributes, and AI voice cloning without consent constitutes infringement. The ruling also places a duty on intermediaries like Amazon, Flipkart, and YouTube to remove infringing content and share violator details, strengthening accountability in the digital ecosystem. While this judgment provides immediate relief, it also exposes the regulatory vacuum in India regarding AI-generated content and digital impersonation, highlighting the need for comprehensive legislation on digital identity and AI misuse.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/asha-bhosle-wins-case-against-ai-voice-and-image-misuse.jpg"
  },
  {
    "title": "Samsung Liable for Faulty Handset and Unfair Trade Practice: Delhi Consumer Commission Ruling",
    "description": "<p>The District Consumer Disputes Redressal Commission-I, Delhi, has held Samsung India Electronics and its authorized service center jointly liable for deficiency in service and unfair trade practice. The ruling stems from a case where a consumer's Samsung A35 smartphone developed defects shortly after purchase, and Samsung refused replacement or refund, despite its own \"Dead on Arrival\" (DOA) policy.</p>\n\n<p>The complainant, Mr. Doneshwar Arya, purchased the phone for ₹30,999, and a defect appeared on the display within three days. The company denied relief based on a missing IMEI sticker, although the IMEI was verifiable. The Commission, referencing the Consumer Protection Act, 2019, particularly Section 2(47) and Section 2(11), found Samsung guilty of unfair trade practices and deficiency in service for failing to honor its DOA policy and creating arbitrary procedural requirements.</p>\n\n<p>As a result, the Commission directed Samsung to refund the cost of the handset (₹30,999), pay ₹10,000 as compensation for mental agony and harassment, and cover ₹5,000 in litigation costs. The judgment reinforces consumer rights, emphasizing that companies must respect warranty commitments and provide fair and prompt redressal mechanisms. It sets a precedent that companies cannot evade liability through arbitrary hurdles and must act in good faith.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/samsung-held-liable-for-faulty-phone-and-unfair-trade.jpg"
  },
  {
    "title": "Fraudulent Portal Masquerading as IRDAI Targets Indian Policyholders",
    "description": "<p>The Insurance Regulatory and Development Authority of India (IRDAI) has issued a public notice alerting policyholders to a fraudulent website mimicking its consumer education portal. This fake site is designed to steal money and data by misleading users into believing it is the official IRDAI resource.</p>\n\n<p>The deceptive website, using the address `https://policyholdergov.org`, closely resembles the legitimate IRDAI portal, `https://policyholder.gov.in`, employing copied logos and seals to appear credible. Victims are urged to pay renewal premiums and are sometimes promised faster claim settlements in exchange for fees, which are fraudulent requests. IRDAI has clearly stated that it never collects premiums, charges for claim settlements, or offers payment gateways.</p>\n\n<p>IRDAI has reported the fraudulent site to cyber-crime authorities and CERT-In, but the site continues to reappear with new sub-links. Policyholders are advised to only use the official websites (`https://policyholder.gov.in` and `https://irdai.gov.in`) and to treat any other variations, WhatsApp links, or SMS short-codes with suspicion. A three-step safety checklist includes carefully verifying the URL, ensuring the presence of the padlock symbol and \"gov.in\" suffix, and avoiding entering sensitive data on sites accessed through search ads or unsolicited calls.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/fake-irdai-portal-dupes-policyholders-across-india.jpg"
  },
  {
    "title": "The Minor Husband Maintenance Ruling: Allahabad High Court's Judgement Summary",
    "description": "<p>This case summary details a recent ruling by the Allahabad High Court regarding maintenance claims under Section 125 of the Criminal Procedure Code (Cr.P.C.). The central issue concerned a wife and minor daughter seeking maintenance from a husband who was a minor at the time of the application but attained majority during the proceedings.</p>\n\n<p>The Family Court initially granted the maintenance, but the husband challenged the order, citing his minority at the time of filing. The High Court, however, clarified that while maintenance liability could not arise before the husband's majority, it became applicable upon attaining majority. The court considered evidence of cruelty and neglect by the husband, justifying the wife's refusal to cohabit. Assessing the husband's income based on his labor capacity within a joint Hindu family, the court deemed the initial maintenance amount excessive, referencing Supreme Court precedents such as Rajnesh vs. Neha.</p>\n\n<p>Ultimately, the High Court partly allowed the revision, reducing the maintenance amount to Rs. 2,500 for the wife and Rs. 2,000 for the daughter, effective from the date the husband attained majority, aligning the allowance with approximately 25% of the assessed income. This judgment underscores that maintenance claims can be sustained despite the husband's initial minority, emphasizing substantive justice, responsibility, and the protection of vulnerable spouses and children. It clarifies that minority does not permanently exempt individuals from future liability when cruelty and neglect are established.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/the-minor-husband-maintenance-ruling.jpg"
  },
  {
    "title": "FCRA Alert: Renew Early or Risk Losing Foreign Funding",
    "description": "<p>The Ministry of Home Affairs has issued a notice urging all associations registered under the Foreign Contribution (Regulation) Act (FCRA) to submit renewal applications well in advance of their expiration dates. This advisory addresses growing concerns about delayed submissions that disrupt the flow of foreign contributions to registered entities.</p>\n\n<p>According to FCRA regulations, renewal applications must be submitted electronically using Form FC-3C within six months before the registration certificate's expiry. However, many associations are submitting applications with insufficient time for scrutiny and security clearance, often less than 90 days before expiry.</p>\n\n<p>The consequences of delayed renewal are significant: an association's certificate expires before the renewal is approved, it will be barred from receiving or utilizing foreign funds. To mitigate these risks, the Ministry strongly advises associations to submit renewal applications at least four months before the expiry date, allowing adequate time for administrative review and security clearance. Failure to comply could result in a lapse of registration and a halt to foreign funding.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/fcra-renewal-alert-submit-early-to-avoid-funding-disruption.jpg"
  },
  {
    "title": "Kerala High Court Restores Fair Play in Co-operative Elections: No ‘Implied’ Disqualifications Allowed",
    "description": "<p>The Kerala High Court recently ruled in R. Suresh Babu v. State Co-operative Election Commission that election officials cannot impose disqualifications beyond those explicitly stated in the Kerala Co-operative Societies Act, 1969 and the Kerala Co-operative Societies Rules, 1969. The case involved the rejection of a nomination for the Neyyattinkara Circle Co-operative Union election based on the rationale that a proposer could not also be a candidate in the same constituency.</p>\n\n<p>Justice K. Babu overturned the Returning Officer's decision, emphasizing that Rule 129(4) contains no such prohibition and that the right to contest is a statutory right restrictable only by express statutory provisions. The court distinguished between permissible judicial intervention to correct manifest illegality and impermissible disruption of the election process. Referencing Supreme Court precedents like Election Commission v. Ashok Kumar, the court affirmed that intervention is justified when a nomination rejection is patently illegal and requires no detailed evidence.</p>\n\n<p>The ruling reinforces electoral fairness within co-operative institutions by preventing unwarranted assumptions of power by election officials and ensuring that individuals are not denied their statutory right to contest elections based on extraneous grounds. The Kerala High Court underscored that while courts generally avoid mid-election interference, they can intervene when violations are obvious and unfair, thus balancing respect for the electoral process with the need to correct clear wrongdoing and protect democratic rights.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/kerala-hc-upholds-fairness-in-co-operative-elections.jpg"
  },
  {
    "title": "Bombay High Court Flags “Usual Way to Siphon Off Public Land”: Strong Remarks on 33-Acre Slum Allotment in South Mumbai",
    "description": "<p>The Bombay High Court has raised serious concerns regarding the proposed redevelopment of a 33-acre government-owned land parcel in Cuffe Parade, Mumbai, intended for the rehabilitation of approximately 65,000 slum dwellers. The court's scrutiny stems from allegations that the project, facilitated through the Slum Rehabilitation Authority (SRA), effectively transfers public land for private benefit under the guise of welfare.</p>\n\n<p>The Division Bench emphasized the scarcity of public land in Mumbai and the State's fiduciary duty to preserve it as a community resource, citing the doctrine of public trust. The court cautioned against welfare schemes being exploited for private enrichment, labeling the practice a \"usual modus operandi to siphon off valuable public lands.\"</p>\n\n<p>The judgment carries significant implications for governance, urban policy, and constitutional accountability, reinforcing that the State functions as a trustee of public land and must ensure that any transfer demonstrably serves public interest. The court underscored the necessity of obtaining high-level sanction, maintaining transparency, and ensuring public consultation before implementing such large-scale redevelopment schemes. The absence of transparency or due process, the Court cautioned, makes such projects vulnerable to judicial invalidation. The decision calls for a balanced approach between welfare and public interest.</p>\n\n<p>In conclusion, the Bombay High Court's remarks serve as a reminder that public assets cannot be disposed of without clear justification, transparency, and constitutional compliance, reinforcing the need for procedural integrity, executive accountability, and transparent governance.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/bombay-hc-flags-misuse-of-public-land-in-33-acre-sra-case.jpg"
  },
  {
    "title": "Maharashtra Shops Act Update: Clarification on 24x7 Continuous Operations",
    "description": "<p>The Maharashtra government, through a notification dated October 1, 2025, has provided clarity regarding continuous operations for shops and commercial establishments. This notification clarifies the existing provision in the Maharashtra Shops and Establishments (Regulation of Employment and Conditions of Service) Act, 2017, Section 16(1)(b), that allows businesses to operate seven days a week, provided each employee receives a continuous 24-hour weekly rest period. Establishments serving alcohol are excluded.</p>\n\n<p>Previously, while technically permitted, businesses hesitated due to ambiguity and concerns regarding compliance checks. The notification explicitly allows continuous operations under the condition of mandatory weekly rest, balancing commercial interests with employee protection. This clarity removes legal uncertainty, enabling businesses to confidently plan seven-day operations while adhering to labor laws, minimum wage regulations, and occupational safety standards.</p>\n\n<p>This progressive step by the Maharashtra government modernizes business operations while safeguarding worker rights. It confirms the permissibility of continuous operations with statutory safeguards, aligning the state with global business practices and reinforcing the importance of employee welfare. This landmark development creates a flexible, responsible commercial ecosystem, empowering businesses to extend hours, improve service, and strategically plan operations, provided they remain vigilant about compliance.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/maharashtra-shops-act-update-24x7-operations-allowed.jpg"
  },
  {
    "title": "Joint Names, Joint Pain: Delhi High Court’s 2025 Verdict on Maintenance, Joint Assets and Denial of Divorce",
    "description": "<p>In September 2025, the Delhi High Court concluded a protracted matrimonial dispute originating from a 2006 divorce petition filed in Mumbai. The central issues revolved around the wife's entitlement to half of a ₹1.09 crore surplus from an auctioned flat, the appropriateness of ₹2 lakh monthly interim maintenance, and the husband's plea for divorce based on cruelty and desertion. The court's 35-page judgment upheld established family law principles and underscored the continued relevance of fault in Hindu matrimonial law.</p>\n\n<p>The couple married in 1999 and lived in Mumbai due to the husband's job. After the husband left in 2006, the wife moved to Delhi. The husband filed for divorce, which was transferred to Delhi, triggering parallel litigation over maintenance and property rights. A flat purchased jointly during the marriage was auctioned due to default, resulting in the surplus now in dispute. The wife claimed entitlement to half the surplus and contested the interim maintenance amount, while the husband sought to overturn both.</p>\n\n<p>The High Court addressed four appeals collectively. The husband alleged cruelty and desertion based on various incidents, while the wife countered with claims of the husband's relationship with a colleague. The court considered several legal precedents regarding maintenance, cruelty, desertion, and the bar created by Section 23(1)(a) of the Hindu Marriage Act (HMA). It also invoked the Prohibition of Benami Property Transactions Act.</p>\n\n<p>The court affirmed the ₹2 lakh monthly maintenance, citing the wife's lack of independent income and the husband's financial capacity. It ruled that the wife was entitled to 50% of the flat's surplus, emphasizing that jointly-owned property is presumed to be held equally unless proven otherwise, and that the Benami Act prevents the husband from claiming sole ownership based on EMI payments. On the divorce petition, the court concurred with the Family Court that the husband did not demonstrate adequate cause for divorce, and the husband's own misconduct barred him from obtaining a decree. The court directed the release of ₹54.5 lakh to the wife, maintained the maintenance amount, and dismissed the divorce appeal, highlighting the importance of fault and clean hands in Indian matrimonial law and reminding litigants that conduct during and after filing for divorce is relevant.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/delhi-hc-2025-divorce-denied-50-joint-property-awarded.jpg"
  },
  {
    "title": "NCLAT Holds ESI Contributions Outside Liquidation Estate",
    "description": "<p>The National Company Law Appellate Tribunal (NCLAT) has ruled that Employees' State Insurance Corporation (ESIC) contributions collected by an employer do not become the property of the corporate debtor and must be excluded from the liquidation estate. This decision, delivered on September 24, 2025, in Company Appeal (AT)(Ins) No. 301 of 2024, overturns a prior NCLT order and directs that Rs 1,20,80,940 of ESI dues belonging to Gupta Dyeing & Printing Mills Pvt. Ltd. be kept separate from the assets available to other creditors during liquidation.</p>\n\n<p>The dispute arose when the Regional Director of ESIC claimed that unpaid ESI contributions, deducted from workers' wages, should be excluded from the company's assets due to a statutory trust under Section 40(4) of the ESI Act, 1948. This claim was challenged by the liquidator and other creditors who would benefit from including the amount in the liquidation estate. The NCLT initially dismissed the ESIC plea, deeming the Corporation an operational creditor without priority under Section 53(1)(b) of the Insolvency and Bankruptcy Code (IBC).</p>\n\n<p>On appeal, the NCLAT emphasized that employers hold employee ESI contributions as trustees for the ESIC, making non-payment a breach of trust. The tribunal aligned with a previous ruling in Nurani Subramanian Suryanarayanan, Liquidator of M/s Care IT Solutions Pvt. Ltd. v. ESIC, which resolved a similar issue in favor of the Corporation. The NCLAT clarified that Section 36(4)(a)(i) of the IBC carves out \"assets in trust for any third party\" from the liquidation estate, and Section 40(4) of the ESI Act creates precisely such a trust.</p>\n\n<p>The NCLAT set aside the NCLT order, directing that the ESI dues of Rs 1,20,80,940 be remitted to the ESIC and not treated as part of the liquidation estate. The ruling affirms that social security deductions are distinct and do not merge into the corporate debtor's assets. This decision serves as a reminder to liquidators and reinforces the right of statutory authorities to insist on exclusion rather than mere priority of such deductions. This precedent may influence similar claims related to other wage-related statutes like provident fund and gratuity.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/nclat-esi-contributions-excluded-from-liquidation-estate.jpg"
  },
  {
    "title": "RBI Issues Directions on Settlement of Claims for Deceased Customers",
    "description": "<p>The Reserve Bank of India (RBI) released the Reserve Bank of India (Settlement of Claims in respect of Deceased Customers of Banks) Directions, 2025, effective March 31, 2026. These directions consolidate and standardize procedures for settling claims related to deposit accounts, safe deposit lockers, and articles in safe custody for deceased bank customers, aiming to minimize delays and ensure uniform practices across commercial and cooperative banks. They do not apply to government-administered savings schemes like PPF or SCSS.</p>\n\n<p>The legal basis for these directions rests on provisions intended to expedite claim settlements. The RBI observed inconsistent bank practices regarding nomination, often requiring succession certificates even with existing nominations. These directions repeal prior circulars, establishing a uniform and enforceable system.</p>\n\n<p>For claims exceeding a specified threshold, settlement necessitates succession certificates, legal heir certificates, or affidavits, potentially with sureties. Banks retain discretion to act on uncontested Wills without requiring probate but require court orders for disputed claims. In the absence of a nomination, a simplified procedure involves claim forms, death certificates, identity proof, and a legal heir certificate or affidavit with no-objection statements from other heirs. Disputed cases without nomination require probate, succession certificate, or a court order for resolution.</p>\n\n<p>These Directions represent a significant reform in banking consumer protection law, establishing uniform procedures, timelines, and penalties for delays. They address long-standing grievances by depositor families, ensuring efficient access to funds and belongings while balancing ease of settlement with safeguards against wrongful claims. The harmonized framework enhances operational clarity for banks and strengthens customer trust in the banking system.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/rbi-issues-directions-on-settlement-of-deceased-claims.jpg"
  },
  {
    "title": "PVR Wins Consumer Case: Restriction on Outside Snacks Upheld, Free Water Mandated",
    "description": "<p>The District Consumer Disputes Redressal Commission, Ernakulam, dismissed a consumer complaint against PVR Cinemas regarding its policy of prohibiting outside food and beverages. The complainant argued that this restriction constituted an unfair trade practice, forcing consumers to purchase overpriced in-house items.</p>\n\n<p>The Commission ruled that cinema theaters have the legal right to regulate entry conditions, including restricting outside food, referencing the Supreme Court precedent set in K.C. Cinema v. State of J&K. This right is contingent upon ensuring free access to drinking water and accommodating special needs. The complainant failed to prove a deficiency in service, as the ban on outside food was consistent with established legal precedent.</p>\n\n<p>While dismissing the complaint, the Commission issued a binding directive, ordering PVR Cinemas to strictly comply with its undertaking to provide uninterrupted access to free RO-filtered drinking water for all customers. This includes maintaining the facility hygienically and displaying prominent signage. This decision balances the operational rights of the multiplex with the fundamental health and welfare of consumers, mitigating potential exploitative practices.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/pvr-wins-case-outside-food-ban-upheld-free-water-mandated.jpg"
  },
  {
    "title": "Reshaping Professional Services: MCA Issues Consultation on Multi-Disciplinary Partnerships",
    "description": "<p>The Ministry of Corporate Affairs (MCA) launched a public consultation on September 17, 2025, regarding the proposed establishment of Multi-Disciplinary Partnership (MDP) firms in India. This initiative seeks to create a regulatory framework that enables domestic professional services firms (e.g., law, accounting, consulting) to compete effectively with larger international networks by allowing collaboration across disciplines while maintaining professional independence. Stakeholders are invited to submit their feedback by September 30, 2025, via the MCA’s e-Consultation Module or email.</p>\n\n<p>Currently, Indian professional services firms operate within a fragmented regulatory environment, constrained by multiple professional statutes and licensing requirements that restrict cross-disciplinary collaboration. Recognizing that these structural challenges impede growth and competitiveness, the MCA is exploring MDPs as a solution, drawing on global best practices.</p>\n\n<p>The consultation, initiated through Notification No. 01/5/2025-PI/MCA, invites stakeholder views on various aspects of MDPs, including governance models, accountability, and transitional arrangements. This consultation presents an opportunity to shape the future of the professional services sector in India. If implemented effectively, MDPs could enhance efficiency, foster competition, and elevate Indian firms on the global stage. Stakeholder feedback is crucial in shaping a robust and forward-looking framework for multidisciplinary firms in India.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/mca-seeks-views-on-multi-disciplinary-partnership-firms.jpg"
  },
  {
    "title": "Judicial Rationale in Sharad Singh v. H. D. Narang: A Significant Refinement in Compensation for a Paraplegic Victim",
    "description": "<p>In Sharad Singh v. H. D. Narang, the Supreme Court of India delivered a landmark judgment enhancing the compensation awarded to the legal representative of a deceased accident victim, Sharad Singh, who suffered paraplegia due to a motor vehicle accident. The ruling, authored by Justice K. Vinod Chandran and Justice N.V. Anjaria, refines motor accident compensation jurisprudence, particularly concerning students with demonstrated academic potential.</p>\n\n<p>The victim, a 20-year-old B. Com student and ICAI enrollee, sustained severe injuries in 2001 when a negligently driven car struck the motorcycle he was riding, resulting in complete paraplegia. He remained bedridden until his death in 2021. The Supreme Court addressed the High Court's inadequate assessment of income and future medical expenses. It dismissed the insurance company's objections to medical bills from hospitals outside the victim's hometown, emphasizing the company's national presence and the legitimate need for specialized care in different locations.  The Court upheld medical expenses amounting to Rs. 20 lakhs, recognizing the necessity of the treatments for sustaining the victim's life.</p>\n\n<p>Critically, the Court rejected the lower courts' reliance on minimum wage as the basis for calculating loss of income. The Supreme Court deemed the use of minimum wage inappropriate for a graduate student pursuing a Chartered Accountancy qualification. Instead, it estimated a notional monthly income of Rs. 5,000 in 2001, considering his potential as an accountant, and applied a 40% increase for future prospects, consistent with National Insurance Company Limited vs. Pranay Sethi and Others. This led to a revised loss of income calculation of Rs. 15,12,000.</p>\n\n<p>The Supreme Court's judgment resulted in a significantly enhanced total compensation award of Rs. 40,34,356. The Court underscored the importance of considering a student's potential when determining compensation and reiterated that insurance companies cannot evade liability on unsubstantiated grounds, especially when life-saving medical care is involved. The ruling serves as a precedent for equitable compensation, acknowledging both the victim's potential and the substantial costs associated with life-sustaining care.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/sc-enhances-compensation-in-sharad-singh-paraplegia-case.jpg"
  },
  {
    "title": "Lok Adalat vs. Employees’ Compensation Act: Kerala High Court Upholds Settlement Finality",
    "description": "<p>The Kerala High Court, in a judgment delivered on September 22, 2025, addressed the issue of whether a settlement reached at a Lok Adalat precludes a subsequent claim for compensation under the Employees’ Compensation Act, 1923, and whether Section 8(1) of the Act prohibits payments not deposited with the Commissioner. The case involved parents who, after their son's death in a workplace accident, received Rs 10 lakh through a Lok Adalat settlement and later sought additional compensation from the Employees’ Compensation Commissioner.</p>\n\n<p>The Commissioner denied the claim, citing the prior Lok Adalat award as a final discharge of liability. The parents appealed this decision, leading the High Court to formulate two substantial questions of law: whether the Employees’ Compensation Act claim can be settled through a Pre-Litigation Petition despite Section 8(1) of the EC Act, and whether receipt of money from the Lok Adalat bars a subsequent claim for the statutory amount before the Commissioner.</p>\n\n<p>The Court, referencing the supremacy clause in Section 25 of the Legal Services Authorities Act, ruled that the Lok Adalat settlement was final. It reasoned that when a dispute is taken to a Permanent Lok Adalat, the restrictions of Section 8(1) are relaxed, given the Adalat's role in protecting weaker parties. The court also invoked the doctrine of election of remedies, stating that the parents, having chosen to settle at the Lok Adalat, were bound by that choice. Thus, the appeal was dismissed, affirming that the Rs 10 lakh already received constituted a full and conclusive settlement, preventing the family from pursuing further compensation through the Employees’ Compensation Commissioner.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/kerala-hc-lok-adalat-settlements-are-final-in-ec-claims.jpg"
  },
  {
    "title": "Supreme Court Restores CCI Penalties on Film Exhibitors’ Federation for Anti-Competitive Conduct",
    "description": "<p>The Supreme Court has allowed the Competition Commission of India's (CCI) appeal, reinstating its order against the Kerala Film Exhibitors Federation (KFEF) for anti-competitive conduct under Section 3 of the Competition Act. The court ruled that the CCI's initial notice, forwarding the Director General's (DG) report and inviting replies and a hearing, adequately complied with the Act. It held that a separate show-cause notice dedicated solely to the penalty was not required under the statutory scheme.</p>\n\n<p>The case stemmed from a complaint alleging KFEF organized a boycott preventing distributors from dealing with a specific theater. The CCI, based on the DG's report, found KFEF in violation and imposed monetary penalties and behavioral directions on the federation and its office-bearers. The COMPAT (Competition Appellate Tribunal) upheld the violation finding but overturned penalties against the office-bearers, arguing the lack of a separate penalty notice.</p>\n\n<p>The Supreme Court addressed whether a second, separate show-cause notice specifically proposing penalties is required before imposing sanctions under the Act. The Court emphasized that the Competition Act necessitates timely and effective adjudication, with a single hearing offering a full opportunity to address both findings and potential sanctions. The Court found that the initial notice sufficiently identified the contraventions, named the individuals involved, sought financial information, and scheduled a hearing, satisfying the requirements of natural justice. Furthermore, the Court highlighted that Section 48 of the Act deems individuals in charge responsible for contraventions, negating the need for separate notification of liability. The Supreme Court restored the CCI's original order in full, also noting the importance of the DG report stage and the need to address all factual and mitigation points at that hearing.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/sc-restores-cci-penalties-on-kerala-film-exhibitors.jpg"
  },
  {
    "title": "Supreme Court Clarifies Key Insolvency Issues In Bhushan Power & Steel",
    "description": "<p>The Supreme Court's ruling in Kalyani Transco v. Bhushan Power & Steel Ltd. & Ors. addresses several critical issues arising from the Corporate Insolvency Resolution Process (CIRP) of Bhushan Power and Steel Limited (BPSL) under the Insolvency and Bankruptcy Code, 2016 (IBC). The case stemmed from challenges to the resolution plan submitted by JSW Steel, the Successful Resolution Applicant (SRA), and approved by the Committee of Creditors (CoC) and the National Company Law Tribunal (NCLT).</p>\n\n<p>The Supreme Court's judgment reinforces the sanctity of resolution plans and the importance of creditor decision-making within the IBC framework. The court addressed issues such as the locus standi of promoters, the continuation of the CoC after plan approval, the permissibility of extending plan implementation timelines, and the treatment of profits (EBITDA) earned by the corporate debtor during CIRP. It also clarified the extinguishment of pre-CIRP claims upon resolution plan approval.</p>\n\n<p>Key rulings include the acceptance of promoters as \"persons aggrieved\" with caveats regarding obstructive behavior, the clarification that the CoC remains active until plan implementation or liquidation, and the rejection of clauses allowing indefinite extension of implementation. The court also ruled that EBITDA earned during CIRP remains with the corporate debtor unless the resolution plan specifies otherwise, and reaffirmed that pre-CIRP claims are extinguished upon plan approval under Section 31 of the IBC. The judgment underscores the paramount importance of the commercial wisdom of the CoC and protects resolution applicants from penalties for delays caused by external factors.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/supreme-court-ruling-in-bhushan-power-insolvency-case.jpg"
  },
  {
    "title": "Public Land Auction Set Aside by Supreme Court Due to Statutory Non-Compliance",
    "description": "<p>In Delhi Development Authority v. Corporation Bank & Ors., the Supreme Court of India invalidated the Debts Recovery Tribunal (DRT)'s auction of Delhi Development Authority (DDA) land. The Court held that the sale violated statutory safeguards and breached lease conditions, emphasizing that public land requires strict legal adherence for mortgage or transfer, making non-compliant auctions invalid.</p>\n\n<p>The ruling balanced protecting public property and ensuring fairness by protecting the bona fide auction purchaser through restitution with interest. This underscored the accountability of banks and state authorities while safeguarding innocent third parties in property and recovery proceedings.</p>\n\n<p>The case originated from a DDA plot allotted to Sarita Vihar Club in 2001 for a sports facility, subject to conditions, including that it could not be mortgaged without the Lieutenant Governor of Delhi's written consent. The club mortgaged the property to Corporation Bank without this consent, leading to recovery proceedings by the bank when the club defaulted. The DDA objected to the subsequent auction by the DRT due to non-compliance with the lease conditions and statutory requirements.</p>\n\n<p>The Supreme Court's decision has significant implications for property law and banking, reinforcing that statutory safeguards for leasehold land are non-negotiable and banks must conduct due diligence when providing loans. The ruling also clarifies that res judicata does not shield repeated violations. This is poised to influence banking prudence and recovery proceedings, ensuring the statutory rights of public authorities are upheld.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/sc-quashes-drt-auction-of-dda-land-for-non-compliance.jpg"
  },
  {
    "title": "Supreme Court Guidelines on Expeditious Disposal & Compounding under Section 138 NI Act: Sanjabij Tari v. Kishore S. Borcar",
    "description": "<p>On September 25, 2025, the Supreme Court of India issued a notable judgment in Sanjabij Tari v. Kishore S. Borcar (2025 INSC 1158), providing critical clarifications regarding cheque dishonour prosecutions under Section 138 of the Negotiable Instruments Act, 1881 (NI Act). The decision addresses both substantive legal issues, such as the presumption of liability and the enforceability of cash loans, and prescribes systemic reforms intended to alleviate the significant backlog of cheque bounce litigation in trial courts.</p>\n\n<p>The judgment clarifies recurring issues related to Section 138 of the NI Act, which criminalizes the dishonour of cheques issued for debt or liability discharge. It reinforces that once cheque execution is admitted, Sections 118(a) and 139 of the NI Act establish presumptions favoring the complainant, indicating the cheque was issued against a legally enforceable debt.</p>\n\n<p>Recognizing the extensive backlog of Section 138 cases, the Court implemented practical reforms aimed at expediting disposal and reducing pendency. These reforms include guidelines to limit revisional interference and promote compounding of offences.</p>\n\n<p>The Supreme Court's ruling in Sanjabij Tari v. Kishore S. Borcar is a significant development in cheque dishonour jurisprudence. It provides clarity on substantive law related to presumptions and debt enforceability while also introducing procedural reforms to address case backlogs. This combination of doctrinal clarity and systemic innovation is a crucial step toward improving the efficiency and credibility of cheque bounce litigation within the Indian judicial system.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/sc-issues-guidelines-on-cheque-bounce-cash-loan-cases.jpg"
  },
  {
    "title": "RBI Digitizes Voluntary Surrender of NBFC/HFC Licenses",
    "description": "<p>The Reserve Bank of India (RBI) has announced that Non-Banking Financial Companies (NBFCs) and Housing Finance Companies (HFCs) must now use the PRAVAAH portal to apply for the cancellation of their Certificate of Registration (COR). This update, announced on September 23, 2025, moves the process from email and hard-copy submissions to a centralized online platform.</p>\n\n<p>PRAVAAH, launched in May 2024, serves as a single-window system for various RBI approvals. The surrender-of-license module has been integrated into the portal, allowing applicants to upload the required PDF application form and supporting documents. The portal provides automated acknowledgment and routes the application to the relevant regional supervisory office.</p>\n\n<p>Despite the digitization of the application process, the RBI emphasizes that submitting the application does not immediately terminate the license. NBFCs and HFCs remain subject to all applicable regulations and reporting requirements until the RBI formally issues a cancellation letter, a process that may take several months. These institutions must continue to adhere to all guidelines issued by the RBI, NHB, or other relevant authorities and submit all required regulatory and supervisory returns during this interim period.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/rbi-digitalises-nbfc-hfc-licence-surrender-via-pravaah.jpg"
  },
  {
    "title": "SEBI (Custodian) (Amendment) Regulations, 2025: Raising Standards for Custodians of Securities",
    "description": "<p>The Securities and Exchange Board of India (SEBI) notified the Securities and Exchange Board of India (Custodian) (Amendment) Regulations, 2025 (“Amendment Regulations”) on September 18, 2025. These amendments significantly revise the SEBI (Custodian of Securities) Regulations, 1996 (“Principal Regulations”), enhancing financial thresholds, governance obligations, and compliance responsibilities for custodians to reinforce systemic stability, strengthen investor protection, and align with international standards.</p>\n\n<p>The amendments raise the minimum net worth requirement from ₹50 crore to ₹75 crore, with a three-year transition period for existing custodians. Custodians must maintain this net worth independently of other capital adequacy requirements. The scope of permissible activities is broadened, excluding banking companies and their affiliates. A new regulation mandates robust risk management frameworks, cybersecurity protocols, and business continuity plans.</p>\n\n<p>The code of conduct has been expanded to include 26 obligations. Custodians must comply with SEBI, RBI, and depository rules, avoid unfair competition, and provide effective grievance redressal mechanisms. They must also implement strong internal controls against fraud and misconduct, ensure the fitness of directors and key personnel, and empower independent compliance officers.</p>\n\n<p>These amendments increase compliance and capitalisation costs for custodians but also create opportunities for diversification. Investors benefit from enhanced transparency, strengthened grievance mechanisms, and reduced systemic risks. SEBI gains a more effective oversight framework, harmonising domestic norms with global standards, and enhancing investor confidence in Indian capital markets. These amendments represent a substantive reform of India’s custodian regime, strengthening the resilience and accountability of market infrastructure while safeguarding investor interests.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/sebi-tightens-custodian-rules-with-2025-amendments.jpg"
  },
  {
    "title": "Delhi High Court on Currency Accessibility: Relief for Visually Impaired Persons",
    "description": "<p>The Delhi High Court addressed petitions concerning the difficulties visually impaired individuals face in identifying Indian currency notes, particularly the ₹50 denomination introduced post-demonetization. The court emphasized that accessibility is a constitutional and statutory mandate under the Rights of Persons with Disabilities Act, 2016 (RPwD Act), requiring the State to ensure equal access to financial infrastructure.</p>\n\n<p>The petitions arose after the 2016 demonetization, as the reduced size variations in the new Mahatma Gandhi (New) Series notes made tactile identification challenging. The court formed a High-Powered Committee, led by Prof. M. Balakrishnan of IIT Delhi, to investigate and provide recommendations. The Committee highlighted the inadequacy of existing tactile features and proposed increased size variations, improved color contrasts, and durable materials. It also acknowledged the limitations of the MANI App and stressed the importance of accessibility in the Digital Rupee.</p>\n\n<p>The Reserve Bank of India (RBI) responded that the current confusion was due to the concurrent circulation of old and new notes and argued that redesigning notes is a complex and costly process. The RBI also emphasized existing accessibility features and ongoing improvements to the MANI App, as well as plans to ensure Digital Rupee accessibility. The court acknowledged the hardships faced by visually impaired individuals and RBI's concerns, directing that accessibility recommendations be incorporated into the next series of banknotes and mandating banks to submit bi-annual progress reports on digital accessibility compliance. The judgment underscores that while policy discretion rests with the RBI and the government, it is constrained by the constitutional obligation of accessibility. The author concludes that the ruling represents judicial pragmatism, balancing economic feasibility with constitutional rights and establishing a pathway for a more inclusive financial future.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/delhi-hc-on-currency-relief-for-visually-impaired.jpg"
  },
  {
    "title": "Rajasthan High Court Affirms Pension as a Right, Not Charity, for Widow",
    "description": "<p>The Rajasthan High Court recently ruled in favor of a widow, Smt. Mishri Devi, entitling her to family pension and death gratuity despite her late husband's \"temporary\" employment status. The court emphasized that pension is a statutory right, not a government concession, and that temporary service exceeding one year, following due selection, warrants pensionary benefits equivalent to permanent service.</p>\n\n<p>The case arose after authorities denied Smt. Devi family pension following her husband's death in 1990, claiming his appointment as a Lower Division Clerk (LDC) was \"purely temporary,\" even though he was selected through a regular process. Despite the state offering Smt. Devi compassionate appointment, implying her husband was a substantive employee, her pension claim was rejected.</p>\n\n<p>The High Court overturned the decision, asserting that the \"temporary appointment\" designation could not supersede Rule 268A of the Rajasthan Service Rules, 1951. It directed authorities to release family pension, death gratuity, and arrears with 9% interest, even though the claim was filed 24 years after her husband's passing. This ruling reinforces the principle of social justice within service law, ensuring the dignity of government employees and their families, and highlighting the state's responsibility to uphold social security benefits promptly.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/rajasthan-hc-widow-entitled-to-pension-despite-delay.jpg"
  },
  {
    "title": "FSSAI Orders Nationwide “Special Festive Drive” for Food Safety",
    "description": "<p>The Food Safety and Standards Authority of India (FSSAI) has initiated a nationwide enforcement drive targeting the safety of sweets, savouries, and dairy products during the peak festive season of September-October. This initiative, outlined in a \"MOST URGENT\" circular, instructs all States and Union Territories to conduct intensive surveillance and enforcement activities.</p>\n\n<p>The timing of this drive is crucial, as demand for these food items increases significantly (40-60%) during festivals like Navaratri, Durga Puja, Dussehra, Karva Chauth, and Diwali. This surge in demand can create opportunities for adulteration due to the price difference between genuine and substandard ingredients.</p>\n\n<p>The FSSAI has outlined specific actions, including: micro-targeting high-risk areas such as sweet shop clusters, railway stations, and tourist hubs, equipped with rapid-test and laboratory sampling kits; deploying \"Food-Safety-on-Wheels\" mobile labs for on-the-spot testing and consumer awareness; and digitizing all inspection data (GPS location, photos, test results) into the FoSCoS portal or FoSCoRIS app for transparency and accountability. Data must be complete by November 15th to allow FSSAI to release a public scorecard before the wedding season.</p>\n\n<p>Ultimately, the FSSAI aims to ensure consumer well-being and confidence in the safety and quality of food products during the festive season, preventing issues related to adulterated sweets and dairy products.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/fssai-launches-festive-drive-for-safe-sweets-milk.jpg"
  },
  {
    "title": "Tribunal Deems Procedural Lapses Curable, Admits Insolvency Plea Against Corporate Debtor",
    "description": "<p>The National Company Law Tribunal (NCLT), Mumbai Bench-II, admitted an insolvency petition filed by Pegasus Assets Reconstruction Pvt. Ltd. against Dee Plone Polyester Pvt. Ltd. under Section 7 of the Insolvency and Bankruptcy Code, 2016 (IBC), concerning a default exceeding ₹37 crore. The ruling underscores the tribunal's stance that demonstrable debt and default should take precedence over procedural irregularities.</p>\n\n<p>The case originated from loan facilities sanctioned by Dombivli Nagari Sahakari Bank Ltd. (DNS Bank) to Dee Plone Polyester Pvt. Ltd., secured by hypothecation and mortgage deeds. After the Corporate Debtor defaulted, DNS Bank classified the loan as an NPA and subsequently assigned the debt to Pegasus Assets Reconstruction Pvt. Ltd. As of October 16, 2023, the default amounted to ₹37.35 crore, which the Corporate Debtor acknowledged in audited financial statements and email correspondence.</p>\n\n<p>The NCLT concluded that procedural objections concerning stamping, registration, and authorization lapses were curable and did not invalidate the insolvency petition. It emphasized that acknowledgment of debt extends the limitation period and that the core focus under Section 7 of the IBC remains establishing the existence of financial debt and default. The tribunal dismissed allegations of malicious intent and reinforced the role of Asset Reconstruction Companies (ARCs) in pursuing CIRP against defaulting borrowers. The decision reinforces the principle that the IBC is intended as a timely resolution mechanism focused on debt and default rather than being derailed by technical objections.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/nclt-admits-insolvency-plea-curable-lapses-clarified.jpg"
  },
  {
    "title": "BIS Issues Fresh Rules for Digital TV Receivers – 26 Oct 2025 Deadline Looms",
    "description": "<p>The Bureau of Indian Standards (BIS) has issued a circular effective 18 September 2025, mandating compliance with IS 18112:2025 \"Digital Television Receiver for Satellite Broadcast Transmission Specification (First Revision)\" for all plasma, LCD, and LED televisions sold in India. This is in addition to the existing safety standard IS 616:2017 / IEC 60065:2014, enforced under the Compulsory Registration Scheme (CRS). The deadline for compliance is 26 October 2025.</p>\n\n<p>The new regulation requires all television sets, both new and existing models, to incorporate a digital satellite receiver compliant with IS 18112 while continuing to meet the safety requirements of IS 616. A single R-number will now cover both standards, replacing separate satellite-only certifications. While labs can accept IS 18112:2022 test data until 30 December 2025, manufacturers must provide a notarized declaration committing to upgrade to the 2025 version.</p>\n\n<p>Existing safety-only licensees have until 25 September 2025 to submit inclusion requests with updated test reports. Those with models already containing evaluated satellite tuners can use an online module referencing the original IS 616 report. Non-compliant models will be removed from licenses after 26 October 2025, potentially leading to registration cancellation. Manufacturers using the 2022 standard have until 30 December 2025 to declare their transition to the 2025 version to avoid regulatory action. New applications are encouraged to directly pursue IS 18112:2025.</p>\n\n<p>After 26 October 2025, BIS will no longer grant new or expanded licenses without satellite receiver compliance. The standard mark has been simplified to include both \"IS 616 / IEC 60065\" and \"IS 18112\" with the common R-number. Customs officials, legal-metrology authorities, and e-commerce platforms have been alerted to the conjoined mark, with shipments bearing only the old IS 616 label potentially facing detention, fines, or re-export. IS 18112:2025 includes updated definitions, allows IS / IEC 62368-1 as an alternative safety standard, removes the power-consumption clause, adds testing guidance, and specifies a mute-to-unmute button on remote controls.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/bis-tightens-rules-for-digital-tv-sets-ahead-of-oct-2025.jpg"
  },
  {
    "title": "\"Typo\" No Excuse: SC Quashes Complaint After Demand Notice Claims Double the Bounced Cheque",
    "description": "<p>The Supreme Court of India in Kaveri Plastics v. Mahdoom Bawa Bahrudeen Noorul ruled that a statutory demand notice seeking an amount that differs from the dishonored cheque's value is invalid, thus rendering a subsequent criminal complaint under Section 138 of the Negotiable Instruments Act, 1881, non-maintainable. The court emphasized a strict and technical interpretation of the law.</p>\n\n<p>The case arose from a dishonored cheque for Rs. 1,00,00,000/- issued by Kaveri Plastics to Mahdoom Bawa Bahrudeen Noorul. The subsequent demand notices incorrectly demanded Rs. 2,00,00,000/-, leading to the respondent's petition to quash the criminal complaint, which was ultimately upheld by the High Court. The Supreme Court addressed whether a demand notice survives when the amount claimed differs numerically from the dishonored cheque, even if the discrepancy is claimed to be inadvertent.</p>\n\n<p>The Supreme Court upheld the High Court's decision, asserting the necessity of a precise demand for \"the said amount of money\" as stipulated in Proviso (b) to Section 138. While a notice may include additional claims, the demand for the cheque amount must be accurate. The court found that demanding an inflated amount invalidated the notice and the associated complaint. The ruling reaffirms that meticulous adherence to the law is required for criminal prosecutions related to cheque dishonor, placing the onus on the complainant to ensure the demand notice is accurate, thereby providing the drawer with a clear and honest opportunity to settle the debt.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/sc-wrong-amount-in-demand-notice-invalidates-complaint.jpg"
  },
  {
    "title": "Supreme Court on Medical Negligence: NCDRC Cannot Create a New Case Beyond Pleadings",
    "description": "<p>The Supreme Court of India, in Deep Nursing Home and Another v. Manmeet Singh Mattewal and Others, clarified that adjudicatory forums cannot exceed the pleadings of the parties and invent a new case. The ruling emphasizes judicial discipline and clarifies the scope of liability in medical negligence cases. The court overturned the findings of the State Consumer Disputes Redressal Commission (SCDRC) and the National Consumer Disputes Redressal Commission (NCDRC), which had held doctors and a nursing home liable.</p>\n\n<p>The case originated from the death of Charanpreet Kaur and her newborn child during delivery at Deep Nursing Home. The complainant, Manmeet Singh Mattewal, alleged negligence in post-delivery care due to inadequate equipment and delayed blood arrangement, seeking substantial compensation. The SCDRC found Deep Nursing Home and Dr. Kanwarjit Kochhar negligent in post-delivery management and awarded compensation.</p>\n\n<p>On appeal, the NCDRC shifted the liability entirely to Dr. Kochhar, finding him negligent in antenatal management for not prescribing certain tests, despite acknowledging no negligence in delivery or post-delivery care. The Supreme Court found that the NCDRC overstepped its jurisdiction by creating a new case of antenatal negligence, which was not part of the original complaint. The Court cited previous rulings, emphasizing that decisions must be based on pleaded grounds and parties cannot be taken by surprise.</p>\n\n<p>Ultimately, the Supreme Court allowed the appeal, dismissing the complaint and directing Manmeet Singh Mattewal to refund ₹10,00,000/- received during the litigation, to be paid to New India Assurance Company and the doctors involved. The judgment underscores the importance of adhering to pleadings and expert medical opinions in consumer cases.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/sc-ncdrc-cannot-go-beyond-pleadings-in-med-negligence.jpg"
  },
  {
    "title": "Gauhati High Court Upholds Right to Free Books and Uniforms under the RTE Act",
    "description": "<p>The Gauhati High Court, in Master Rehan Barai & Anr. v. State of Assam & Ors., reaffirmed the Right of Children to Free and Compulsory Education Act, 2009 (RTE Act), directing that children admitted under Section 12(1)(c) are entitled to free textbooks and uniforms, in addition to free admission. This ruling stemmed from a case where children were denied regular classes due to their parents' inability to pay for these materials, despite being admitted under the RTE Act.</p>\n\n<p>The school authorities agreed to provide the books and uniforms, with the understanding that the State Government would reimburse the costs under Section 12(2) of the RTE Act. The Court referenced precedents, including the Supreme Court's ruling in Society for Unaided Private Schools of Rajasthan v. Union of India, which upheld the validity of Section 12(1)(c) and emphasized the State's duty to ensure universal elementary education.</p>\n\n<p>Justice Kaushik Goswami directed the school to provide the necessary materials and further ordered that remedial classes be arranged to help the children catch up with their peers, given the classes they had missed. This decision reinforces the substantive nature of the right to education, ensuring that children are equipped with the tools necessary for meaningful participation. The judgment underscores the importance of accountability for private schools operating under the RTE mandate and the State's role in timely reimbursement and strict compliance monitoring to ensure genuinely free and accessible education for all children.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/gauhati-hc-free-books-uniforms-under-rte-a-right.jpg"
  }
]