[
  {
    "title": "High Court Clarifies Locus Standi for Section 138 NI Act Complaints",
    "description": "<p>The Himachal Pradesh High Court's decision in *Shirgul Filling Station v. Kamal Sharma* emphasizes the strict procedural requirements for cheque dishonor cases under Section 138 of the Negotiable Instruments Act, 1881. The court upheld the dismissal of a complaint filed by a sole proprietorship due to a failure to adequately prove the proprietorship and the legal standing of the person initiating the proceedings.</p>\n\n<p>The Trial Court found that the complainant, Shirgul Filling Station, failed to provide conclusive proof that Shivani Gupta was the proprietor. The authority letter provided by Ankur Aggarwal was deemed invalid as it was issued after the legal notice was sent and the complaint filed, and was not a valid power of attorney. Furthermore, as the cheque was issued to Shirgul Filling Station, and Ankur Aggarwal failed to prove the proprietorship, he could not be considered the \"payee\" as required by Section 138.</p>\n\n<p>The High Court affirmed the Trial Court's decision, dismissing the criminal appeal and upholding the acquittal of Kamal Sharma. The judgment underscores the importance of adhering to procedural requirements, establishing clear locus standi with valid authorization, and ensuring authorization timeliness. This ruling serves as a reminder for litigants, especially those representing sole proprietorships, to ensure proper legal representation and meticulous observation of procedural formalities before initiating action under Section 138 of the NI Act. Failure to do so can result in dismissal, regardless of the underlying financial dispute.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/locus-standi-under-section-138-of-the-ni-act-clarified.jpg"
  },
  {
    "title": "Delhi High Court Quashes FIR in Live-In Relationship Dispute, Imposes Cost for Casual Use of Criminal Law",
    "description": "<p>The Delhi High Court, in a ruling on July 15, 2025, quashed an FIR registered under Sections 69 and 351(2) of the Bharatiya Nyaya Sanhita, 2023, highlighting the misuse of criminal proceedings in disputes arising from a live-in relationship. The case involved Anil Verma, the petitioner, and Respondent No. 2, who had been in a 15-year relationship and cohabitating since 2019.</p>\n\n<p>The initial FIR, filed by the Respondent No. 2 due to misunderstandings, led to allegations of criminal offences. However, the parties subsequently reached an amicable settlement, with the complainant admitting the complaint was filed during a period of emotional distress and no longer wished to pursue the matter. Despite the State's opposition, arguing against setting a compromising precedent in cases involving alleged sexual exploitation, the Court recognized the complainant's autonomy and the personal nature of the dispute.</p>\n\n<p>Justice Swarana Kanta Sharma emphasized that forcing a trial after reconciliation would be counterproductive. However, acknowledging the severity of initiating criminal proceedings based on misunderstandings, the Court imposed a cost of ₹20,000 on the complainant, payable to the Delhi High Court Legal Services Committee, to discourage the casual use of criminal law. Consequently, FIR No. 154/2025 and all related proceedings were quashed. The Court cautioned against using criminal law as a tool for emotional leverage in personal relationships, particularly given the severe legal and reputational consequences.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/live-in-relationship-dispute.jpg"
  },
  {
    "title": "Overpricing Beyond MRP Violates Consumer Law: Thrissur Forum Orders Refund and Compensation",
    "description": "<p>The Consumer Disputes Redressal Commission in Thrissur has reaffirmed the significance of the Legal Metrology Act and consumer rights, ruling that charging even a single rupee over the Maximum Retail Price (MRP) on pre-packaged goods constitutes an unlawful and unfair trade practice. This decision reinforces the protection afforded by the Consumer Protection Act, emphasizing the importance of adhering to the MRP displayed on product packaging.</p>\n\n<p>The case originated when a consumer, Lenish V.R., was charged Rs. 800 for a brandy bottle with an MRP of Rs. 740 at a Kerala State Beverages Corporation (KSBC) outlet. Despite KSBC acknowledging the overcharge, they failed to provide evidence justifying the additional amount. The Commission found that the consumer successfully demonstrated the violation, shifting the burden of proof to KSBC, which they could not fulfill.</p>\n\n<p>The Commission emphasized that as per the Legal Metrology Act, 2009, and the Packaged Commodities Rules, 2011, retailers are prohibited from selling pre-packaged commodities above the MRP, except in cases of valid tax revisions within a specific timeframe, which KSBC could not prove. The Commission also noted that, as a government-owned entity, KSBC has a responsibility to act as a model vendor, upholding consumer rights and statutory norms without exception.</p>\n\n<p>The Commission directed KSBC to refund the excess amount of Rs. 60, provide Rs. 5,000 in compensation for mental distress, and cover Rs. 10,000 in litigation costs, all with interest. Additionally, KSBC was instructed to immediately cease the practice of overcharging for pre-packaged commodities. This ruling serves as a clear warning to retailers, particularly government-owned establishments, regarding the sanctity of MRP and empowers consumers to actively protect their rights against unfair trade practices.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/overpricing-beyond-mrp-violates-consumer-law.jpg"
  },
  {
    "title": "Stamp Duty and Registration Fee Exemption Notified for Life Mission Housing in Kerala",
    "description": "<p>The Government of Kerala has issued an order, effective from July 14, 2025, granting a two-year exemption from stamp duty and registration fees for beneficiaries of the Life Mission housing scheme acquiring land for residential purposes. This initiative, aimed at enhancing housing affordability for economically weaker sections, aligns with the state's commitment to social welfare and housing rights.</p>\n\n<p>The exemption is enabled by the Kerala Stamp Act, 1959, and the Registration Act, 1908, which empower the State Government to remit or reduce stamp duty and registration fees in the public interest. The Life Mission scheme, Kerala’s flagship housing program, aims to provide secure housing to landless and homeless families through financial assistance and infrastructure support.</p>\n\n<p>To avail of the exemption, beneficiaries must present a certificate from the District Collector or authorised Tehsildar confirming their status as a Life Mission beneficiary and the land's exclusive use for constructing a residential dwelling under the scheme. This exemption reduces the financial burden on beneficiaries, potentially saving them 8-10% of the transaction value, while requiring compliance with procedural requirements. Developers and NGOs involved in Life Mission projects should also factor this exemption into their processes, while the state foregoes revenue in favor of long-term social infrastructure development.</p>\n\n<p>This exemption represents a strategic regulatory intervention supporting inclusive housing by removing cost barriers for vulnerable households and reinforcing the State's focus on welfare-centric governance. Legal and compliance professionals should integrate this exemption into relevant transactions, ensuring timely compliance with certification requirements and transaction timelines.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/kerala-exempts-stamp-duty-for-life-mission-housing.jpg"
  },
  {
    "title": "Assam's Coaching Institutes Act: Raising the Bar for Regulation",
    "description": "<p>The Assam Coaching Institutes (Control and Regulation) Act, 2025, represents a significant legislative effort to regulate India's private coaching industry. The Act mandates registration for all coaching institutes operating in Assam and establishes comprehensive standards for academic quality, operational practices, safety, and ethical conduct. A key feature is the prohibition of misleading advertisements, aligning with the Consumer Protection (E-Commerce) Rules, 2020 and raising the regulatory benchmark for the sector.</p>\n\n<p>While primarily targeting brick-and-mortar coaching centers, the Act's implications extend to digital platforms and EdTech companies operating in or targeting Assam. These platforms must ensure that only registered institutes are promoted and avoid misleading claims in their advertising. Institutes are also required to maintain updated websites with disclosures on fees, faculty, and student outcomes, consistent with consumer protection norms.</p>\n\n<p>The Act establishes District Authorities with the power to conduct inspections, register complaints, and enforce penalties for non-compliance, including fines and potential imprisonment. Unlike other states with administrative guidelines, Assam's law provides a structured and enforceable framework, marking a shift toward greater compliance in the marketing and delivery of education in India.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/assams-new-coaching-regulation-law-explained.jpg"
  },
  {
    "title": "Divorce in the Digital Age: SC Allows Secretly Taped Calls Between Spouses",
    "description": "<p>In *Vibhor Garg v. Neha*, the Supreme Court of India ruled that secretly recorded telephonic conversations between spouses are admissible as evidence in matrimonial proceedings like divorce, clarifying a key point of law in the digital age. The Court held that spousal privilege under Section 122 of the Indian Evidence Act, 1872, does not bar such recordings when the dispute is between the spouses themselves.</p>\n\n<p>The case involved a husband seeking to introduce audio recordings as evidence of cruelty in divorce proceedings. The Supreme Court overturned a High Court decision that had disallowed the evidence based on privacy concerns, affirming the Family Court's initial decision to admit the recordings. The Court clarified that Section 122 contains an exception for suits between spouses, and the right to privacy under Article 21, while fundamental, is not absolute and must be balanced against the right to a fair trial.</p>\n\n<p>The Supreme Court reaffirmed the existing test for admitting secretly recorded conversations, emphasizing that lack of consent alone does not render evidence inadmissible. Further, electronic records, including audio recordings, are admissible under Sections 65A and 65B of the Evidence Act, provided the necessary certification is submitted. While not issuing binding procedural safeguards, the Court acknowledged the need for caution and suggested factors for Family Courts to consider when evaluating such evidence, including proportionality, intent, and evidentiary safeguards. The ruling balances the right to privacy with the imperatives of justice, allowing relevant evidence to be considered while acknowledging the potential for misuse.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/sc-validates-secretly-recorded-telephonic-conversation.jpg"
  },
  {
    "title": "FSSAI Implements Strict Scrutiny of Annual Returns with Limited Correction Window",
    "description": "<p>The Food Safety and Standards Authority of India (FSSAI) has mandated a rigorous scrutiny regime for Annual Returns (ARs) filed by Food Business Operators (FBOs), effective July 7, 2025. This initiative aims to ensure accurate and truthful reporting as required by Clause 2.1.13 of the 2011 Licensing Regulations and subsequent orders mandating online filing via FoSCoS.</p>\n\n<p>Licensing Authorities are now required to meticulously verify all aspects of the AR, including production figures and compliance data. Discrepancies or false declarations will result in penal action under Section 61 of the FSS Act, 2006. While a paid correction window exists for FBOs to rectify errors, strict adherence to accurate record-keeping and timely corrections via FoSCoS is crucial.</p>\n\n<p>The new measures emphasize the importance of disciplined compliance for FBOs. Accurate disclosures are now non-negotiable, and failure to comply may lead to fines, suspension, or cancellation of licenses. By prioritizing verifiable records and utilizing the correction window, FBOs can maintain legal standing and enhance consumer trust.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/fssai-on-annual-returns-of-food-businesses.jpg"
  },
  {
    "title": "Trademark Protection Upheld: Himachal Pradesh High Court Grants Relief to Old Monk Manufacturer",
    "description": "<p>The Himachal Pradesh High Court recently issued an interim order in a trademark infringement case, restraining Eston Roman Brewery & Distillery Pvt. Ltd. from manufacturing and selling its \"Old Mist\" coffee rum. The ruling supports Mohan Meaking Ltd., the manufacturer of the globally recognized \"Old Monk\" coffee-flavored rum, finding a prima facie case of infringement.</p>\n\n<p>Mohan Meaking Ltd. initiated the suit against Eston Roman Brewery, alleging that the defendant's \"Old Mist\" product closely resembled their registered trademark, \"Old Monk Coffee.\" The plaintiff's trademark is valid until 2031, while the defendant possesses no such registration. The plaintiff argued that the visual and conceptual similarity between the products could mislead consumers, potentially damaging the plaintiff's brand reputation as the third-largest rum manufacturer globally.</p>\n\n<p>After examining the products, labels, and trademark certificates, the Court determined that Mohan Meaking Ltd. had established a strong case for trademark infringement. The Court expressed concern that the defendant's continued sales would result in unfair advantage, passing off, and irreparable harm to the plaintiff's established goodwill. Consequently, the Court granted the interim injunction, preventing the defendant from selling or distributing the infringing product until further notice, emphasizing the importance of protecting established trademarks within the liquor industry.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/old-monk-trademark-gets-relief-in-hp.jpg"
  },
  {
    "title": "Beyond the Marriage: Gujarat High Court Clarifies Scope of Dowry Death Law",
    "description": "<p>The Gujarat High Court, in *State of Gujarat v. Natubhai Golanbhai Khuman & Ors.*, upheld the acquittal of the accused in a dowry death case, emphasizing the necessity of strong evidence for convictions under Sections 304B, 306, 498A, and 114 of the IPC. The case involved a woman who allegedly committed suicide after her in-laws demanded money for legal expenses.</p>\n\n<p>The prosecution argued that the in-laws harassed the woman to procure ₹50,000 from her father for bail in an unrelated land forgery case, leading her to take her own life. Initially, the FIR was registered under Sections 306 and 498A IPC, and later Section 304B was added, but the trial court acquitted the accused due to lack of evidence.</p>\n\n<p>The High Court affirmed the acquittal, clarifying that not every post-marital demand qualifies as \"dowry\" under the Dowry Prohibition Act, 1961. The court reasoned that the demand for bail money was a post-marital financial dispute, not a dowry demand made \"in connection with the marriage.\" However, the court also cautioned that while the demand didn't constitute dowry, the conduct could still amount to \"cruelty\" under Section 498A or abetment to suicide under Section 306, provided sufficient evidence exists. The court's decision was based on unproven medical causes of death, a lack of credible evidence of financial harassment, and accused having sufficient funds that contradicted the prosecution's narrative.</p>\n\n<p>The judgment underscores the importance of prosecutors carefully framing charges, gathering reliable evidence, and distinguishing between dowry-linked demands and other forms of oppressive conduct. While the decision is legally sound regarding Section 304B, it should not diminish the seriousness of non-dowry related cruelty, which remains actionable under other IPC provisions.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/gujarat-hc-clarifies-dowry-death-law.jpg"
  },
  {
    "title": "Maharashtra Government Grants Full Stamp Duty Remission for Integrated Township Projects in MMR",
    "description": "<p>The Maharashtra government has announced a complete remission of stamp duty on the first instrument of conveyance for designated land parcels within the Mumbai Metropolitan Region (MMR) aimed at Integrated Township Projects. This decision, formalized through an order issued on July 7, 2025, by the Revenue and Forests Department, builds upon a previous order from June 20, 2023, which had already reduced stamp duty by 50% for properties within Development and Regional Plans approved for Integrated Township Projects.</p>\n\n<p>The full remission specifically applies to the development of Growth Centers within the MMR by the Mumbai Metropolitan Region Development Authority (MMRDA), executed through a Special Purpose Vehicle (SPV), M/s. Raigad Pen Growth Centre Ltd. This concession, deemed necessary in the public interest, covers the remaining 50% of the stamp duty for the initial conveyance related to 1217.71 acres of land parcels explicitly identified in the joint venture agreement and approved under the Maharashtra Regional and Town Planning Act, 1966. The conditions outlined in the June 20, 2023, order remain applicable.</p>\n\n<p>This complete stamp duty remission provides a significant financial incentive for large-scale integrated township projects by eliminating a substantial transaction cost. It is anticipated to accelerate development, attract greater investment in urban infrastructure, and contribute to meeting the growing demand for well-planned residential, commercial, and recreational spaces in the MMR. Stakeholders should carefully review the details of this order, in conjunction with the stipulations of the June 20, 2023, order, to maximize its benefits.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/stamp-duty-remission-for-integrated-township-projects-in-mmr.jpg"
  },
  {
    "title": "No Payout for Peril: Supreme Court Says Heirs Can’t Claim Insurance for Driver’s Own Negligence",
    "description": "<p>The Supreme Court of India upheld the Karnataka High Court's decision, reinforcing the principle that the legal heirs of a person who dies due to their own negligent driving cannot claim compensation under the Motor Vehicles Act, 1988. The case, *G Nagarathna & Ors. vs. G Manjunatha & Anr.*, stems from a fatal accident where the driver's excessive speed and traffic violations led to his death. His family's claim for compensation was rejected by both the Motor Accidents Claims Tribunal and the High Court.</p>\n\n<p>The Supreme Court, in dismissing the family's appeal, affirmed the established tort law principle that individuals cannot benefit from their own wrongdoing. The Court reasoned that a borrower of a vehicle assumes the responsibilities and risks of ownership, including the duty to drive safely. Awarding compensation in such cases would contradict fundamental tort principles and public policy.</p>\n\n<p>This ruling clarifies that while the legal heirs of a negligent driver cannot claim compensation for the driver’s death, valid claims made by third parties injured due to the deceased’s negligence remain actionable under the Motor Vehicles Act. The decision discourages reckless driving and safeguards the integrity of the insurance system by preventing individuals from profiting from their own negligent acts. It ensures that the compensation framework isn't an unintended incentive for unlawful behavior on the roads, and reinforces accountability under the Motor Vehicles Act.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/no-insurance-drivers-own-negligence.jpg"
  },
  {
    "title": "The Pataudi Legacy on Trial: Saif Ali Khan, Bhopal Royal Properties, and the Enemy Property Law",
    "description": "<p>The Madhya Pradesh High Court has overturned a 2000 trial court judgment, reopening a long-standing inheritance dispute involving properties worth ₹15,000 crore belonging to the former Bhopal royal family. The case involves Saif Ali Khan, his mother Sharmila Tagore, and sisters Soha and Saba Ali Khan, who were previously recognized as the lawful heirs. This decision emphasizes the primacy of personal succession laws over customary or royal succession norms, potentially setting a precedent for similar princely inheritance disputes.</p>\n\n<p>The dispute centers on the estate of Nawab Mohammad Hamidullah Khan, the last ruling Nawab of Bhopal.  While Sajida Sultan was initially recognized as the legal successor, other heirs filed partition suits in 1999, arguing for distribution under Muslim Personal Law. The High Court's ruling highlighted that the original trial court's decision was flawed because it relied on a precedent overturned by the Supreme Court in 2019, which affirmed that personal law governs inheritance, even for former royal families. The case has been remanded for a fresh trial, with all parties permitted to present new evidence.</p>\n\n<p>A crucial legal dimension involves the Enemy Property Act 1968, potentially impacting claims derived through Abida Sultan, who acquired Pakistani citizenship. This act could lead to the forfeiture of her share, vesting it in the Custodian of Enemy Property. The High Court's decision mandates the Pataudi family to reassert their claim under Muslim Personal Law, subject to judicial scrutiny and potential reallocation. This ruling is likely to influence other royal inheritance disputes across India, reinforcing that post-accession private properties are governed by statutory personal laws, not royal customs. The case highlights the judiciary's commitment to modern legal standards over historical privileges, potentially reshaping the legal framework surrounding former royal estates and reconciling tradition with constitutional modernity.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/saif-ali-khan-and-enemy-property-law-dispute.jpg"
  },
  {
    "title": "No Right to Reschedule Exams: Chhattisgarh HC Clarifies Scope of UGC’s Dual Degree Flexibility",
    "description": "<p>The Chhattisgarh High Court, in *Satyendra Prakash Suryawanshi v. State of Chhattisgarh & Ors.*, clarified the scope of the UGC's dual degree policy, stating that students pursuing two degrees simultaneously cannot demand judicial intervention to reschedule examinations due to overlapping schedules. The court emphasized that while the NEP 2020 and associated UGC guidelines permit dual enrollment, the responsibility for managing conflicting schedules lies with the student.</p>\n\n<p>The case arose from a petitioner enrolled in both a Master of Social Work program and an LL.B. program, whose final examination schedules clashed. He argued that this infringed upon his fundamental right to education. However, the court rejected this argument, asserting that the right to education does not extend to compelling universities to adjust their administrative functions for individual benefit.</p>\n\n<p>The ruling reinforces that universities retain administrative autonomy and are not legally obligated to modify examination schedules for individual student's convenience. The judgment serves as a caution to students, highlighting the need for careful planning and management of multiple academic commitments when pursuing dual degrees under the UGC framework. The court underscored that it will not intervene in the day-to-day administration of academic institutions to accommodate personal convenience.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/no-rescheduling-ugc-dual-degree.jpg"
  },
  {
    "title": "Chandigarh Administration Introduces Motor Vehicles Aggregators Rules, 2025",
    "description": "<p>The Chandigarh Administration has unveiled the Motor Vehicles Aggregators Rules, 2025, to regulate and streamline aggregator operations within the Union Territory. These rules, notified under the Motor Vehicles Act, 1988, and aligned with the Motor Vehicles Aggregator Guidelines, 2020, prioritize safety, security, and welfare for both passengers and drivers, while promoting electric and alternative fuel vehicles.</p>\n\n<p>The regulations define \"aggregator\" as a digital intermediary connecting passengers with drivers. They establish eligibility criteria for aggregators, requiring registration under the Companies Act or as cooperative societies with offices in India and Chandigarh, compliance with the Motor Vehicles Act and IT Act, and possession of a valid license. License conditions include driving test facilities, driver induction training, and adherence to health and safety guidelines.</p>\n\n<p>The rules address driver and vehicle compliance, mandating valid licenses, driving experience, medical examinations, and police verification for drivers, along with vehicle registration, permits, fitness certificates, and location tracking devices for vehicles. The regulations also emphasize transparency in operations, including fare structures, driver payments, and 24/7 call center support. Ride-pooling is permitted, with options for female-only pools, and a non-discrimination policy is in place.</p>\n\n<p>Taxi fares are regulated, allowing aggregators to charge up to 20% less than the notified fare, with drivers receiving at least 80% of the total fare. Penalties are in place for unwarranted cancellations. The Licensing Authority has broad powers, and appeals against its orders are permitted. The rules are applicable to all aggregators using on-boarding transport vehicles in Chandigarh, including various vehicle types, ensuring comprehensive regulation and monitoring of aggregator operations within the territory.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/motor-vehicles-aggregators-rules.jpg"
  },
  {
    "title": "Corruption Calls Cost You Privacy: Delhi High Court Draws the Line",
    "description": "<p>The Delhi High Court has upheld the CBI's interception of telephonic conversations in a corruption probe, ruling that the right to privacy, while fundamental, is not absolute and can be curtailed when corruption threatens public safety and economic stability. The decision in *Aakash Deep Chouhan v. CBI & Anr.* clarifies the circumstances under which wiretapping is justified under the Indian Telegraph Act, 1885.</p>\n\n<p>The case arose from an FIR against the accused for allegedly conspiring to bribe a public servant to secure a sub-contract. The CBI relied on intercepted calls between the accused, leading the petitioner to challenge the legality of the interceptions, arguing they violated his right to privacy and did not meet the requirements of the Indian Telegraph Act. The CBI countered that corruption impacts national economic safety, satisfying the public safety threshold, and that the interceptions were duly authorized and reviewed.</p>\n\n<p>Justice Amit Mahajan dismissed the plea, stating that corruption involving public servants has far-reaching consequences on economic well-being and can qualify as a threat to public safety. The court found the interception orders specified \"public safety\" as the ground and met the conditions under Section 5(2) of the Act. The ruling contrasts with a recent decision by the Madras High Court, which quashed a phone-tapping order in a corruption case, emphasizing the need for a clear public emergency or evident risk to public safety.</p>\n\n<p>This judgment reaffirms the balance between privacy rights and the need to investigate corruption that undermines public institutions and economic security. It suggests that courts may interpret “public safety” broadly in cases of significant economic offenses, serving as a caution to companies and executives that conversations related to economic crimes may be grounds for surveillance if statutory procedures are followed. The Delhi High Court's decision reinforces that when fighting corruption that poses a systemic threat, the scales may tip in favor of public safety, provided procedural safeguards for privacy are respected.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/corruption-calls-delhi-hc-rules.jpg"
  },
  {
    "title": "Rajasthan Eases Night Work Restrictions for Women in Commercial Establishments",
    "description": "<p>The Rajasthan Labour Department, effective July 8, 2025, has issued a notification allowing registered shops and commercial establishments to employ women during night hours under specified conditions, according to the Rajasthan Shops and Commercial Establishments Act, 1958. Employers must obtain explicit consent from women employees and provide appointment letters and photo ID cards.</p>\n\n<p>The notification emphasizes the employer's responsibility for the safety and security of women working at night. This includes providing safe transportation to and from work, separate restrooms and lockers, and maternity protection, exempting pregnant women from night duty three months before and after childbirth.</p>\n\n<p>Stringent measures to prevent sexual harassment are mandated, and any violation of these conditions will result in the automatic termination of the exemption, with the employer held responsible for legal action. The notification, issued by the order of the Governor aims to balance flexibility for businesses with the safety and welfare of women employees.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/night-work-restrictions-for-women.jpg"
  },
  {
    "title": "Child of Inter-Caste Parents Not Automatically Entitled to SC Certificate: Bombay High Court Clarifies",
    "description": "<p>The Bombay High Court has ruled that children of inter-caste parents, including those with one parent belonging to a Scheduled Caste (SC), are not automatically entitled to SC status. In *Sujal Mangala Birwadkar v. State of Maharashtra & Ors.*, the court dismissed a student's plea for a Chambhar (SC) caste validity certificate, emphasizing the need to prove actual social discrimination, disadvantage, or deprivation associated with the caste.</p>\n\n<p>The petitioner, born to a Hindu Agri (upper-caste) father and a Chambhar (SC) mother, argued that he should be considered Chambhar due to being raised solely by his mother after his parents' divorce. He claimed to have experienced deprivation and humiliation linked to his mother's community. However, the court found no evidence to support these claims, noting that the petitioner had good educational opportunities and his mother was financially independent. Additionally, school records initially identified him as Hindu Agri.</p>\n\n<p>The court reiterated that a mere biological connection to a backward community is insufficient. Claimants must demonstrate systemic social disadvantage linked to that community status to claim reservation benefits. The decision underscores that caste identity under constitutional law is not simply a matter of convenience but must be rooted in demonstrable social realities, ensuring that affirmative action benefits those genuinely suffering from social discrimination and backwardness. The judgment clarifies that social context and lived experience are central to determining caste validity.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/scheduled-caste-claim-denied-for-inter-caste-child.jpg"
  },
  {
    "title": "Insolvency and Bankruptcy Board of India Strengthens Corporate Insolvency Resolution Process with New Amendments",
    "description": "<p>The Insolvency and Bankruptcy Board of India (IBBI) has amended the Insolvency Resolution Process for Corporate Persons Regulations, 2016 (CIRP Regulations), effective July 4th, 2025. These amendments focus on bolstering transparency, accountability, and the handling of avoidance transactions within the corporate insolvency resolution process.</p>\n\n<p>A key change involves enhanced disclosure requirements for the Information Memorandum (IM). Resolution Professionals (RPs) are now obligated to include comprehensive details of identified avoidance transactions, fraudulent activities, or wrongful trading within the IM. This includes transactions potentially designed to defraud or unfairly disadvantage creditors. The RP must also keep the IM updated and provide it periodically to the Committee of Creditors (CoC), ensuring access to current and comprehensive information for informed decision-making.</p>\n\n<p>Furthermore, the amendments address the treatment of disclosed transactions in the resolution plan, restricting the assignment of any avoidance transactions or fraudulent or wrongful trading. The objective is to guarantee stakeholders are fully aware of potentially problematic transactions, enabling better decisions and maximizing the value of the corporate debtor's assets.</p>\n\n<p>The amendments are designed to facilitate informed decision-making by the CoC and resolution applicants, enhance transparency and accountability in the insolvency resolution process, and maximize the value of the corporate debtor’s assets through better price discovery. By mandating enhanced disclosure and regulating the treatment of disclosed transactions, the IBBI aims to foster a more transparent and accountable insolvency resolution process, thereby protecting the interests of creditors and other stakeholders.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/corporate-insolvency-resolution-process.jpg"
  },
  {
    "title": "Telangana Government Eases Working Hours for Commercial Establishments",
    "description": "<p>The Telangana government has introduced reforms to enhance the ease of doing business by allowing employees in commercial establishments (excluding shops) to work up to 10 hours per day, with a weekly limit of 48 hours. This change, implemented through a notification by the Labour, Employment, Training & Factories Department under the Telangana Shops and Establishments Act, 1988, exempts commercial establishments from certain sections of the act to provide more flexible working hours.</p>\n\n<p>Under these new regulations, employees are entitled to overtime wages for work exceeding the stipulated limits, and a mandatory 30-minute rest interval is required after six hours of work. The total work period, including rest, cannot exceed twelve hours per day. While employees can work beyond 48 hours per week with overtime pay, a quarterly limit of 144 overtime hours is enforced.</p>\n\n<p>To ensure compliance, the government has established oversight mechanisms, including the revocation of exemption orders for any violations. Published in the Telangana Gazette on July 8, 2025, these reforms aim to promote economic growth by supporting business efficiency while maintaining fair labor practices and protecting employee rights.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/telangana-eases-working-hours-for-commercial-establishments.jpg"
  },
  {
    "title": "India's PM E-DRIVE Scheme: Incentives for Electric Trucks",
    "description": "<p>The Ministry of Heavy Industries (MHI) has announced specific guidelines for electric trucks (e-trucks) under the PM Electric Drive Revolution in Innovative Vehicle Enhancement (PM E-DRIVE) Scheme, aiming to promote sustainable transport and domestic manufacturing. Effective July 10, 2025, the notification (S.O. 3081(E)) details eligibility, demand incentives, phased manufacturing requirements, and compliance conditions for N2 and N3 category e-trucks, supplementing the broader PM E-DRIVE Scheme. Incentives for articulated vehicles in the N3 category will apply exclusively to the “puller tractor.\"</p>\n\n<p>Incentives will be calculated based on the lowest of the set parameters. A key prerequisite for availing incentives is mandatory vehicle scrappage, requiring manufacturers to submit a Certificate of Deposit from an authorized Registered Vehicle Scrapping Facility (RVSF) for an equivalent or higher GVW ICE truck. Eligible e-trucks must meet stringent performance and efficiency criteria, including electric regenerative braking systems and compliance with AIS 039 and CMVR norms. A minimum warranty is also mandated.</p>\n\n<p>The scheme emphasizes progressive domestic manufacturing via a Phased Manufacturing Programme (PMP) and its verification. With a total outlay of ₹500 crore, the scheme aims to support 5,643 e-trucks in FY 2025–26, subject to a maximum ex-factory price cap of ₹1.25 crore per vehicle.</p>\n\n<p>The PM E-DRIVE e-truck notification aligns with various legal and policy frameworks, including the Central Motor Vehicles Rules, 1989, the Motor Vehicles Act, 1988, the CGST Act, 2017, and the General Financial Rules (GFR), 2017, building upon the legacy of the FAME India scheme. This initiative signifies a strong push towards decarbonizing India's heavy-duty freight sector, stimulating demand, ensuring environmental compliance, and boosting indigenous EV component manufacturing.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/incentives-for-e-trucks-pm-e-drive.jpg"
  },
  {
    "title": "Judicial Clarification on OPC Liability in Arbitration: Bombay High Court in Saravana Prasad v. Endemol India Pvt. Ltd.",
    "description": "<p>The Bombay High Court, in *Saravana Prasad v. Endemol India Pvt. Ltd.*, has clarified the liability of One Person Companies (OPCs) and their sole shareholders in arbitration proceedings. The Court set aside an arbitral tribunal's interim order imposing personal deposit and disclosure obligations on Mr. Saravana Prasad, the sole shareholder of Innovative Film Academy Pvt. Ltd. (an OPC), reaffirming the principle of limited liability under Indian corporate law.</p>\n\n<p>The dispute arose from a production agreement between Innovative and Endemol, resulting in ₹10.40 crores in unpaid invoices. The arbitral tribunal's interim order, under Section 17 of the Arbitration and Conciliation Act, 1996, directed both Innovative and Mr. Prasad to deposit the disputed amount and disclose assets.</p>\n\n<p>The Court ruled that while requiring Innovative to secure the disputed amount was fair, extending this obligation to Mr. Prasad personally was unsustainable. It emphasized that an OPC is a distinct legal entity under Section 2(62) of the Companies Act, 2013, offering limited liability. Being a sole shareholder or director does not equate to personal liability absent contractual liability, fraud, or misuse. Imposing personal obligations on Mr. Prasad undermined the legislative intent behind OPCs.</p>\n\n<p>The Bombay High Court partially allowed the appeal, setting aside the personal obligations imposed on Mr. Prasad while upholding the requirements for Innovative. This ruling reaffirms corporate separateness and limited liability, protecting individual entrepreneurs in OPCs from personal financial exposure unless specific legal thresholds are met.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/saravana-prasad-v-endemol-india-pvt-ltd.jpg"
  },
  {
    "title": "FSSAI Enhances Food Safety Standards for E-commerce Platforms in India",
    "description": "<p>The Food Safety and Standards Authority of India (FSSAI) has issued stringent directives to enhance food safety standards on e-commerce platforms nationwide. This initiative followed a meeting held on July 8, 2025, with over 70 representatives from leading e-commerce companies, emphasizing the critical importance of food safety within the rapidly growing online food supply chain.</p>\n\n<p>Key directives issued by the FSSAI require e-commerce platforms to prominently display their FSSAI license/registration numbers on all receipts and invoices, along with information about the Food Safety Connect App. Platforms must also disclose comprehensive details and regular photographic updates of all warehouses and storage facilities on the FoSCoS portal. Discussions included the potential display of “Date of Expiry/Use By” information for food products at the consumer interface.</p>\n\n<p>Furthermore, the FSSAI mandates strict adherence to hygiene and food safety protocols in all warehouses, compulsory FoSTaC training for all food handlers, and meticulous compliance with all SOPs under the FSS Act. Platforms are also required to share relevant data regarding warehouses and food handlers with the FSSAI to enhance transparency and accountability.</p>\n\n<p>The FSSAI emphasized that food safety is a collective responsibility, involving all entities in the supply chain. This proactive approach aims to guarantee that consumers receive safe and healthy food products purchased through e-commerce, reinforcing FSSAI's commitment to public health and consumer trust in the evolving landscape of online food delivery.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/food-safety-for-e-commerce.jpg"
  },
  {
    "title": "Bombay High Court Balances Redevelopment Rights with Possessory Protection in Matrimonial Dispute",
    "description": "<p>The Bombay High Court, in *Ritesh Haldar v. Elite Housing LLP*, ruled that redevelopment processes cannot circumvent legal eviction procedures for individuals in lawful possession, even without ownership. The case involved competing claims to a flat undergoing redevelopment, focusing on the intersection of matrimonial rights, property possession, and redevelopment logistics.</p>\n\n<p>The dispute centered on a flat being redeveloped by Elite Housing LLP, where Leena, the wife of one of the owner's brothers, resided with her children, claiming it as her matrimonial home. While she didn't claim ownership, she opposed the redevelopment without compensation and alternate accommodation. Ritesh, claiming ownership, sought to hand over the flat, viewing Leena as a gratuitous licensee.</p>\n\n<p>The court emphasized that redevelopment cannot replace formal eviction processes, reinforcing that Leena's eviction required a court decree. The court cited precedents highlighting that the person in actual possession at the time of redevelopment is entitled to transit rent and restoration of possession in the redeveloped property. While acknowledging Ritesh's ownership, the court directed the Permanent Alternate Accommodation Agreement (PAAA) be executed in his name, and that he receive hardship compensation, but this did not affect Leena’s possessory rights.</p>\n\n<p>Ultimately, the Court endorsed a dual-track approach, recognizing Ritesh’s rights as legal owner for purposes of contractual execution and compensation, while protecting Leena’s possessory rights during and after redevelopment. Leena will receive transit rent and possession of the redeveloped flat, subject to the outcome of an existing eviction suit. The ruling underscores the importance of lawful possession and due legal process in redevelopment projects, balancing ownership rights with possessory protection.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/redevelopment-rights-in-matrimonial-dispute.jpg"
  },
  {
    "title": "Allahabad HC Denies Bail, Orders Rapid Trial in Digital Crime Case Involving Obscene Image Circulation",
    "description": "<p>The Allahabad High Court denied bail to Ramdev, the primary accused in a case involving the unauthorized circulation of a woman's obscene images on WhatsApp. Justice Ajay Bhanot emphasized the judiciary's firm stance against cyber-enabled offenses, cautioning against the misuse of digital technologies that can inflict irreversible damage.</p>\n\n<p>The case, registered as Case Crime No. 5 of 2025, involves charges under the Bharatiya Nyaya Sanhita 2023 and the Information Technology Act, 2000. The prosecution is supported by digital evidence, including explicit photographs recovered from Ramdev's device, currently undergoing analysis at the Forensic Science Laboratory (FSL). The court expressed concern over the weaponization of digital tools for non-consensual sharing of private content, highlighting the trauma and virality associated with such acts.</p>\n\n<p>The High Court, in its June 2, 2025 ruling, cited the severity of the charges, the strength of digital evidence, and the risk of misuse as factors against granting bail. The court directed the trial court to conclude proceedings within one year. To expedite the process, the Deputy Director of the FSL was ordered to submit the final report within two months. The court also mandated strict witness management and empowered the trial court to impose costs for unwarranted delays. Police authorities were instructed to execute warrants promptly, and the Commissioner of Police, Prayagraj, must submit periodic affidavits on the execution status.</p>\n\n<p>The Allahabad High Court's order signifies a commitment to addressing cyber-crimes effectively and promptly, combining judicial scrutiny, digital-forensic prioritization, and institutional accountability.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/hc-acts-swiftly-in-digital-crime-case.jpg"
  },
  {
    "title": "Enabling the 24-Hour Workforce: Haryana’s 2025 Notification Opens Night Shifts to Women Workers",
    "description": "<p>The Haryana Labour Department issued a notification on July 4, 2025, permitting women to work night shifts (7:00 PM to 6:00 AM) in factories, marking a significant step toward gender inclusivity. This policy aligns with the growing trend of balancing equal opportunity with necessary workplace protections.</p>\n\n<p>Historically, Section 66(1)(b) of the Factories Act, 1948, restricted women from working night shifts, but this provision has been challenged as discriminatory. The Haryana notification, issued under No. 11/6/2022-4Lab, supersedes previous notifications and sets forth comprehensive conditions for factories employing women at night.</p>\n\n<p>Key requirements include voluntary written consent from women workers, full compliance with the POSH Act, enhanced workplace safety measures including CCTV surveillance, mandatory transportation, readily available medical assistance, and adherence to all applicable labor laws, including the Factories Act, 1948 and the Equal Remuneration Act. Employers must also report any untoward incident immediately, implement a self-certification mechanism, and be aware that the government may impose additional conditions. The exemption granted is valid for one year.</p>\n\n<p>This notification represents a progressive move, removing outdated restrictions while enhancing employer accountability. It positions Haryana alongside states like Maharashtra, Tamil Nadu, Karnataka, and Uttar Pradesh, which have similar exemptions, and supports India's expanding manufacturing base by promoting economic participation and gender justice in industrial employment.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/haryana-opens-night-shifts-for-women.jpg"
  },
  {
    "title": "Calcutta High Court Upholds Arbitration Clause in Purchase Order: *Super Smelters Ltd. v. Universal Cables Ltd.*",
    "description": "<p>The Calcutta High Court, in *Super Smelters Limited v. Universal Cables Limited*, addressed the enforceability of an arbitration clause within a purchase order. The court ruled in favor of the arbitration clause and appointed a sole arbitrator under Section 11 of the Arbitration and Conciliation Act, 1996. The central issue was whether an arbitration clause in the purchase order remained binding despite a jurisdiction clause in a subsequent tax invoice.</p>\n\n<p>The petitioner, Super Smelters Ltd., initiated a tender, which led to a purchase order (P119Y-00458) issued to the respondent, Universal Cables Ltd. Disputes arose concerning the functionality of capacitor panels supplied by the respondent, which led to the petitioner terminating the purchase order and demanding a refund. When the respondent disputed this termination and demanded further payment, the petitioner invoked the arbitration clause contained in the initial purchase order.</p>\n\n<p>The court determined that the purchase order was the primary agreement and that the conduct of the parties indicated mutual consent to its terms, including the arbitration clause. The tax invoice, unilaterally issued later by the respondent, was deemed ancillary and could not override the previously agreed-upon arbitration clause. The Court distinguished precedents cited by the respondent, emphasizing that those cases pertained to summary suits and did not concern the prioritization of arbitration clauses in conflicting documents. The court clarified that its role under Section 11 is limited to a prima facie examination of whether a valid arbitration agreement exists and does not entail a detailed trial or analysis of the merits.</p>\n\n<p>Ultimately, the Calcutta High Court upheld the validity of the arbitration clause in the purchase order, emphasizing its significance in the contractual agreement. The Court appointed Mr. Amitesh Banerjee, Senior Advocate, as the sole arbitrator, deferring all further objections, including those related to jurisdiction and arbitrability, to the arbitrator for resolution in accordance with the law.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/arbitration-clause-in-purchase-order.jpg"
  },
  {
    "title": "Reclaiming Forgotten Freedoms: CJI Gavai Revives ‘Bail is the Rule’ at Krishna Iyer Memorial",
    "description": "<p>CJI BR Gavai, at the 11th Justice VR Krishna Iyer Memorial Law Lecture, acknowledged a recent deviation from the fundamental principle of \"bail is the rule, jail is the exception\" within the Indian legal system. He highlighted his efforts to reinstate this principle through recent adjudications in high-profile bail cases, including those of Prabir Purkayastha, Manish Sisodia, and K Kavitha, emphasizing the enduring relevance of Justice Krishna Iyer's contributions to bail jurisprudence and prisoners' rights.</p>\n\n<p>The lecture, hosted by the Sarada Krishna Satgamaya Foundation for Law and Justice, underscored Justice Iyer's pioneering work advocating for a progressive, rights-based approach to bail, emphasizing protective yet non-onerous bail conditions and opposing extended pre-trial detention. CJI Gavai lamented the erosion of this approach, noting that courts often defaulted to incarceration. He pointed out that in sensitive cases in 2024, his benches scrutinized the legality of arrests and addressed procedural lapses by investigating agencies.</p>\n\n<p>CJI Gavai's remarks echoed concerns about the misuse of stringent laws like the UAPA and PMLA, where the presumption often shifts towards \"jail is the rule.\" He reiterated Justice Krishna Iyer's philosophy that undertrials should not be indefinitely detained, and bail conditions should not be punitive, especially for the poor. Highlighting Justice Iyer’s humanistic approach, the CJI cited landmark judgments that championed the protection of personal liberty and dignity. The CJI's address serves as a reminder for courts to recenter bail as the norm, even under harsh statutes, and for investigating agencies to uphold procedural safeguards. His address serves as a compelling call for the judiciary to balance security concerns with individual liberty, continuing to illuminate the path toward a humane and rights-respecting legal system.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/cji-gavai-reasserts-bail-is-the-rule.jpg"
  },
  {
    "title": "IndiaLaw Monthly Newsletter – June Edition: Corporate & Commercial Highlights",
    "description": "<p>This newsletter summarizes key legal and regulatory updates in India's corporate and commercial landscape.</p>\n\n<p>The Reserve Bank of India (RBI) has mandated Know Your Customer (KYC) compliance and enhanced monitoring for Aadhaar-enabled Payment System (AePS) operators. This new compliance framework is set to take effect in January 2026, aiming to bolster security and transparency within the digital payment ecosystem.</p>\n\n<p>The Unique Identification Authority of India (UIDAI) has notified the first amendment to the Aadhaar Regulations, 2025. This amendment introduces changes impacting both individuals and institutions utilizing the Aadhaar system, the specifics of which are detailed in the full notification.</p>\n\n<p>The Calcutta High Court has reaffirmed the enforceability of arbitration clauses within purchase orders. The ruling in *Super Smelters Ltd. v. Universal Cables Ltd.* reinforces the importance of upholding contractual agreements for dispute resolution.</p>\n\n<p>Finally, a recent legal analysis clarifies the threshold for establishing pre-existing disputes under Section 8(2)(a) of the Insolvency and Bankruptcy Code (IBC). The analysis cautions against relying on vague communications, such as WhatsApp messages, as sufficient proof of a pre-existing dispute.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/indialaw-monthly-newsletter-june-edition.jpg"
  },
  {
    "title": "New Guidelines for Real Estate Advertisements in Tamil Nadu: Ensuring Transparency and Compliance",
    "description": "<p>The Tamil Nadu Real Estate Regulatory Authority (TNRERA) has issued new guidelines, effective July 1, 2025, amending Regulation 6 of the TNRERA (General) Regulations, 2018, to enhance transparency and protect consumer interests in the real estate sector. These guidelines mandate specific inclusions in all real estate advertisements across print, electronic, social media, and online platforms.</p>\n\n<p>The new regulations require advertisements to prominently display the TNRERA registration number with a QR code, along with the Authority’s website address. Specific font sizes and placement rules are stipulated for print media, brochures, and outdoor publicity. Electronic media advertisements must clearly state the RERA registration number and website address. Social media and online property sites must also include the RERA registration number, website link, promoter details, accurate project location, and a clear indication of promised amenities as defined in the agreement or brochure.</p>\n\n<p>Strict compliance is emphasized, with penalties for violations under the Real Estate (Regulation and Development) Act, 2016. Media houses are also responsible for ensuring compliance. This move aims to foster a fair and regulated real estate market by ensuring clarity, accuracy, and transparency in all advertising efforts.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/rules-for-real-estate-advertisements.jpg"
  },
  {
    "title": "UIDAI Notifies First Amendment to Aadhaar Regulations, 2025: Implications for Individuals and Institutions",
    "description": "<p>On July 2, 2025, the Unique Identification Authority of India (UIDAI) issued the Aadhaar (Enrolment and Update) First Amendment Regulations, 2025, under Section 54(1) and (2) of the Aadhaar Act, 2016. These amendments aim to bolster identity integrity, streamline documentation, and rationalize Aadhaar procedures. The changes particularly impact Regulation 27 and Schedule II, and are relevant for entities across sectors including banking, fintech, insurance, education, HR, and immigration.</p>\n\n<p>The amendment addresses the issue of multiple Aadhaar numbers issued to the same person. It stipulates that when multiple Aadhaar numbers are found for a single individual, the earliest assigned Aadhaar number containing biometric information will be retained, and all others will be deactivated. If no Aadhaar number contains biometric data, the earliest assigned number will be retained.</p>\n\n<p>Furthermore, the notification replaces Schedule II with a comprehensive list of acceptable documents for enrolment and updates, categorized by specific parameters and includes special provisions. Entities relying on Aadhaar for authentication must update their systems, retrain staff, and conduct compliance audits to align with the new regulations. Failure to comply could lead to operational disruptions and regulatory scrutiny.</p>\n\n<p>In conclusion, the 2025 amendment to the Aadhaar (Enrolment and Update) Regulations enhances the reliability of Aadhaar-based identification by clarifying the treatment of multiple Aadhaar numbers and standardizing required documentation. Regulated entities must promptly update their compliance frameworks to ensure lawful use of Aadhaar credentials and mitigate associated risks.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/uidai-aadhaar-rules-amended.jpg"
  },
  {
    "title": "Determining Pre-Existing Disputes Under Section 8(2)(a) of the IBC: The Vague WhatsApp Message don’t prove pre-existing dispute",
    "description": "<p>In a recent ruling, the National Company Law Appellate Tribunal (NCLAT) overturned a National Company Law Tribunal (NCLT) decision regarding an insolvency case between Mrs. Leena Salot (Riddhim Textiles) and Ridham Synthetics Private Limited. The case hinged on the interpretation of debt and the existence of pre-existing disputes under the Insolvency and Bankruptcy Code, 2016 (IBC).</p>\n\n<p>Mrs. Salot filed a petition under Section 9 of the IBC to initiate the Corporate Insolvency Resolution Process (CIRP) against Ridham Synthetics for non-payment of an outstanding operational debt. The NCLT dismissed the petition, prompting Mrs. Salot to appeal to the NCLAT. Mrs. Salot argued that the outstanding amount was admitted by Ridham Synthetics in their ledger statements, through part payments and also contended that the Respondent had availed the benefit of Input Tax Credit under the CGST Act, 2017, indicating their acknowledgment of the invoices.</p>\n\n<p>Ridham Synthetics claimed that the invoices were for goods not delivered or of inferior quality. They cited a WhatsApp message as evidence of a pre-existing dispute regarding the quality of goods. They also contended that the Appellant had invoked arbitration, acknowledging the existence of pre-existing disputes, and thus the Section 9 petition was not maintainable.</p>\n\n<p>The NCLAT, referencing Section 9 of the IBC and the judgment in *Mobilox Innovations Pvt. Ltd. vs. Kirusa Software Pvt. Ltd.*, emphasized that disputes must be plausible. The tribunal found that Ridham Synthetics had acknowledged the debt in their ledger statements and through part payments. The NCLAT deemed the WhatsApp message vague and insufficient to prove a pre-existing dispute.</p>\n\n<p>Ultimately, the NCLAT set aside the NCLT’s order, restored the original petition, and directed both parties to reappear before the NCLT for further proceedings. This decision highlights the necessity of demonstrating a crystallized debt and providing concrete evidence to substantiate claims of pre-existing disputes under the IBC.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/whatsapp-message-dont-prove-pre-existing-dispute.jpg"
  },
  {
    "title": "RBI Mandates Enhanced KYC and Monitoring for AePS Operators",
    "description": "<p>The Reserve Bank of India (RBI) has issued a directive, effective January 1, 2026, to strengthen the compliance framework governing Aadhaar Enabled Payment System (AePS) operators (ATOs). This move addresses growing concerns regarding identity fraud and security vulnerabilities in AePS transactions, particularly in rural areas. The directive, issued under the Payment and Settlement Systems Act, 2007, aims to enhance accountability and robustness in authentication-based transactions.</p>\n\n<p>Acquiring banks, which onboard AePS touchpoint operators, must now conduct thorough due diligence, including KYC, and implement enhanced monitoring of transactions. ATOs inactive for three consecutive months will require renewed KYC before reactivation. Banks are mandated to implement transaction risk monitoring, set exposure limits, and establish fraud risk management systems aligned with core banking channels.</p>\n\n<p>This regulatory change significantly elevates the oversight responsibilities of acquiring banks and aims to mitigate fraud risks associated with the surge in AePS transactions, especially in DBT disbursal and cash withdrawal services. The RBI's directive operationalizes its earlier intent to strengthen touchpoint governance, addressing vulnerabilities such as identity spoofing and unauthorized withdrawals. Institutions are urged to review their AePS frameworks, agent due diligence standards, and fraud surveillance controls to meet the compliance deadline.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/new-kyc-rules-for-aeps-operators.jpg"
  },
  {
    "title": "Impleading Petitions Can Be Entertained at Any Stage Before Judgment: Madras High Court Clarifies",
    "description": "<p>The Madurai Bench of the Madras High Court, in *P. Marimuthu v. S.S. Prabhakaran*, reaffirmed that impleading petitions can be entertained at any stage before judgment, clarifying the application of Order I Rule 10(2) of the Code of Civil Procedure (CPC) and the doctrine of lis pendens. This decision strengthens the rights of transferees pendente lite.</p>\n\n<p>The dispute arose from a suit for specific performance where the defendant sold the property to P. Marimuthu during the suit's pendency. The trial court dismissed Marimuthu's impleading petition, arguing the suit was reserved for judgment. Marimuthu appealed, contending he was a bona fide purchaser entitled to be heard, while the plaintiff argued that the impleading application was belated and Marimuthu was bound by lis pendens.</p>\n\n<p>The High Court held that transfers pendente lite are subservient to the rights of parties in litigation under Section 52 of the Transfer of Property Act. However, relying on Supreme Court precedent, the court emphasized that transferees pendente lite have a significant interest in defending their title and should generally be allowed to participate, especially when the original party may not properly contest the suit. The Court explicitly rejected the notion that impleading petitions are inadmissible once a matter is reserved for judgment, stating that \"at any stage of the proceedings\" in Order I Rule 10(2) CPC means any time before judgment pronouncement. The Court allowed the appeal and directed the trial court to accept the impleading application, permit cross-examination of the plaintiff, and allow formal evidence regarding the sale deed.</p>\n\n<p>This judgment reinforces the principle that procedural technicalities should not defeat substantial rights, particularly when collusion or prejudice to a transferee exists. It reminds transferees pendente lite that while lis pendens limits their rights, it does not extinguish them. Trial courts are reminded to exercise their power to implead parties under Order I Rule 10(2) CPC sensitively, even at advanced stages of proceedings. Ultimately, *P. Marimuthu v. S.S. Prabhakaran* reaffirms the judiciary's commitment to protecting bona fide purchasers and upholding justice by allowing impleading petitions before judgment, balancing the sanctity of litigation with preventing procedural injustice.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/impleading-petitions-valid-till-judgment.jpg"
  },
  {
    "title": "Domino’s Secures Ex Parte Injunction Against Deceptively Similar Marks in Online Food Platforms",
    "description": "<p>The Delhi High Court granted an ex parte ad-interim injunction to Dominos IP Holder LLC and Jubilant FoodWorks Limited, preventing multiple entities from using marks deceptively similar to \"Domino’s,\" such as \"Domnic’s,\" \"Dominic’s,\" and \"Daminic’s.\" The plaintiffs argued that these names infringed upon their registered trademarks and earlier trade name \"Dominick’s Pizza,\" with the defendants listed on online food platforms like Zomato and Swiggy.</p>\n\n<p>Domino's, founded in 1960, has established a significant global presence with over 21,000 stores. The plaintiffs contended that the defendant entities unlawfully adopted phonetically and visually similar marks with the intent to deceive consumers and divert business. The court observed that the defendant's marks were deceptively similar and phonetically identical to the plaintiff's trade name, demonstrating a clear attempt to capitalize on Domino’s goodwill.</p>\n\n<p>The court emphasized the likelihood of consumer confusion due to the similarity of the marks, particularly within the food sector, where potential health implications demand a lower threshold for establishing deceptive similarity. Finding that the balance of convenience favored the plaintiffs, the court restrained the defendant entities from using the infringing marks on any advertising or packaging materials. Zomato and Swiggy were directed to remove the infringing listings from their platforms.</p>\n\n<p>The ruling reinforces the protection of well-known trademarks against dilution and consumer confusion, highlighting the responsibility of online platforms to address infringements. The decision reaffirms the robust protection afforded to well-known trademarks under Indian law and underscores the judiciary's commitment to safeguarding brand trust, especially in the food services sector.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/dominos-wins-trademark-case.jpg"
  },
  {
    "title": "The Orissa High Court Upholds Maternity Benefits for Contract Employees",
    "description": "<p>The Orissa High Court has affirmed the right of contract employees to maternity benefits, reinforcing the socio-welfare obligations of the state. The ruling stems from a case where a contract employee, Smt. Anindita Mishra, was denied maternity leave by the Health & Family Welfare Department.</p>\n\n<p>The court's decision upholds a single judge's order that directed the granting of maternity leave benefits to the employee. The appellants, the State of Odisha, argued that the State Policy governing maternity benefits did not extend to contract employees. However, the court rejected this argument, emphasizing the importance of a liberal interpretation of the policy to include all female employees, regardless of their employment status.</p>\n\n<p>In its analysis, the High Court referenced international conventions like ICESCR and CEDAW, as well as the Maternity Benefit Act, 1961, and various Supreme Court judgments, all of which support the provision of maternity benefits. The court highlighted the fundamental nature of maternity leave for the well-being of both mother and child, and the State's responsibility as a model employer. The court dismissed the appeal and mandated the implementation of the order within eight weeks, underscoring the significance of maternity benefits as a socio-welfare measure.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/maternity-benefits-to-contract-staff.jpg"
  },
  {
    "title": "Mumbai Consumer Forum Holds Britannia and Retailer Liable for Selling Contaminated Biscuit Packet",
    "description": "<p>The District Consumer Disputes Redressal Commission in South Mumbai ruled in favor of a complainant who purchased a contaminated \"Good Day\" biscuit packet containing a live worm. The judgment holds Britannia Industries Ltd. and the retailer, M/s. Ashok M. Shah, jointly and severally liable for the sale of the contaminated product, which caused the consumer physical and mental distress. The Commission directed both parties to pay ₹1.50 lakhs for mental harassment and ₹25,000 for litigation costs.</p>\n\n<p>The complainant, Ms. Inderpreet Kaur Dhillon, filed the complaint after discovering the worm in the biscuit, leading to nausea and vomiting. A report from the Municipal Corporation of Greater Mumbai’s Food Laboratory confirmed the presence of extraneous matter. Britannia denied liability, citing a lack of evidence linking the product to their facility and adherence to quality protocols. The retailer also denied the sale and challenged the Commission's jurisdiction.</p>\n\n<p>The Commission rejected the defenses, emphasizing the evidentiary value of the public food analyst report and the responsibility of both the manufacturer and retailer to ensure product safety. This ruling aligns with strict liability principles under the Consumer Protection Act and the Food Safety and Standards Act, holding food business operators accountable for the safety and wholesomeness of their products. The case underscores the importance of documentation, timely action, and persistence for consumers seeking redress under consumer law and highlights the need for diligence, traceability, and legal compliance across the entire food distribution chain.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/britannia-liable-for-contamination.jpg"
  },
  {
    "title": "Delhi High Court Rules Unilateral Arbitrator Appointment Invalid Without Post-Dispute Written Waiver",
    "description": "<p>The Delhi High Court in *M/s Mahavir Prasad Gupta and Sons v. Govt. of NCT of Delhi* reaffirmed the importance of impartiality and procedural fairness in arbitration. The court held that a party cannot benefit from Section 12(5) of the Arbitration and Conciliation Act, 1996, if it unilaterally appointed an arbitrator without obtaining the other party's express written waiver after the dispute arose, even if the other party did not object during proceedings or consented to extend the arbitrator's mandate.</p>\n\n<p>The court emphasized that ineligibility under Section 12(5) constitutes a jurisdictional defect, not curable by conduct or participation, aligning with Supreme Court precedents. The ruling explicitly states that such objections are valid even when raised by the appointing party itself. Section 4 of the Arbitration and Conciliation Act, 1996, which deals with waiver by conduct, does not apply in cases governed by Section 12(5).</p>\n\n<p>The decision underscores the judiciary's duty under Section 34(2)(b) to set aside awards violating India's public policy, including principles of equality and impartial adjudication. It serves as a caution against unilateral arbitrator appointments, particularly by government entities, without explicit written waivers after a dispute arises and urges a review of standard arbitration clauses to ensure compliance with statutory requirements.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/delhi-hc-unilateral-arbitrator-appointment-invalid.jpg"
  },
  {
    "title": "Madras HC Upholds SBI's CIBIL Clause, Impacting Job Eligibility",
    "description": "<p>The Madras High Court, in a judgment on June 2, 2025, validated the State Bank of India's (SBI) Clause 1(E), which disqualifies candidates with adverse credit histories from employment, even if debts have been repaid. The ruling stemmed from the case of *P. Karthikeyan v. General Manager and ors.*, where SBI cancelled the appointment of a candidate selected for the post of Circle Based Officer (CBO) due to a poor CIBIL report.</p>\n\n<p>Karthikeyan, despite clearing all stages of the selection process, had his appointment revoked after SBI discovered multiple loan defaults, written-off loans, and overdue credit card dues in his CIBIL report. He argued that he had cleared all debts and was not declared a defaulter, claiming the cancellation was discriminatory. SBI countered that the recruitment notification explicitly cautioned candidates about eligibility criteria, including Clause 1(E), and that Karthikeyan's adverse credit history revealed significant financial indiscipline.</p>\n\n<p>Justice N. Mala upheld SBI's decision, emphasizing that Clause 1(E) clearly disqualifies candidates with adverse credit histories, regardless of subsequent repayment. The court cited Karthikeyan's CIBIL report, which showed multiple loan defaults, lender litigation, delayed credit card payments, and numerous credit inquiries. The ruling reinforces the importance of maintaining a clean credit history for individuals seeking employment in the financial sector, highlighting that financial credibility is a professional necessity and that employers are entitled to set high financial standards for their employees.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/cibil-defaults-valid-ground-for-job-rejection.jpg"
  },
  {
    "title": "The Digital Shift: How NABH and DPDP Acts Are Shaping Healthcare Compliance",
    "description": "<p>Digital transformation is crucial in today's healthcare environment, necessitating compliance with standards like the National Accreditation Board for Hospitals & Healthcare Providers (NABH) and the Digital Personal Data Protection (DPDP) Act, 2023. These standards prioritize patient safety, data security, and quality care, impacting operational efficiency, legal adherence, and patient trust.</p>\n\n<p>The DPDP Act, 2023, introduces strict rules for handling patient data, focusing on secure processing and individual rights, with potential penalties for non-compliance reaching ₹250 crore. This act requires hospitals to obtain explicit patient consent for data usage and ensures patients can access and correct their data.</p>\n\n<p>NABH establishes specific guidelines for hospitals to adopt robust digital health practices, including the implementation of Electronic Health Record (EHR) systems with features like time-stamped entries, access logs, and role-based access control (RBAC). Compliance also mandates strict protocols for handling sensitive reports and ensuring data backup and recovery procedures.</p>\n\n<p>The Bharatiya Sakshya Adhiniyam (BSA), 2023, validates scanned or digitally created records as legal evidence under specific conditions, emphasizing the need for hospitals to maintain systematic logs and collaborate with legal teams for authenticity certificates. By embracing digital health compliance, hospitals benefit from improved patient care, streamlined processes, enhanced data security, and reduced legal risks, positioning themselves as leaders in the evolving healthcare landscape.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/nabh-and-dpdp-digital-healthcare.jpg"
  },
  {
    "title": "Radio Telephone Operator (Restricted) Certificate and Licence Rules, 2025: A Comprehensive Overview",
    "description": "<p>The \"Radio Telephone Operator (Restricted) Certificate and Licence Rules, 2025\" establish a regulatory framework for operating radio-telephone services within the aviation industry. These rules ensure that only qualified and authorized individuals handle critical communication equipment, maintaining the safety and integrity of air traffic management.</p>\n\n<p>The rules define key terms, eligibility criteria, and application processes for obtaining the Radio Telephone Operator (Restricted) Certificate and Licence. Applicants must be at least sixteen years old, have passed Class X or its equivalent, and successfully complete a written and practical examination, though exemptions may apply for certain qualified individuals. Non-Indian citizens require security clearance. The Central Government, through the Director General of Civil Aviation, is responsible for granting, extending, and enforcing these Certificates and Licences.</p>\n\n<p>The Certificate and Licence remain valid until the holder reaches eighty years of age, with possible extensions under specific conditions. Holders are authorized to operate mobile stations under specified limitations, and they must produce their documents upon demand for inspection. The rules also outline procedures for lost, mutilated, or destroyed certificates, as well as reasons for disqualification, cancellation, or suspension.</p>\n\n<p>Appeals against decisions made under these rules can be made to the First or Second Appellate Officer. The Director General can issue special directions, and offences may be compounded with a fine. Existing Certificates and Licences granted under previous rules remain valid until expiry. Ultimately, these rules provide a structured framework to ensure the competency and accountability of radio-telephone operators in the aviation sector, promoting safety and efficiency.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/radio-operator-licence-rules-2025-full-overview.jpg"
  },
  {
    "title": "Orissa High Court Affirms MSEFC Awards Can Only Be Challenged Under Section 34 of the Arbitration Act",
    "description": "<p>The Orissa High Court, in *M/s Odisha Mining Corporation Ltd. v. Union of India & Ors.*, has clarified that arbitral awards passed by the Micro and Small Enterprises Facilitation Council (MSEFC) can only be challenged under Section 34 of the Arbitration and Conciliation Act, 1996. The ruling addresses jurisdictional conflicts arising from the intersection of the Micro, Small and Medium Enterprises Development Act, 2006 (MSMED Act), and general arbitration law.</p>\n\n<p>The case involved a dispute between Odisha Mining Corporation Ltd. (OMC) and M/s Indiana Engineering Works, a Maharashtra-based small enterprise, regarding a 1994 contract. After disputes arose, Indiana Engineering approached the Thane MSEFC, which ultimately issued an ex parte award in 2015. OMC challenged the award through a writ petition, arguing lack of jurisdiction, breach of natural justice, and procedural impropriety.</p>\n\n<p>The High Court rejected OMC's arguments, reinforcing that Section 34 of the Arbitration Act is the sole remedy for challenging MSME arbitral awards, citing the Supreme Court's decision in *M/s Silpi Industries v. Kerala State Road Transport Corporation*. The court further held that the Thane MSEFC had jurisdiction because Section 18(4) of the MSMED Act grants jurisdiction to the MSEFC where the supplier (Indiana Engineering) is located. The court also stated that Section 32(2) of the MSMED Act validated the proceedings even though the claim was originally filed under the repealed Interest on Delayed Payments Act, 1993.</p>\n\n<p>This judgment has significant implications for MSME suppliers and buyers. It reinforces the MSMED Act's status as a special legal regime, strengthens the predictability of MSME arbitration proceedings, and emphasizes the importance of procedural rigor before MSEFCs, as post-award challenges are now narrowly confined to Section 34 of the Arbitration Act.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/orissa-hc-msefc-awards-challengeable-only-under-sec-34.jpg"
  },
  {
    "title": "Navigating Trademark Protection in the Digital Age: The Titan vs. Lenskart Case",
    "description": "<p>The Delhi High Court addressed trademark infringement and passing off issues in the digital marketing context in the *Titan vs. Lenskart Solutions Pvt. Ltd.* case. Titan, holding trademarks for \"TITAN\" and \"FASTRACK,\" alleged Lenskart unlawfully used their trademarks as metatags, potentially diverting online traffic.</p>\n\n<p>Titan argued that Lenskart's metatag usage constituted trademark infringement under Section 29 of the Trademarks Act, 1999, and passing off under Section 27, diluting their brand. Lenskart acknowledged the use of Titan's trademarks but claimed it was inadvertent, stating the references were promptly removed upon receiving legal notice.</p>\n\n<p>The court, presided over by Justice Amit Bansal, acknowledged both the need to protect trademarks in the digital space and Lenskart's cooperative approach. Considering Lenskart's corrective actions and lack of malicious intent, the court ruled in favor of Titan, binding Lenskart to refrain from future trademark use, but exempted Titan from paying court fees.</p>\n\n<p>This judgment underscores the importance of trademark protection in the digital age, emphasizing vigilance and compliance with legal standards. It also highlights the potential for swift resolution of intellectual property disputes when parties demonstrate accountability and respect for legal norms.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/titan-vs-lenskart.jpg"
  },
  {
    "title": "Madras High Court Rules Against Overcharging for Movie Tickets",
    "description": "<p>The Madras High Court, in *G. Devarajan v. The Special Tahsildar & Ors.*, addressed the issue of cinema theaters charging moviegoers ticket prices exceeding government-prescribed limits. The court firmly stated that theaters cannot exploit moviegoers by charging excess amounts once the government has set ticket rates, particularly during major film releases.</p>\n\n<p>The ruling emphasizes the need for continuous and effective enforcement of pricing regulations. While the State mentioned a monitoring committee for inspections, the court underscored the importance of strict adherence to the prescribed rates.</p>\n\n<p>The judgment serves as a guide for consumers and cinema operators. Consumers should preserve transaction evidence, file complaints with the District Collector or Monitoring Committee, utilize consumer protection channels like the National Consumer Helpline or District Consumer Disputes Redressal Commission, and raise awareness through social media. Cinema operators should stay updated on pricing notifications, train staff on pricing caps, and audit booking systems to ensure compliance.</p>\n\n<p>This ruling is a significant step towards enforcing consumer rights within the entertainment sector, ensuring that regulatory ceilings on ticket prices are mandatory and protecting moviegoers from unfair charges.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/madras-hc-movie-ticket-overcharging.jpg"
  },
  {
    "title": "NCLAT Rules NCLT Approval Not Required for Liquidator Replacement in Voluntary Liquidation",
    "description": "<p>The National Company Law Appellate Tribunal (NCLAT) has ruled in *Vinod Singh v. Chandra Prakash Jain & Ors.* that the National Company Law Tribunal (NCLT) lacks jurisdiction to prevent the replacement of a liquidator during voluntary liquidation proceedings under Section 59 of the Insolvency and Bankruptcy Code (IBC). This decision reinforces the autonomy of corporate entities in voluntary liquidation and distinguishes it from compulsory liquidation following Corporate Insolvency Resolution Processes (CIRP).</p>\n\n<p>The case arose from the voluntary liquidation of Transmissions International India Private Limited (TIIPL), where the initial liquidator, Mr. Umesh Ved, was replaced by Mr. Chandra Prakash Jain, who was then removed by shareholder resolution and replaced by Mr. Arun Gupta. Mr. Jain challenged his removal before the NCLT, which directed a status quo, effectively preventing the replacement.</p>\n\n<p>The NCLAT emphasized that voluntary liquidation under Section 59 of the IBC is a self-contained regime where liquidator appointments and replacements are governed by shareholder decisions, not requiring NCLT approval, as clarified by Regulation 5 of the IBBI (Voluntary Liquidation Process) Regulations, 2017. The Tribunal deemed the NCLT's status quo order as exceeding its jurisdiction. The NCLAT also addressed the NCLT's decision to de-reserve its judgment citing procedural irregularities, deeming it arbitrary.</p>\n\n<p>The NCLAT's ruling affirms that directors and shareholders possess full authority to appoint or replace liquidators during voluntary liquidation, absent evidence of fraud or misconduct, and that adjudicating authorities cannot interfere with decisions made in accordance with Section 59 of the IBC and associated regulations. The judgment underscores the importance of timely completion of voluntary liquidation and minimizes the potential for procedural delays and judicial overreach. This provides clarity to stakeholders, emphasizing that voluntary liquidation is a shareholder-driven process with minimal regulatory interference required.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/nclat-liquidator-replacement-ruling.jpg"
  },
  {
    "title": "No Policy Without Premium: Kerala High Court Clarifies Insurer’s Non-Liability",
    "description": "<p>The Kerala High Court, in *HDFC ERGO General Insurance Co. Ltd. v. Zeenath & Ors*, clarified that an insurer cannot be held liable for motor accident claims if a valid insurance contract was never concluded due to non-payment of the premium. The judgment underscores the importance of Section 64-VB of the Insurance Act, 1938, emphasizing that premium payment is a prerequisite for an insurance contract to become effective.</p>\n\n<p>The case stemmed from a fatal accident where the Motor Accidents Claims Tribunal (MACT) initially directed HDFC ERGO to pay compensation. The insurer appealed, arguing that although a cover note was prepared, it was immediately canceled due to non-receipt of the premium, and the policy was never delivered. The High Court upheld the insurer's argument, finding that no valid insurance contract existed at the time of the accident.</p>\n\n<p>The court distinguished this case from instances where policies are issued but subsequently canceled, referencing the Supreme Court's view that insurers might remain liable to third parties in such scenarios if a cancellation notice wasn't issued before the accident. However, since the cover note was canceled at inception and retained by the insurer, there was no need for a cancellation notice. This decision aligns with a broader judicial consensus requiring both premium payment and policy issuance for an enforceable insurance contract. The ruling shifts the liability back to the registered vehicle owner, reinforcing contractual discipline within the insurance sector and preventing unwarranted claims.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/kerala-high-court-insurance-policy-liability.jpg"
  },
  {
    "title": "Kerala Consumer Commission Holds Eureka Forbes Liable for Service Deficiency Under CPA, 2019",
    "description": "<p>The District Consumer Disputes Redressal Commission, Ernakulam, ruled in *Augstine K.A. v. Eureka Forbes Ltd. & Ors.* that Eureka Forbes and its service provider were liable for deficiency in service and unfair trade practices after a newly purchased water purifier malfunctioned due to improper installation. The Commission emphasized the responsibility of manufacturers and service providers to provide proper after-sales service under the Consumer Protection Act, 2019.</p>\n\n<p>The complainant, Mr. Augstine K.A., purchased a water purifier which was improperly installed by a Eureka Forbes technician, rendering it non-functional. Despite repeated complaints, no effective action was taken to resolve the issue. Consequently, Mr. Augstine filed a consumer complaint seeking a replacement or refund, compensation for mental distress, and reimbursement of legal costs.</p>\n\n<p>The Commission determined that the complaint was maintainable under the Consumer Protection Act, 2019. It directed Eureka Forbes to replace the defective purifier or refund the purchase price of ₹10,200. Additionally, the Commission awarded ₹5,000 as compensation for mental agony and ₹5,000 for litigation costs. The retailer, Nandilath G Mart, was exonerated.</p>\n\n<p>This ruling reaffirms the principle of vicarious liability for manufacturers regarding the actions of their authorized service agents and underscores the importance of prompt and effective after-sales service, especially for vulnerable consumers. The decision highlights that failure to address consumer grievances can result in adverse findings and financial liability.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/eureka-forbes-consumer-protection-act-service-deficiency.jpg"
  },
  {
    "title": "Understanding the Food Safety and Standards (Alcoholic Beverages) First Amendment Regulations, 2025",
    "description": "<p>The Food Safety and Standards Authority of India (FSSAI) has issued the Food Safety and Standards (Alcoholic Beverages) First Amendment Regulations, 2025, effective January 1, 2026. These regulations update and clarify standards and definitions for alcoholic beverages under the Food Safety and Standards Act, 2006, to ensure food safety and provide clearer industry guidelines.</p>\n\n<p>These regulations, published in the Gazette of India on June 20, 2025, were developed following a public consultation, as per Section 92 of the Act, which empowers FSSAI to set standards for food products. Key amendments include the definition of \"alcoholic ready-to-drink beverages\" (flavored drinks with 0.5% to 15.0% alcohol by volume) and updates to the definition of \"alcoholic beverage\" to include this range.</p>\n\n<p>Specific provisions are introduced for \"plain country liquor\" or \"plain Indian liquor\" (distillates from fermented sources like molasses, cereals, or fruits) and \"blended country liquor\" or \"blended Indian liquor\" (a blend of alcoholic distillates, rectified spirit, or neutral spirit), aiming to standardize their production and classification. Additionally, regulations cover \"fruit wine (other than grape wine)\" and \"honey wine,\" defining them as wines produced solely from fruit or honey fermentation, potentially with herbs, spices, or natural flavorings. A new category, \"nitro craft beer,\" is introduced to address innovative brewing techniques.</p>\n\n<p>In conclusion, these amendments signify a commitment to enhancing food safety and providing clearer guidelines for the alcoholic beverage industry. By updating definitions and standards, FSSAI aims to ensure high safety and quality standards, reflect evolving industry practices, meet consumer demands, safeguard public health, and promote innovation in the sector.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/food-safety-and-standards-2025-alcohol-rules.jpg"
  },
  {
    "title": "Section 27 of the Indian Contract Act: Varun Tyagi Judgment and Delhi High Court’s Ruling on Non-Compete Clauses",
    "description": "<p>The Delhi High Court, in case FAO 167/2025 involving Varun Tyagi and Daffodil Software Private Limited, overturned a lower court's interim injunction, emphasizing the limitations of non-solicitation and non-compete clauses under Section 27 of the Indian Contract Act, 1872. The ruling balances the need to protect business interests with the employee's right to pursue better opportunities.</p>\n\n<p>The case arose after Tyagi, an IT Engineer formerly employed by Daffodil Software on the POSHAN Tracker project, accepted a General Manager position at Digital India Corporation (DIC) upon leaving Daffodil. Daffodil sought an injunction, alleging Tyagi's new role violated a non-solicitation and non-compete clause and risked disclosing proprietary information. The trial court initially granted an ex parte ad interim injunction, restricting Tyagi's employment with DIC.</p>\n\n<p>Tyagi appealed, arguing the clause was void under Section 27, which prohibits agreements restraining trade. He contended the project's intellectual property belonged to DIC, not Daffodil. Daffodil countered that Tyagi's role at DIC would utilize confidential information acquired during his employment and that the clause was reasonable.</p>\n\n<p>The Delhi High Court, led by Justice Tejas Karia, ruled the non-compete clause void as it extended beyond Tyagi's employment. It determined that the claim of proprietary information disclosure was unfounded, as DIC owned the POSHAN Tracker's intellectual property. The court noted that preventing Tyagi's employment with DIC would cause irreparable harm to his career and financial stability. Consequently, the appeal was granted, and the injunction was quashed. This ruling reaffirms the restricted enforceability of non-solicitation and non-compete clauses in India, especially post-employment, clarifying the balance between protecting business interests and employee rights.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/section-27-of-indian-contract-act-varun-tyagi-ruling.jpg"
  },
  {
    "title": "Legal Protection for Transwomen in Marriages: Analysis of a New Judicial Precedent Under Section 498-A IPC",
    "description": "<p>The High Court of Andhra Pradesh, in *Vishwanathan Krishna Murthy v. The State of Andhra Pradesh*, has established a precedent affirming the right of transwomen in heterosexual marriages to protection under Section 498-A of the Indian Penal Code (IPC), which addresses cruelty and harassment related to dowry. This ruling acknowledges transgender identities within Indian family law, reinforcing constitutional principles of equality, dignity, and non-discrimination.</p>\n\n<p>The case originated from a complaint filed by a transwoman against her husband and in-laws, alleging cruelty and dowry harassment. The court addressed whether a transwoman could lodge a complaint under Section 498-A IPC and whether the proceedings against the petitioners should be quashed. The court observed the constitutional right to self-identify gender under Articles 14, 15, 19, and 21 and the provisions of the Transgender Persons (Protection of Rights) Act, 2019. It dismissed the argument that biological reproduction is essential for legal recognition as a woman. The Court recognized the validity of the marriage under Hindu customs and held the transwoman is fully entitled to seek protection under matrimonial laws.</p>\n\n<p>While affirming the right of transwomen to seek protection under Section 498-A IPC, the court also cautioned against the misuse of the provision. It quashed the proceedings against the husband's family due to vague allegations lacking specific evidence of cruelty or dowry demands, exercising its inherent powers under Section 482 CrPC to prevent abuse of legal process. The Court also relied on judicial precedents when arriving at its conclusion.</p>\n\n<p>The judgment marks a significant advancement in safeguarding the rights of transgender individuals in marriage. The ruling reinforces the constitutional values of inclusivity and fairness, while also maintaining judicial oversight to prevent misuse of criminal provisions in matrimonial disputes.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/transwomen-in-marriages-498-a-ipc.jpg"
  },
  {
    "title": "Delhi High Court Protects Sadhguru Jagadish Vasudev's Personality Rights",
    "description": "<p>The Delhi High Court has addressed the unauthorized use of Sadhguru Jagadish Vasudev's persona in the digital realm in the case of *Sadhguru Jagadish Vasudev & Anr. versus Igor Isakov & Ors.* The court recognized the need to protect the spiritual leader's reputation and goodwill against infringement through modern technology and AI tools.</p>\n\n<p>The case was brought forth by Sadhguru and the Isha Foundation against defendants allegedly creating deep fakes and unauthorized content misrepresenting Sadhguru. The plaintiffs argued this caused significant damage, and sought exemption from pre-litigation mediation due to the urgency. The court granted this exemption, referencing previous judgments.</p>\n\n<p>The plaintiffs contended that the defendants were infringing on Sadhguru's personality rights by using his name, image, and voice to create misleading content for financial scams and promotion. This unauthorized use caused irreparable harm, leading the plaintiffs to seek injunction, damages, and preventative measures.</p>\n\n<p>The court, acknowledging Sadhguru's global reputation and the potential for widespread harm through online platforms, granted an injunction against identified defendants. They were prohibited from using Sadhguru's persona without authorization. The court also directed service providers to suspend infringing websites and accounts.</p>\n\n<p>This ruling in *Sadhguru Jagadish Vasudev & Anr. versus Igor Isakov & Ors.* establishes a vital precedent for safeguarding the personality rights of public figures against digital exploitation. It underscores the necessity for effective legal remedies to combat online infringement and protect reputation in the age of rapidly evolving technology.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/hc-on-sadhguru-jagadish-vasudev.jpg"
  },
  {
    "title": "NCLAT Dismisses Appeal in Taguda Pte Ltd. Case: Upholding Timely Resolution Plan Implementation",
    "description": "<p>The National Company Law Appellate Tribunal (NCLAT) dismissed an appeal by Taguda Pte Ltd., the successful resolution applicant (SRA) in the case of Ushdev International Limited, affirming the NCLT's directive to implement the resolution plan. This ruling underscores the importance of adhering to timelines and regulatory requirements under the Insolvency and Bankruptcy Code (IBC) of 2016.</p>\n\n<p>The case arose after Taguda Pte Ltd. failed to secure necessary approvals, including those from the Reserve Bank of India (RBI), despite the resolution plan being approved by the Committee of Creditors (CoC) and the NCLT.  The NCLT subsequently directed Taguda to implement the plan within two months, a decision Taguda appealed, arguing that the NCLT was modifying the approved plan's timeline, which they believed was contingent on receiving all governmental approvals.</p>\n\n<p>The NCLAT rejected Taguda's argument, emphasizing the obligation of the resolution applicant to obtain regulatory approvals within the one-year timeframe stipulated under Section 31(4) of the IBC. The tribunal noted that Punjab National Bank (PNB) had diligently pursued RBI approvals, but the RBI withheld approval due to regulatory contraventions related to corporate guarantees. The NCLAT concluded that the delay in implementation was primarily due to Taguda's failure to secure the necessary approvals, thereby justifying the initiation of liquidation proceedings.</p>\n\n<p>Citing Section 31(4) of the IBC and the Request for Resolution Plan (RFRP), the NCLAT affirmed the NCLT’s jurisdiction to enforce resolution plans and the consequences of failing to meet regulatory obligations. The NCLAT has directed the NCLT to proceed with the pending liquidation application, preferably within three months. The ruling emphasizes the need for SRAs to diligently pursue and secure all required approvals within the statutory timeframe to ensure successful resolution plan implementation.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/nclat-on-taguda-pte-ltd-appeal.jpg"
  },
  {
    "title": "Landmark Victory for Senior Citizens’ Rights: Bombay High Court Upholds Eviction Order Under The Maintenance and Welfare of Parents and Senior Citizens Act, 2007",
    "description": "<p>The Bombay High Court has reaffirmed the rights of senior citizens under The Maintenance and Welfare of Parents and Senior Citizens Act, 2007, in a case involving Chandiram and Sushila Hemnani, who sought the eviction of their son and daughter-in-law from their property due to a hostile living environment exacerbated by frivolous litigation.</p>\n\n<p>The elderly couple, owners of a bungalow in Maharashtra, had permitted their son and daughter-in-law to reside with them, but subsequent disputes led to significant harassment. After a Tribunal initially ordered the eviction, the Senior Citizens Appellate Tribunal reversed this decision, prompting the senior citizens to file a writ petition in the High Court.</p>\n\n<p>The High Court, referencing previous judgments and emphasizing the Act's intent to protect senior citizens, overturned the Appellate Tribunal's decision. The court highlighted the couple's ownership of the property and the daughter-in-law's failure to establish any legal right to reside there. The court directed the respondents to vacate the premises within 30 days and awarded costs to the petitioners. The judgment reinforces the importance of safeguarding the rights of senior citizens and ensuring their peaceful enjoyment of their property, setting a precedent for similar cases.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/bombay-hc-eviction-senior-citizens-rights-victory.jpg"
  },
  {
    "title": "Delhi RERA 2025 Directions: A New Era of Compliance and Transparency",
    "description": "<p>The Delhi Real Estate Regulatory Authority (Delhi RERA) has implemented new directions under Section 37 of the Real Estate (Regulation and Development) Act, 2016, aimed at enhancing compliance among promoters and agents in Delhi. These directions address prevalent issues such as outdated project statuses and opaque financial reporting, signaling a move towards stricter regulatory enforcement.</p>\n\n<p>These directions reflect Delhi RERA’s proactive approach to monitoring and enforcing compliance, highlighting the importance of developers fulfilling their regulatory duties, including timely status updates, quarterly progress reports, and adherence to proper banking protocols. They also serve as a message to homebuyers that their rights to information, accountability, and project certainty are being prioritized.</p>\n\n<p>Ultimately, the Delhi RERA Directions 2025 represent a shift from passive registration to active regulatory monitoring, emphasizing transparency and accountability within the real estate sector. This initiative aims to restore buyer confidence and eliminate unscrupulous actors, placing the onus on promoters and agents to adhere to these enhanced compliance standards.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/delhi-rera-transparency-directions.jpg"
  },
  {
    "title": "Supreme Court Clarifies Legal Divide Between Agreement to Sell and Registered Conveyance",
    "description": "<p>The Supreme Court of India, in *Vinod Infra Developers Ltd. v. Mahaveer Lunia & Ors.*, reaffirmed the legal principle that an Agreement to Sell (ATS), even with possession or payment, does not confer ownership rights to immovable property without a registered sale deed. The court emphasized that title transfer necessitates a registered conveyance and that claims based solely on unregistered ATS are unenforceable unless a suit for specific performance is filed.</p>\n\n<p>The case arose from a dispute where the appellant challenged the validity of sale deeds executed based on an unregistered ATS and power of attorney, arguing they were security for a loan and subsequently revoked. Despite the revocation, the respondents registered sale deeds. The Supreme Court allowed the appeal, restoring the plaint, and asserted that revocation of the power of attorney voided the subsequent sale deeds. The Court reiterated that SA/GPA/WILL transactions do not constitute valid transfers and cannot substitute for a registered sale deed.</p>\n\n<p>The Court also clarified that a plaint with multiple causes of action cannot be rejected entirely if one relief is legally untenable. Furthermore, the Court held that ownership and title disputes fall under the jurisdiction of civil courts, not revenue courts, as revenue records are for fiscal purposes and do not confer title. This decision reinforces the importance of registered conveyance deeds for legally transferring immovable property and promotes transparency in real estate transactions.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/supreme-court-agreement-to-sell-registered-conveyance.jpg"
  },
  {
    "title": "Misconduct Beyond Workplace: Judicial Deference in Government Contractual Employment",
    "description": "<p>The case of *Executive Secretary of District Health Society vs. K.S. Subha Karuthukhan* highlights the complexities of balancing employment contracts with public conduct expectations, particularly concerning the Tamil Nadu Government Servants’ Conduct Rules, 1973. The legal dispute arose after a contractual employee's disengagement following allegations of misconduct stemming from a matrimonial dispute, raising questions about employment security, the definition of misconduct under service rules, and the extent of judicial intervention in employment decisions.</p>\n\n<p>The employee, initially appointed as a Dental Assistant on a contractual basis, was disengaged after being implicated in a criminal case related to a matrimonial dispute. While the writ court initially ruled in favor of the employee, arguing the personal dispute shouldn't affect his employment, the appellants contended that the employee's conduct violated the professional standards expected of public servants under the Conduct Rules, which permit disciplinary action for misconduct even outside the workplace. The respondent maintained the allegations were unrelated to his professional role and his performance was satisfactory.</p>\n\n<p>The division bench overturned the writ court's decision, emphasizing that public servants are expected to uphold integrity in both professional and personal lives, and misconduct under the Conduct Rules extends beyond workplace behavior to actions that could tarnish public service. The court acknowledged the respondent's contractual term had expired, making reinstatement untenable, and stressed judicial intervention in contractual employment matters should be cautious. The final decision affirmed the government's authority to initiate disciplinary measures for conduct violations, whether professional or personal, underscoring the judiciary's role in respecting administrative autonomy while ensuring fairness. This case serves as a precedent for interpreting misconduct and contractual obligations in public administration.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/misconduct-beyond-workplace-government-employment.jpg"
  },
  {
    "title": "Balancing Development and Conservation: The Mumbai Open Spaces Debate",
    "description": "<p>The Bombay High Court, in the case of NAGAR vs State of Maharashtra, addressed the conflict between urban development and environmental conservation in Mumbai. The case challenged the Maharashtra Government's policy allowing the use of public recreational spaces for slum rehabilitation, highlighting the need to balance housing with the preservation of open spaces.</p>\n\n<p>The legal challenge stemmed from a government notification and amendments to the Development Control and Promotion Regulations (DCPR) 2034, which permitted converting open spaces into housing zones. NAGAR argued this contravened the city's Development Plan and undermined urban health by diminishing vital recreational areas. The petition invoked constitutional principles, the Maharashtra Regional and Town Planning Act, 1966 (MRTP Act), the Doctrine of Public Trust, Sustainable Development, and the Precautionary Principle.</p>\n\n<p>The Bombay High Court acknowledged Mumbai's housing shortage but emphasized the importance of public open spaces for well-being. It struck down the contentious provisions of Regulation 17(3)(D)(2), deeming them inconsistent with urban planning principles and constitutional mandates, and directed the State to revise housing policies to align with the MRTP Act. The judgment serves as a precedent for balancing urban development and environmental conservation, reaffirming the importance of preserving public spaces and integrating inclusivity with sustainability.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/mumbai-open-spaces-development-conservation-debate.jpg"
  },
  {
    "title": "NCDRC Clarifies “Consumer” Status In Real Estate Transactions: Key Takeaways From Mrs. Rajni Suryakant Gujar V. Shree Vinayaka Developers",
    "description": "<p>The National Consumer Disputes Redressal Commission (NCDRC) has reaffirmed the definition of a \"consumer\" under the Consumer Protection Act, particularly in real estate transactions, in the case of *Mrs. Rajni Suryakant Gujar v. Shree Vinayaka Developers*. The case involved a dispute over a property transaction where the appellants, engaged in real estate brokerage, sought to purchase a plot but were denied the sale deed despite making payments.</p>\n\n<p>The NCDRC upheld the dismissal of the consumer complaint, citing the Supreme Court's precedent that purchases for commercial purposes do not qualify the purchaser as a \"consumer.\" The commission found that the appellants' transaction was part of their regular commercial activity, thus excluding them from consumer status under both the 1986 and 2019 Consumer Protection Acts.</p>\n\n<p>Furthermore, the NCDRC addressed the issue of transacting with an individual partner of the developer firm, noting that the partnership deed required transactions to be conducted in the firm's name. Given allegations of fraud and the complex nature of the dispute, the Commission directed the appellants to pursue remedies in civil or criminal courts, as consumer forums are not suited for adjudicating such matters. This decision underscores the importance of evaluating the complainant's consumer status and the capacity in which parties contract, ensuring consumer forums focus on protecting genuine consumers rather than commercial operators or investors.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/ncdrc-consumer-status-real-estate-transactions.jpg"
  },
  {
    "title": "Pharmacy Council of India (Manner of Holding Inquiry and Imposition of Penalty) Regulations, 2025 Notified",
    "description": "<p>The Pharmacy Council of India (PCI) has notified the \"Pharmacy Council of India (Manner of Holding Inquiry and Imposition of Penalty) Regulations, 2025,\" effective from June 10, 2025. These regulations aim to streamline inquiry processes and penalty imposition under the Pharmacy Act, 1948, enhancing regulatory oversight and compliance within the pharmacy sector. The regulations define key terms, including \"Act,\" \"adjudicating officer,\" \"appellant,\" and \"appellate authority,\" to ensure clarity and uniformity in their application.</p>\n\n<p>The regulations outline procedures for filing complaints, which can be submitted electronically, via speed post, or in person using Form-I. Upon receiving a complaint, the adjudicating officer issues a notice (Form-II) to the respondent, specifying the alleged contravention and requiring a response within a specified period. The officer then decides whether to proceed with an inquiry, providing the respondent an opportunity to present evidence (Form-III). The officer can enforce attendance of individuals relevant to the case and may proceed in absentia if the respondent fails to appear. Penalties are imposed via written order specifying reasons and the contravened provision of the Act.</p>\n\n<p>An appeal process is also detailed, allowing aggrieved parties to file an appeal (Form-IV) to the appellate authority within 45 days. The appeal must include a copy of the adjudicating officer's order, a statement of facts, and grounds for the appeal. The appellate authority reviews the appeal, may request records, and must dispose of the appeal within 90 days of filing.</p>\n\n<p>Orders issued under these regulations must be dated, signed, and communicated to all parties, with penalties credited to the respective state pharmacy council's account. The regulations are issued under the powers conferred by Section 18(1) and Section 18(2)(i) of the Pharmacy Act, 1948, with Central Government approval, and published in the Gazette of India. These regulations provide a comprehensive framework for ensuring accountability and transparency within the pharmacy sector, ultimately benefiting patients and healthcare providers.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/pharmacy-council-2025-regulations.jpg"
  },
  {
    "title": "Kerala High Court Bans Single-Use Plastics in Hilly Tourist Hotspots",
    "description": "<p>The Kerala High Court has initiated proceedings to address the unchecked use of single-use plastics (SUPs) in the state's ecologically fragile hilly tourist regions. Taking Suo-motu cognizance of the matter, the court reaffirmed the constitutional obligation to safeguard the environment and issued detailed directions for strict enforcement of the Environment (Protection) Act, 1986, and the Plastic Waste Management Rules, 2016, effective from October 2, 2025. This intervention addresses the increasing plastic pollution in high-footfall tourist destinations despite existing state bans.</p>\n\n<p>The Court identified major hill stations as plastic pollution hotspots due to high tourist footfall. It imposed a complete ban on specific SUPs in these areas, exempting only larger plastic water and soft drink bottles. The ban extends to official events and private gatherings, covering items like plastic plates, cups, and straws. The court has instructed that licenses for establishments should now incorporate these restrictions.</p>\n\n<p>To facilitate the transition, the court prescribed viable eco-friendly alternatives and directed the establishment of clean water kiosks and refill stations. Local authorities are tasked with regular clean-up drives of rivers, canals, and backwaters, and must collaborate with voluntary organizations. Additionally, the court emphasized the enforcement of Extended Producer Responsibility (EPR) obligations, mandating producers, importers, and brand owners to manage post-consumer plastic waste effectively. The Chief Secretary and the Principal Secretary of the Local Self Government Department were directed to lead the implementation.</p>\n\n<p>The ruling strengthens the legal and constitutional framework for environmental protection in India, drawing upon constitutional provisions, environmental statutes, and delegated legislation. By reinforcing EPR, the Court aims to shift accountability upstream, embedding sustainability into the production and distribution cycle and promoting a circular plastic economy. The judgment provides a practical roadmap for sustainable environmental governance and sets a precedent for other states to follow.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/kerala-hc-ban-single-use-plastics-tourist-areas.jpg"
  },
  {
    "title": "No Title Without Registration: Supreme Court Clarifies Ownership Under Indian Property Law",
    "description": "<p>The Supreme Court of India has reaffirmed that a registered instrument is mandatory for the transfer of immovable property. In *Mahnoor Fatima Imran & Ors. v. State of Telangana & Ors.*, the Court ruled that an unregistered agreement to sell, even if validated later, does not confer legal title. The decision arose from a dispute over land in Telangana, emphasizing that mere possession, if not lawfully established, cannot justify protection from dispossession under Article 226 of the Constitution.</p>\n\n<p>The case involved 53 acres of land originally part of a larger tract declared surplus under the Andhra Pradesh Land Reforms (Ceiling on Agricultural Holdings) Act, 1973. A cooperative society claimed to have purchased the land via an unregistered agreement in 1982, later \"validated\" in 2006. Subsequently, the society executed registered sale deeds to individuals who sought protection from dispossession, claiming unlawful takeover by the Telangana State Industrial Infrastructure Corporation (TSIIC).</p>\n\n<p>The Supreme Court underscored the importance of the Registration Act, 1908, mandating registration for any document transferring rights in immovable property. The unregistered 1982 agreement, despite its \"validation,\" remained legally ineffective. The Court also pointed to conflicting versions of the agreement, casting doubt on its authenticity. The Court reiterated that only a registered sale deed confers ownership, referencing Suraj Lamp & Industries Pvt. Ltd. v. State of Haryana. Additionally, the petitioners failed to establish lawful possession and statutory vesting of the land in the State under land reform laws further negated any claim of ownership.</p>\n\n<p>This ruling has significant implications for legal practitioners, real estate stakeholders, buyers, developers, and financial institutions. It emphasizes the need for thorough due diligence, verifying documentation, legal history, and statutory status of land, ensuring every transaction is backed by a properly executed and registered sale deed. The Supreme Court ruling reinforces that registered ownership is the only valid foundation for title to immovable property, safeguarding against claims based on unregistered agreements or mere possession.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/supreme-court-property-title-registration-india.jpg"
  },
  {
    "title": "TikTok Denied Entry to the List of Well-Known Trademarks by Bombay High Court",
    "description": "<p>The Bombay High Court upheld the Registrar of TradeMarks' decision to deny TikTok's application for inclusion in the list of well-known trademarks under Rule 124 of the Trade Marks Rules, 2017. This decision was based on the Government of India's ban of TikTok due to concerns over national sovereignty, data privacy, and cyber safety under the Information Technology Act, 2000.</p>\n\n<p>TikTok argued that the Registrar's decision demonstrated a lack of consideration of the material presented and incorrectly invoked Section 9 of the Trade Marks Act. The court, however, found that Section 11(6) is illustrative, not exhaustive, allowing the Registrar to consider any relevant fact, including matters of public policy and constitutional values when evaluating applications for well-known status.</p>\n\n<p>The Court observed that while TikTok remains a registered trademark with statutory protection, the enhanced protection conferred by \"well-known mark\" status was not warranted given the ongoing ban. The decision reinforces that acknowledgment of a trademark as \"well-known\" requires compliance with domestic legislation, public interest considerations, and constitutional protections, and is not solely determined by global popularity.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/bombay-hc-denies-tiktok-well-known-trademark-status.jpg"
  },
  {
    "title": "CCI’s Table Tennis Verdict: A New Framework for Competition Law in Indian Sports Governance",
    "description": "<p>The Competition Commission of India's (CCI) order in *TT Friendly Super League Association v. Table Tennis Federation of India* establishes a significant precedent for applying competition law to sports governance in India. Delivered in December 2024, the ruling clarifies that the regulatory status and non-profit nature of sports bodies do not exempt them from antitrust scrutiny when they operate as market participants. The case addresses whether a regulator can also act as a competitor, with the CCI firmly stating they cannot.</p>\n\n<p>The case originated from a complaint by TT Friendly Super League Association (TTFSL), an organization running non-ranking table tennis tournaments, against a WhatsApp advisory issued by the Suburban Table Tennis Association (TSTTA). The advisory warned players against participating in unaffiliated events, threatening suspension from official tournaments. TTFSL alleged anti-competitive conduct under Sections 3 and 4 of the Competition Act, 2002. The CCI investigated the conduct of four associations, identifying relevant markets as the \"market for organizing table tennis events in Maharashtra\" and the \"market for regulating professional table tennis in India.\" All four associations were deemed “enterprises” involved in economic activities.</p>\n\n<p>The Commission concluded that the associations abused their dominant positions, violating Sections 4(2)(a)(i), 4(2)(b)(i), and 4(2)(c) of the Competition Act, 2002. The WhatsApp advisory was considered a coercive directive restricting player participation in independent tournaments. Clauses within the Table Tennis Federation of India's Memorandum of Association (MoA) were also found to be overly restrictive and anti-competitive. Furthermore, TSTTA's conduct constituted vertical restraints under Section 3(4) of the Act, causing an appreciable adverse effect on competition (AAEC).</p>\n\n<p>Despite the violations, the CCI refrained from imposing monetary penalties due to remedial measures undertaken by the associations and the fact that it was a first-time offense. Instead, a cease-and-desist order was issued under Section 27, warning of stricter consequences for repeat offenses. The ruling reinforces athletes’ right to compete and signals a shift toward player-centric regulation, requiring federations to adapt to a more open sporting ecosystem. The ruling highlights the need for sports federations to align their practices with fair competition principles and replace restrictive policies with transparent governance frameworks. The verdict also supports market access, innovation, and athlete choice in the evolving landscape of Indian sports.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/cci-verdict-on-competition-law-in-indian-sports.jpg"
  },
  {
    "title": "Arbitration Survives Termination: Telangana High Court Clarifies Scope In Urbanwoods Realty Real Estate Dispute",
    "description": "<p>The Telangana High Court has upheld the validity of arbitration agreements in a dispute between Urbanwoods Realty LLP and the respondents, reinforcing arbitration as a key method for resolving complex commercial issues. The case (Arbitration Application No. 41 of 2023) arose from a joint development MoU and subsequent agreement of sale concerning a 2-acre plot, where disputes emerged over payment obligations and project timelines.</p>\n\n<p>Urbanwoods Realty sought the appointment of an arbitrator under the Arbitration and Conciliation Act, 1996, while the respondents argued that termination of the MoU and agreement of sale nullified the arbitration clause. The court emphasized the doctrine of separability, affirming that an arbitration clause remains valid even if the main contract is terminated. The court's role under Section 11 is limited to verifying the existence of a prima facie arbitration agreement, without delving into the dispute's merits or contract validity.</p>\n\n<p>The court interpreted the MoU and agreement of sale as a single transaction. Despite the use of \"may\" in the agreement of sale's arbitration clause, the court concluded that the intention to arbitrate was clear when considering both agreements together. Objections regarding insufficient stamping were deemed issues for the arbitral tribunal to decide. The High Court appointed Sri Justice V. V. S. Rao as the sole arbitrator, tasking the tribunal with resolving all issues, including the termination of the underlying agreements. This ruling underscores the importance of well-drafted arbitration clauses and the court's commitment to upholding arbitration as an efficient dispute resolution mechanism.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/urbanwoods-realty-arbitration-ruling.jpg"
  },
  {
    "title": "Redefining Parenthood: Historic Ruling on Transgender Rights in Kerala",
    "description": "<p>The Kerala High Court has delivered a landmark judgement affirming the rights of a transgender couple to be recognized as parents without adhering to binary gender roles. In *Zahhad & Anr. v. State of Kerala & Ors.*, Justice Ziyad Rahman directed the Kozhikode Corporation to issue a birth certificate identifying the couple simply as \"parents,\" instead of \"father\" and \"mother.\" This decision marks a significant step towards inclusive family law in India, offering hope for queer and transgender families.</p>\n\n<p>The case arose after Zahhad, a transgender man, gave birth to a child with Ziya Paval, a transgender woman. Despite their legal recognition as transgender individuals, the child's initial birth certificate designated Zahhad as \"mother\" and Ziya as \"father,\" contradicting their identities. The couple sought the court's intervention to be recognized as \"parents\" to avoid potential psychological, legal, and social consequences for their child.</p>\n\n<p>Justice Rahman grounded his decision in Articles 14, 15, 19, and 21 of the Constitution, emphasizing equality, non-discrimination, freedom of expression, and the right to life and dignity. The court adopted a \"social context adjudication\" approach, asserting its constitutional responsibility to ensure equality when strict legal interpretations lead to injustice. The ruling signifies a monumental stride for the LGBTQIA+ community in India, as it acknowledges transgender parenthood and strengthens constitutional values of equality, dignity, and non-discrimination.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/kerala-ruling-redefines-parenthood-for-transgender-rights.jpg"
  },
  {
    "title": "Safeguarding Brand Identity: Delhi High Court Declares ‘RITZ’ A Well-Known Trademark",
    "description": "<p>The Delhi High Court, in the case of *The Ritz Hotel Limited v. M S Hotel Ritz*, ruled in favor of The Ritz Hotel Limited, declaring the trademark \"RITZ\" a well-known trademark under Section 2(1)(zg) and Section 11(7) of the Trade Marks Act, 1999. The case involved the Plaintiff's claim of trademark infringement and passing off against the Defendants.</p>\n\n<p>The Plaintiff, owner of \"The Ritz Paris,\" argued that the Defendants' use of \"RITZ\" for hotel services was misleading customers and damaging their reputation. The Plaintiff emphasized the long-standing history, global recognition, and extensive promotion of the \"RITZ\" and \"RITZ-CARLTON\" marks. The Defendants initially agreed to cease using the marks but were later found to still be using them, leading to further legal action.</p>\n\n<p>The court, noting the extensive use, geographical reach, public awareness, and goodwill associated with the Plaintiff's marks, determined that \"RITZ\" and \"RITZ-CARLTON\" had achieved the status of well-known trademarks. A permanent injunction was issued, preventing the Defendants from using the infringing marks and directing them to discontinue their websites. The uncontested nature of the proceedings highlighted that a trademark can be declared well-known even without significant opposition, provided the statutory criteria are satisfied. The ruling reinforces the importance of brand identity and safeguards names with established reputations from misuse.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/delhi-hc-declares-ritz-a-well-known-trademark.jpg"
  },
  {
    "title": "NCDEX Discontinues Nest Portal: Investor Grievances To Be Addressed Via SEBI’s Smart ODR",
    "description": "<p>The National Commodity & Derivatives Exchange Limited (NCDEX) has discontinued its NEST (NCDEX Electronic System for Tracking grievances) portal, effective June 11, 2025, aligning with SEBI's centralized Online Dispute Resolution (ODR) mechanism. The NEST portal, introduced in January 2023, facilitated direct filing and tracking of investor grievances within the NCDEX ecosystem.</p>\n\n<p>This transition is driven by SEBI's push for a unified grievance redressal system through its SMART ODR platform, as outlined in the SEBI Master Circular for Stock Exchanges and Clearing Corporations. The shift to SMART ODR aims to eliminate duplication of effort and ensure consistency in dispute resolution across the financial and commodity markets.</p>\n\n<p>Investors and market participants are now required to lodge complaints through SEBI's SMART ODR platform or SCORES, as the NEST portal is no longer operational for new complaints. This change ensures investor access to a streamlined and efficient dispute resolution process.</p>\n\n<p>The discontinuation of the NEST portal underscores NCDEX's commitment to regulatory compliance and its adoption of tech-driven solutions for effective grievance handling. Stakeholders are encouraged to update their compliance procedures and client support systems accordingly, utilizing the contact channels provided by NCDEX or their registered intermediaries for clarification.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/ncdex-discontinues-nest-portal-for-investor-grievances.jpg"
  },
  {
    "title": "Consumer Rights Vs. Corporate Responsibility: A Legal Perspective",
    "description": "<p>The District Consumer Disputes Redressal Commission, Mumbai Suburban, recently addressed a case, *Gargi Prakash Joshi & Another v. Wow Momos Foods Pvt. Ltd.*, concerning alleged deficiency in service under Section 35(1)(a) of the Consumer Protection Act, 2019. The complaint stemmed from the complainants being purportedly served non-vegetarian food (chicken momos) despite explicitly ordering a vegetarian \"Steam Darjeeling Momo Combo\" at a Wow Momos outlet.</p>\n\n<p>The complainants argued that this alleged negligence caused significant emotional distress and violated their religious sentiments, leading them to seek Rs. 6,00,000 in compensation. Wow Momos countered by claiming the complainants ordered non-vegetarian food, as shown on the invoice, and highlighted the availability of clear labeling and a complaint mechanism which the complainants ignored. They further argued that the complainants did not qualify as \"consumers\" under the Act, asserting that a refund had been processed and thus no deficiency remained.</p>\n\n<p>Ultimately, the Commission dismissed the complaint due to insufficient evidence proving the complainants ordered vegetarian momos or unknowingly consumed non-vegetarian food. The Commission also referenced that the labelling on the display board did provide some clarity and pointed to inconsistencies in the complainants' arguments.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/consumer-rights-vs-corporate-responsibility-a-legal-perspective.jpg"
  },
  {
    "title": "IndiaLaw Monthly Newsletter – May Edition: Key Highlights",
    "description": "<p>This edition of the IndiaLaw Monthly Newsletter covers significant developments in corporate and commercial law, focusing on consumer protection, emerging commerce models, regulatory updates, and real estate liability.</p>\n\n<p>A key case discussed involves a Consumer Forum's rejection of an insurer's narrow interpretation of \"accident\" in a rabies death claim. The newsletter also explores the legal complexities arising from the rapid growth of 10-minute commerce in India, specifically addressing challenges related to dark stores, quick commerce, and zonal compliance.</p>\n\n<p>Furthermore, it highlights SEBI's recent directives aimed at redefining Know Your Customer (KYC) norms to ensure universal accessibility. Finally, the newsletter summarizes a Supreme Court ruling clarifying that developers are not liable for a homebuyer's loan interest incurred due to delays in flat possession.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/indialaw-monthly-newsletter-may-edition.jpg"
  },
  {
    "title": "IndiaMART vs. PUMA: Balancing IP Protection and Intermediary Liability in the Digital Age",
    "description": "<p>The Delhi High Court addressed the intersection of Intellectual Property Rights and intermediary liability in the case of *IndiaMART Intermesh Limited vs. PUMA SE*. The central issue was whether IndiaMART's use of the trademark \"PUMA\" as a brand keyword on its B2B marketplace constituted trademark infringement, given that the platform facilitated listings that potentially included counterfeit PUMA goods.</p>\n\n<p>PUMA contended that IndiaMART facilitated the sale of counterfeit goods by allowing sellers to use the \"PUMA\" mark as a keyword, infringing on their registered trademark. IndiaMART argued that it operated as an intermediary under Section 2(1)(w) of the Information Technology Act, 2000, providing a platform for sellers without altering their content, and therefore should not be held liable for third-party listings.</p>\n\n<p>The court overturned the Single Judge's order, stating that offering \"PUMA\" as a brand keyword did not inherently constitute trademark infringement under Section 29 of the Trade Marks Act, 1999. The court emphasized that IndiaMART provided listing services and was not directly involved in the sales transactions between buyers and sellers. Furthermore, the court affirmed IndiaMART's immunity as an intermediary under Section 79(1) of the IT Act, as it did not originate or modify the content and took down infringing listings upon notification.</p>\n\n<p>The judgment reinforces the principles established in *Shreya Singhal v. Union of India*, clarifying that intermediaries are only deemed to have “actual knowledge” of unlawful content upon receiving a court order or formal notification from a government agency. Private complaints alone are insufficient to remove statutory immunity. This ruling establishes a balance between protecting trademark holders and preventing undue burdens on intermediaries, urging collaboration between platforms and IP owners through established grievance mechanisms. The decision highlights the need for robust monitoring and reporting systems to prevent counterfeit listings while preserving operational freedom and innovation within the digital economy.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/indiamart-puma-ip.jpg"
  },
  {
    "title": "Consumer Forum Rejects Insurer's Restrictive Interpretation of 'Accident' in Rabies Death Case",
    "description": "<p>The Uttarakhand State Consumer Disputes Redressal Commission ruled in favor of the complainant, Smt. Meera Srivastava, against IFFCO Tokio General Insurance Co. Ltd., reinforcing the principle that insurers must explicitly define exclusions in their policies. The case stemmed from the insurer's denial of a claim following the death of Smt. Srivastava’s husband due to complications from rabies, covered under a Personal Accident Insurance Policy.</p>\n\n<p>IFFCO Tokio rejected the claim, arguing that the policy covered events like road accidents and burns, not infectious diseases. However, the Commission found no specific policy clause excluding rabies or viral infections. They reasoned that the policy's definition of \"injury\" as an accidental bodily injury caused by external, violent, and visible means could encompass a rabies infection resulting from an animal bite. This interpretation aligns with legal precedents, including a Supreme Court ruling that snakebites qualify as accidental deaths under such policies.</p>\n\n<p>The Commission invoked the \"contra proferentem\" rule, stating that ambiguities in insurance contracts must be interpreted in favor of the policyholder. They concluded that IFFCO Tokio's repudiation lacked justification and constituted a deficiency in service under the Consumer Protection Act. The Commission directed IFFCO Tokio to pay the insured amount, compensation for mental anguish, and litigation costs. This decision underscores the importance of clear policy language and fair claim handling by insurers, particularly in cases of personal loss, and highlights that consumer forums will intervene when policyholder expectations are not met.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/rabies-death-forum-rejects-insurers-take-on-accident.jpg"
  },
  {
    "title": "Redefining KYC: SEBI’s Directives for Universal Accessibility",
    "description": "<p>The increasing digitization of services in India, propelled by initiatives like the Digital India Programme, necessitates inclusive digital processes, particularly in Know Your Customer (KYC) procedures. The Supreme Court of India's judgment in *Pragya Prasun v. Union of India* broadens Article 21 to ensure digital accessibility for all, including persons with disabilities (PwDs), aligning with the UN Convention on the Rights of Persons with Disabilities (UNCRPD) and the Rights of Persons with Disabilities Act, 2016 (RPwD Act).</p>\n\n<p>The legal framework emphasizes equal rights for PwDs in managing their financial affairs (Section 13(1) of the RPwD Act) and mandates access to information and communication technologies (ICT) through audio descriptions and sign language (Section 42). Section 46 requires service providers to achieve accessibility compliance, supported by the National Policy on Universal Electronic Accessibility, 2013.</p>\n\n<p>Enforcement mechanisms, including nodal officers, accessibility audits involving visually impaired individuals, and alternative liveness verification methods from the RBI, are crucial. Inclusive communication options like sign language and accessible formats such as Braille are essential. The Government of Goa has implemented inclusive practices like alternative verification methods and guardian assistance.</p>\n\n<p>SEBI's circular on May 23, 2025, directs registered intermediaries to adopt alternative KYC verification methods such as head movements, OTP-based authentication, and real-time video recordings, in alignment with the Supreme Court’s directives and the RPwD Act. This initiative recognizes digital access as a fundamental right under Article 21 and emphasizes the responsibility of service providers to adopt universal design principles. The Supreme Court's judgment in *Pragya Prasun v. Union of India* underscores the need for inclusive digital services and sets a strong example for integrating accessibility into India's digital infrastructure.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/sebi-kyc-guidelines-boost-accessibility.jpg"
  },
  {
    "title": "New CERSAI Compliance: Source of Funds Mandatory for SI Filings",
    "description": "<p>The Central Registry of Securitisation Asset Reconstruction and Security Interest of India (CERSAI) has introduced a new compliance requirement mandating financial institutions to disclose the source of funds when registering a security interest. This initiative aims to enhance regulatory oversight and improve transparency, particularly in on-lending or refinance arrangements.</p>\n\n<p>Established under the SARFAESI Act, CERSAI maintains a central registry of charges on movable, immovable, and intangible assets. The new mandatory fields introduced by CERSAI include the type of lending (direct lending, on-lending, or refinance), the Entity ID of the original lending institution (e.g., NABARD, NHB, SIDBI) in on-lending or refinance scenarios, and the Security Interest ID of the corresponding registration where refinance or on-lending is secured by a prior charge.</p>\n\n<p>This development has significant implications for banks, NBFCs, housing finance companies, and other lending institutions, requiring them to adapt their processes to capture and report the source of funds accurately. Proactive preparation will be essential for institutions to reduce compliance risk and ensure the continued legal enforceability of their secured interests. The objective is to bring greater clarity and control over lending chains and fund flows, particularly in multi-layered credit structures.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/new-cersai-compliance-alert.jpg"
  },
  {
    "title": "Madras High Court Affirms Same-Sex Couples Can Constitute a Family, Even Without Marriage",
    "description": "<p>The Madras High Court, in the case of MA v Superintendent of Police, has reaffirmed that same-sex couples can constitute a family, even in the absence of formal marriage. This ruling emerged from a habeas corpus petition filed under Article 226 of the Constitution, addressing the alleged unlawful detention and coercion of a woman by her family due to her sexual orientation. The court's decision emphasizes personal liberty, autonomy, and an evolving understanding of family, reflecting a progressive stance on LGBTQIA+ rights within the existing legal framework.</p>\n\n<p>The case was initiated by a petitioner seeking the release of her partner, who was allegedly being held against her will and subjected to coercive measures aimed at altering her sexual orientation. This was considered within the context of evolving LGBTQIA+ jurisprudence, particularly landmark judgments like NALSA v. Union of India and Navtej Singh Johar v. Union of India, which decriminalized consensual same-sex relationships.</p>\n\n<p>Justices G.R. Swaminathan and Justice V. Lakshminarayan ruled in favor of the petitioner, asserting the detainee's right to make her own life choices. The court reiterated that the concept of family extends beyond traditional definitions to include chosen families, underscoring personal autonomy as a cornerstone of dignity and freedom. The judiciary's role in safeguarding the constitutional rights of marginalized communities, including LGBTQIA+ individuals, was also emphasized.</p>\n\n<p>The court also cited Article 21 of the Indian Constitution, guaranteeing the right to life and personal liberty, and referenced the Yogyakarta Principles advocating for the universal enjoyment of human rights, including the right to form families free from discrimination based on sexual orientation. The court allowed the detainee to leave with the petitioner and ordered the police to ensure the couple's safety and address complaints from the LGBTQIA+ community promptly. This decision marks a significant step in recognizing and protecting the rights of LGBTQIA+ individuals in India, emphasizing the importance of judicial intervention in the absence of legislative recognition for same-sex marriage.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/madras-high-court-affirms-same-sex-couples-can-constitute-a-family-even-without-marriage.jpg"
  },
  {
    "title": "Revisiting FIR Quashing: Supreme Court’s Perspective in Abhishek Singh V. Ajay Kumar & ORS",
    "description": "<p>The Supreme Court of India, in *Abhishek Singh v. Ajay Kumar & Ors*, addressed the principles governing the quashing of FIRs, emphasizing the importance of prima facie evidence and procedural fairness. The case stemmed from allegations of fraud and misappropriation related to a loan agreement where the appellant, Abhishek Singh, pledged gold ornaments as collateral, which were later deemed counterfeit by the bank without his knowledge.</p>\n\n<p>The Patna High Court had quashed Singh's FIR, viewing it as a retaliatory measure lacking prima facie evidence. It further stated the appellant failed to file an affidavit under Section 156(3) CrPC. However, the Supreme Court overturned the High Court's decision, asserting that the quashing of an FIR should be based on the presence of a prima facie case, not an in-depth analysis of evidence at the preliminary stage.</p>\n\n<p>The Supreme Court found that the High Court exceeded its jurisdiction by engaging in evidentiary appreciation, a role reserved for the trial court. It noted inconsistencies in the High Court's reasoning, particularly concerning the appellant's intent and the absence of third-party verification during the gold revaluation. The Supreme Court restored the FIR, directing the trial court to proceed with the matter according to the law, and emphasized that its decision was not a reflection of the merit of the allegations. This decision underscores the caution required when quashing an FIR, ensuring thorough examination of allegations presenting a prima facie case through due process.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/abhishek-singh-v-ajay-kumar-ors.jpg"
  },
  {
    "title": "Supreme Court Rules: Developer Not Liable for Homebuyer’s Loan Interest Due to Delay in Flat Possession",
    "description": "<p>On June 4, 2025, the Supreme Court of India delivered a judgment in a case involving the Greater Mohali Area Development Authority (GMADA) and homebuyers Anupam Garg and Rajiv Kumar. The case centered on delays and unilateral changes in the 'Purab Premium Apartments' housing project, initiated in 2011. The court examined the legal obligations of developers and the rights of consumers under Indian law.</p>\n\n<p>The dispute arose after delays in the project's completion beyond the initial possession date of May 21, 2015. Anupam Garg, an allottee, filed a consumer complaint citing a lack of progress and unilateral changes. The State Consumer Disputes Redressal Commission (SCDRC) and the National Consumer Disputes Redressal Commission (NCDRC) initially ruled in favor of Garg, directing GMADA to refund the deposited amount with interest, compensation, and the interest paid on Garg's loan.</p>\n\n<p>GMADA appealed to the Supreme Court, contesting its liability for the loan interest. The Supreme Court, referencing precedents like *Bangalore Development Authority v. Syndicate Bank* and *GDA v. Balbir Singh*, ruled that GMADA was not liable for the homebuyers' loan interest. The Court deemed the already awarded 8% interest sufficient compensation for the delay, emphasizing that compensation must be based on specific losses or injuries suffered by the consumer.</p>\n\n<p>The Supreme Court's decision clarifies the extent of a developer's liability in cases of project delays, setting a precedent for future disputes. It reinforces the need for developers to adhere to contractual obligations and provide reasonable compensation for delays, while preventing undue financial burdens. The judgment aims to promote transparency, accountability, and fairness in the housing market, reaffirming the Court's commitment to protecting the interests of all parties involved in consumer disputes.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/supreme-court-rules-developer-not-liable-for-homebuyers-loan-interest-due-to-delay-in-flat-possession.jpg"
  },
  {
    "title": "From Shelf to Scooter: The Legal Mess Behind India’s 10-Minute Commerce Boom",
    "description": "<p>India's burgeoning quick commerce sector, characterized by companies promising deliveries in 10 minutes or less, faces substantial legal and regulatory hurdles. These challenges range from zoning violations due to strategically located \"dark stores\" in residential areas to food safety concerns and questions surrounding the rights and classifications of gig workers as \"independent contractors\". The article also considers the impacts on cost per order, profitability, and service fees on consumer interests.</p>\n\n<p>Regulatory compliance remains a major concern. Quick commerce platforms, often classified as IT companies, navigate grey areas to sidestep stringent retail regulations and labor laws which enable them to engage in predatory pricing practices. This has prompted investigations from the Competition Commission of India (CCI).</p>\n\n<p>The sector also grapples with economic sustainability. High operational costs and initially low average order values (AOV) present profitability challenges. While some platforms have managed to increase their AOV, this often involves offering higher-value product categories, each bringing its own regulatory and compliance complexities. Service fees and packaging costs further impact consumer interest and raise concerns from consumer protection agencies.</p>\n\n<p>Consumer protection is another critical area of focus. The Central Consumer Protection Authority (CCPA) scrutinizes delivery time claims and addresses issues like differential pricing based on device type. The CCPA is also cracking down on \"dark patterns\" through self-audits required of e-commerce platforms, designed to promote ethical and transparent user interfaces.</p>\n\n<p>Furthermore, the gig worker model employed by many quick commerce platforms has been under the scanner. Concerns arise regarding fair working conditions, lack of social security benefits, and pressures leading to unsafe practices. States like Rajasthan and Karnataka are introducing ordinances and acts to protect gig workers' rights and ensure welfare.</p>\n\n<p>Food safety is also a major area of regulatory focus. The Food Safety and Standards Authority of India (FSSAI) has issued comprehensive guidelines and licensing requirements for e-commerce food businesses, addressing concerns over hygiene and standards. Compliance is critical, with penalties for violations.</p>\n\n<p>Moreover, compliance with Legal Metrology (Packaged Commodity) Rules, 2011, is crucial to prevent misleading practices in quantity declaration and product labeling. Similarly, data privacy concerns arise from the vast amounts of consumer data collected by these platforms, with the Personal Data Protection Act, 2023, aiming to regulate data collection, usage, and storage.</p>\n\n<p>Foreign Direct Investment (FDI) in retail e-commerce in India is allowed up to 100% under the automatic route for marketplaces, while inventory-based e-commerce is not permitted, balancing the need for foreign capital with the protection of domestic businesses. Lastly, ensuring quality standards through hallmarking and adherence to BIS (Bureau of Indian Standards) is essential for products like jewelry and electronics to protect consumers from substandard goods.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/indias-10-minute-commerce-boom-its-legal-tangle.jpg"
  },
  {
    "title": "Bombay High Court Grants Full Reimbursement for Heart Surgery, Prioritizing Right to Life",
    "description": "<p>In a significant ruling, the Bombay High Court in *Anirudh Prataprai Nansi v. Union of India* directed the Central Government to fully reimburse ₹22,08,440 to Mr. Nansi, a retired government employee, for a heart transplant conducted at a private hospital. The court emphasized the primacy of Article 21 of the Constitution, safeguarding the right to life, in cases where essential medical treatment is unavailable through government-sponsored channels.</p>\n\n<p>The case arose from Mr. Nansi's urgent need for a heart transplant due to severe cardiomyopathy. Because no Central Government Health Scheme (CGHS)-approved hospital in Mumbai was equipped to perform the procedure at the time, he underwent the transplant at a private facility. The CGHS authorities initially approved a reimbursement based on an outdated CGHS-Mumbai rate of ₹69,000, which was significantly lower than the actual expenses.</p>\n\n<p>The High Court strongly criticized the CGHS's narrow, technical approach, asserting that rigid procedural compliance should give way to compassion and constitutional values in life-saving situations. The court highlighted that heart transplants are inherently urgent, the right to health is integral to Article 21, and the government has the power to relax guidelines in medical emergencies. It also emphasized that the lack of empanelled facilities cannot justify denying essential care and questioned the outdated and discriminatory reimbursement rates. The judgment reinforces that public health policies must prioritize the well-being and constitutional rights of individuals, especially in critical medical situations.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/hc-grants-full-reimbursement-for-surgery.jpg"
  },
  {
    "title": "Bombay High Court Allows Accused to Travel Abroad Amid Matrimonial Dispute",
    "description": "<p>The Bombay High Court granted permission to a Non-resident Indian (NRI) employed in the United States to travel abroad for work, despite facing charges in a matrimonial case. The ruling in *Sukrutkumar Babasaheb Bhandare vs. State of Maharashtra & Anr.* demonstrates a balanced judicial approach, considering both the accused's livelihood and the integrity of legal proceedings.</p>\n\n<p>The petitioner, Sukrutkumar Babasaheb Bhandare, was charged under various sections of the Indian Penal Code based on a complaint filed by his wife. He sought permission to return to the US, where he is employed. The Sessions Court initially rejected his plea, citing potential disruption to the investigation and mediation. Subsequently, the petitioner filed a Writ Petition.</p>\n\n<p>The High Court considered arguments from both parties, including the husband's cooperation with authorities and the wife's concern regarding withheld documents. Through joint request and exploration, both parties agreed to certain conditions. The conditions are that the husband hand over all documents and certificates belonging to the wife, provide electronic data stored on his laptop,andundertaking to participate and cooperate in the trial without causing any obstruction or delay.</p>\n\n<p>Justice Ashwin D. Bhobe, appreciating the cooperative approach, set aside the previous order and allowed the husband to travel, contingent upon adherence to the agreed-upon conditions. This case underscores the value of flexibility and cooperation in legal processes, showcasing how a balanced approach can lead to a just resolution that respects the rights and needs of all parties involved.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/bombay-hc-nri-travel-abroad-matrimonial-dispute.jpg"
  },
  {
    "title": "Section 95 IBC: NCLAT Chennai Bars Consecutive Insolvency Applications Against Same Guarantor",
    "description": "<p>The National Company Law Appellate Tribunal (NCLAT) in Chennai recently addressed the issue of consecutive insolvency resolution proceedings against a personal guarantor under Section 95 of the Insolvency and Bankruptcy Code (I&B Code) in the case of \"Indian Bank v. K R Tirumuruhan.\" This case clarifies the legal constraints when multiple financial creditors attempt to initiate insolvency proceedings against the same guarantor.</p>\n\n<p>The NCLAT upheld the NCLT's decision to dismiss Indian Bank's application, citing Section 96 of the I&B Code, which bars subsequent applications once proceedings have been initiated by another financial creditor. The ruling referenced a similar prior judgment, Indian Bank, SAMB, Chennai Vs T. Prabhakar, reinforcing the principle that the initial application takes precedence.</p>\n\n<p>The final decision dismissed the appeal, emphasizing the importance of adhering to the I&B Code and legal precedents. The NCLAT also directed the NCLT to expedite the pending Section 95 proceedings that prompted the appeal. This judgment reinforces the need for financial creditors to be aware of existing proceedings before initiating new ones to ensure the efficient and fair resolution of insolvency cases.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/section-95-ibc-nclat.jpg"
  },
  {
    "title": "Industrial Disputes Act and Article 19(1)(g): Supreme Court Upholds Right to Close Business",
    "description": "<p>The Supreme Court of India, in *Harinagar Sugar Mills Ltd. (Biscuit Division) versus the State of Maharashtra*, addressed the legality of industrial closures under the Industrial Disputes Act, 1947, and the constitutional right to close a business per Article 19(1)(g). The case stemmed from Harinagar Sugar Mills Limited's (HSML) closure of its biscuit division following the termination of a long-standing job work agreement with Britannia Industries Limited (BIL).</p>\n\n<p>HSML applied for closure, but the Government of Maharashtra requested additional information, which HSML provided. When the authorities requested resubmission, HSML argued that closure permission was automatically granted per Section 25-O(3) of the Industrial Disputes Act, 1947, due to the government's failure to respond within 60 days. The Bombay High Court dismissed HSML's petitions, deeming the application incomplete.</p>\n\n<p>The Supreme Court overturned the High Court's decision, holding that the initial request for information was not an order and the Deputy Secretary lacked the authority to request resubmission. The Court emphasized that the right to close a business is intrinsic to the right to conduct business under Article 19(1)(g), albeit subject to reasonable restrictions in the public interest under Article 19(6). The Court ruled that the 60-day period for deemed closure should be calculated from the initial application date, implying closure approval. HSML was directed to pay an additional Rs. 15 crores as compensation to the affected employees.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/industrial-disputes-act-close-business.jpg"
  },
  {
    "title": "RBI's Lending Against Gold and Silver Collateral Directions, 2025",
    "description": "<p>On June 6, 2025, the Reserve Bank of India (RBI) released the Reserve Bank of India (Lending Against Gold and Silver Collateral) Directions, 2025, a unified regulatory framework designed to harmonize the treatment of loans secured by gold and silver across all regulated entities (REs). The reform aims to enhance prudence, borrower protection, and operational transparency within the gold loan sector.</p>\n\n<p>The new Directions consolidate and repeal over 30 circulars issued between 1964 and 2023, addressing inconsistencies and supervisory gaps arising from the previously fragmented regulatory structure. Applicable to a wide range of REs, the Directions will be fully effective by April 1, 2026, with loans sanctioned prior to this date remaining subject to the guidelines in effect at the time of issuance.</p>\n\n<p>Key provisions include restricting permissible collateral to gold and silver jewellery, ornaments, and coins, while prohibiting lending against primary gold/silver bullion or financial instruments backed by such assets. Loan-to-Value (LTV) caps have been introduced and must be maintained throughout the loan tenure, alongside standardized assaying and valuation procedures. Consumer protection measures, operational restrictions, AML checks, guidelines for top-up loans and renewals, collateral management, auction transparency, and provisions for unclaimed collateral are also outlined. Furthermore, lenders are required to disclose detailed loan portfolio information relating to gold and silver-backed loans in their financial statements.</p>\n\n<p>The RBI's 2025 Directions represent a forward-looking regulatory stance, unifying legacy norms into a single set of principles to promote responsible and transparent gold loan practices. Financial institutions are encouraged to view these guidelines as an opportunity to build trust and better serve customers, particularly those who rely on gold loans for short-term liquidity.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/rbi-gold-silver-guideline.jpg"
  },
  {
    "title": "Authorized Officials Can Testify: J&K High Court Eases Cheque Bounce Procedure",
    "description": "<p>The Jammu & Kashmir High Court, in *Iftikhar Ashraf Trumboo v. Furqan Ahmad Rather*, has streamlined procedures for cheque dishonor cases under Section 138 of the Negotiable Instruments Act, 1881. The Court ruled that the personal appearance of a Branch Manager is not mandatory for proving bank records. Any duly authorized bank official with access to the necessary records is competent to testify, thereby overturning a Trial Magistrate's overly strict procedural interpretation.</p>\n\n<p>The case originated from a Section 138 complaint where a cheque was dishonored due to insufficient funds. When the complainant presented an authorized bank representative in lieu of the Branch Manager, the Trial Magistrate refused to record their testimony, demanding a formal substitution application. The High Court found this insistence on procedural formalities to be excessive and legally incorrect.</p>\n\n<p>Justice Sanjay Dhar clarified that any responsible bank officer with access to account records in the ordinary course of business can testify to documentary evidence, such as cheque return memos, without needing personal knowledge. The Court also deemed the invocation of Section 302 of the Criminal Procedure Code unnecessary, as it obstructs the summary nature of Section 138 proceedings. The admissibility of such evidence is governed by Sections 65B and 67 of the Indian Evidence Act, 1872, which facilitate the admission of electronic and documentary records maintained in the ordinary course of business.</p>\n\n<p>This decision aligns with existing legal principles promoting swift justice in cheque dishonor cases, as emphasized by the Supreme Court in *Indian Bank Association v. Union of India (2014)*. The J&K High Court's ruling reinforces the importance of efficient resolution of cheque bounce disputes, preventing procedural technicalities from hindering prompt justice under Section 138 of the NI Act.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/officials-jk-hc-cheque-bounce-procedure.jpg"
  },
  {
    "title": "CCPA Mandates Self-Audit for E-Commerce Platforms to Eliminate Dark Patterns",
    "description": "<p>The Central Consumer Protection Authority (CCPA) issued an advisory on June 5, 2025, mandating all e-commerce platforms in India to conduct self-audits to identify and eliminate dark patterns within three months. This directive, issued under the Consumer Protection Act, 2019, aims to foster a transparent and ethical digital ecosystem that prioritizes consumer interests.</p>\n\n<p>This action builds upon the \"Guidelines for Prevention and Regulation of Dark Patterns, 2023,\" by introducing a proactive compliance mechanism. Dark patterns are defined as manipulative design elements used to deceive users into unintended actions, such as unwanted purchases or unknowingly sharing personal data. The CCPA aims to ensure consumers are not subjected to coercive or misleading digital experiences.</p>\n\n<p>The Department of Consumer Affairs has already issued notices to 11 e-commerce platforms for violating the 2023 guidelines, demonstrating the seriousness of non-compliance. Platforms must prioritize adhering to CCPA principles, including design teams, legal and compliance departments, and marketing. Non-compliance could result in regulatory scrutiny, penalties, and reputational damage.</p>\n\n<p>This advisory signifies a crucial step towards a safer and more equitable digital economy in India, compelling e-commerce platforms to prioritize consumer welfare over manipulative growth tactics, emphasizing proactive compliance and responsible governance.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/ccpas-dark-patterns-mandates-self-audit.jpg"
  },
  {
    "title": "Mandatory Induction of CNG or Electric Vehicles by Aggregators and E-Commerce Entities in Delhi NCR",
    "description": "<p>The Commission for Air Quality Management (CAQM) has issued a directive mandating that all new fleet additions by motor vehicle aggregators, delivery service providers, and e-commerce platforms in Delhi-NCR must exclusively consist of compressed natural gas (CNG) or electric vehicles (EVs). This policy intervention aims to significantly reduce vehicular emissions in the highly polluted National Capital Region.</p>\n\n<p>The CAQM invoked its authority under the Commission for Air Quality Management in National Capital Region and Adjoining Areas Act, 2021, issuing Direction No. 94 dated 03.06.2025. This directive applies to entities operating fleets of 25 or more vehicles and requires a phased transition to CNG and EV fleets.</p>\n\n<p>Vehicular pollution, especially from commercial vehicles, significantly contributes to air pollution in the NCR. The rapid growth of e-commerce and app-based logistics has exacerbated this issue. This policy aligns with national initiatives like the National Electric Mobility Mission Plan (NEMMP), the Faster Adoption and Manufacturing of Hybrid and Electric Vehicles (FAME) schemes, and state EV policies, promoting a cleaner transport ecosystem. The CAQM directive represents a key regulatory effort to decarbonize commercial transportation in the NCR and achieve sustainable logistics with legal backing.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/cng-evs-aggregators-e-commerce-delhi.jpg"
  },
  {
    "title": "Delhi High Court Upholds Maintenance Obligations Under Section 24 Of The Hindu Marriage Act",
    "description": "<p>The Delhi High Court, in *Subhash v. Mamta @ Raksha*, reaffirmed that a husband's obligation to maintain his wife and child under Section 24 of the Hindu Marriage Act (HMA), which provides for interim maintenance during matrimonial proceedings, cannot be diminished by citing personal financial commitments like loan EMIs or insurance premiums. The court emphasized that maintenance calculations should be based on the husband's earning capacity and gross income, excluding voluntary expenses, thus safeguarding dependent spouses and children from attempts to evade maintenance responsibilities.</p>\n\n<p>The case arose from a marital dispute where the wife sought interim maintenance after the husband filed for divorce. The Family Court ordered the husband, with a declared monthly income of ₹47,000, to pay ₹15,000 monthly for the wife and child. The husband challenged this, arguing reduced disposable income due to loan obligations and insurance payments. The High Court rejected these arguments, stating that voluntary financial obligations cannot supersede the primary duty to maintain dependents.</p>\n\n<p>The Court's analysis aligned with the Supreme Court’s stance in *Manish Jain v. Akanksha Jain*, emphasizing that financial commitments like home loans cannot dilute the legal duty of maintenance. The court also found the wife's unemployment to be genuine due to caregiving responsibilities, consistent with *Shailja & Anr. v. Khobbanna*, which affirms a qualified wife's entitlement to maintenance if she's not earning due to legitimate duties. The ruling reinforces the judiciary's commitment to protecting the financial well-being of spouses and children post-separation. Voluntary personal expenses cannot reduce statutory maintenance. The judgement makes maintenance an effective financial safeguard.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/hc-obligation-hindu-marriage-act.jpg"
  },
  {
    "title": "Safeguarding Consumer Communication: Addressing Unsolicited Commercial Communication",
    "description": "<p>Unsolicited Commercial Communication (UCC), or spam, poses significant challenges in the digital age, including privacy violations and cybersecurity risks. These unrequested messages, promoting goods or services, necessitate robust regulations and technological solutions to protect consumers. The Telecom Commercial Communications Customer Preference Regulations (TCCCPR), 2018, and its subsequent amendments, aim to tackle UCC through enhanced measures.</p>\n\n<p>The TCCCPR defines UCC as any commercial communication that doesn't align with the recipient's consent, excluding transactional and government-issued messages. The Second Amendment, introduced in 2025, refines the framework by classifying mixed promotional content as promotional, requiring prior notification for auto-diallers, and implementing stricter provider obligations such as communication authentication and adherence to regulations. A key update is the abolishment of inferred consent from existing business relationships, mandating fresh consent after service contract termination.</p>\n\n<p>A streamlined complaint mechanism, featuring a standardised format and quicker response times, is now in place to bolster consumer control. Consumers can report UCC with minimal information, and service providers must respond within five days. Violators face penalties ranging from fines to blacklisting and service disconnection. Technical measures, consumer education campaigns, and proactive registration with \"do-not-disturb\" services further aid in combating spam.</p>\n\n<p>Globally, countries are employing various strategies, with India's blockchain-based Distributed Ledger Technology (DLT) framework setting a high standard by ensuring transparency, accountability, and explicit consent. This contrasts with the US CAN-SPAM Act's opt-out mechanisms and the EU GDPR's focus on explicit consent. Effective UCC mitigation requires collaborative efforts among regulators, telecom providers, and consumers, along with ongoing innovation and the adoption of best practices to foster trust and integrity in digital communication.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/unsolicited-commercial-communication.jpg"
  },
  {
    "title": "Kerala High Court Upholds Right to Religious Identity in Educational Records: Sudhin Krishna Case",
    "description": "<p>The Kerala High Court, in the case of *Sudhin Krishna C. S. v State of Kerala and Ors*, reaffirmed an individual's constitutional right under Article 25 to freely choose and reflect their religious identity in official records. The ruling, delivered by Justice D.K. Singh, centered on a petitioner's request to amend his name and religion in his educational documents.</p>\n\n<p>Sudhin Krishna C.S., originally registered as Mohammed Riyazudeen C.S., sought to correct his records to reflect his Hindu identity, which he adopted upon reaching adulthood. The District Educational Officer (DEO) denied his request, citing the Kerala Education Rules (KER), 1959, as not explicitly allowing such changes. The petitioner then appealed to the Kerala High Court, arguing that Rule 3(1) of Chapter VI of the KER permitted such amendments.</p>\n\n<p>The petitioner contended that Rule 3(1) of Chapter VI of the KER explicitly allows changes to details such as name, religion, and caste, citing the violation of religious freedom under Article 25 of the Constitution. The respondents countered that the KER primarily addressed corrections to dates of birth, limiting the Commissioner of Examinations' authority to make broader changes.</p>\n\n<p>The High Court interpreted Rule 3(1) of Chapter VI of the KER to encompass alterations beyond just the date of birth, extending to personal details like name, religion, and caste. The court directed the respondents to amend the petitioner's educational records to accurately reflect his chosen name and religion, underscoring the principles of personal liberty, self-determination, and the right to an accurate representation of one’s chosen identity in official documents.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/right-to-religious-educational.jpg"
  },
  {
    "title": "Karnataka's 2025 Tobacco Law Overhaul: Implications for Businesses and Citizens",
    "description": "<p>On May 30, 2025, the Government of Karnataka enacted the Cigarettes and Other Tobacco Products (Prohibition of Advertisement and Regulation of Trade and Commerce, Production, Supply, and Distribution) (Karnataka Amendment) Act, 2024, amending the COTPA, 2003. Key changes include raising the legal age for purchasing tobacco products from 18 to 21 years and increasing the maximum fine for violations from ₹200 to ₹1,000. The legislation aims to strengthen tobacco control and reduce consumption, particularly among youth.</p>\n\n<p>The amendment broadens the prohibition of tobacco use in public places to include both smoking and spitting, while allowing designated smoking areas in larger hotels, restaurants, and airports that meet specific requirements. A complete ban on hookah bars has also been introduced, reflecting the state's effort to regulate tobacco consumption in social environments. The sale of tobacco products is now restricted to individuals 21 years and older, and increased scrutiny will be applied to sales near educational institutions.</p>\n\n<p>Significant penalties have been introduced for operating hookah bars, including imprisonment from one to three years and fines ranging from ₹50,000 to ₹1,00,000. Dr. U.S. Vishal Rao, a member of Karnataka’s High-Powered Committee on Tobacco Control, believes these amendments are a crucial step in curbing tobacco use among the younger population. Bengaluru Police Commissioner B. Dayananda has emphasized strict enforcement, urging establishments to adhere to COTPA guidelines for designated smoking areas.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/karnataka-2025-tobacco-law-businesses.jpg"
  },
  {
    "title": "Supreme Court Reaffirms Finality in AGR Dues: Dismisses Vodafone Idea’s Writ Petitions",
    "description": "<p>The Supreme Court of India dismissed writ petitions filed by Vodafone Idea Ltd. and other telecom operators, reaffirming the finality of its previous rulings on Adjusted Gross Revenue (AGR) dues. The petitions, filed under Article 32 of the Constitution, challenged the imposition of interest, penalties, and interest on penalties related to AGR.</p>\n\n<p>The core issue stems from differing interpretations of AGR between telecom operators and the Department of Telecommunications (DoT). A 2019 Supreme Court judgment sided with the DoT, significantly increasing the financial liabilities of telecom companies. While the Court allowed payment in ten annual installments in 2020, the operators sought further relief in 2025, arguing that interest and penalties were economically unsustainable.</p>\n\n<p>The Supreme Court bench dismissed the petitions, emphasizing that Article 32 cannot be used to reopen conclusively decided matters. The Court underscored the importance of judicial discipline and the finality of its judgments, signaling that the remedy for economic grievances lies in policy engagement, not repeated litigation. This decision reinforces legal certainty for the telecom sector, urging companies to focus on operational stability and financial restructuring within the established framework of AGR liabilities and payment timelines.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/sc-agr-due-vodafone-ideas-writ-petition.jpg"
  },
  {
    "title": "Stamp Duty Compliance Just Got Smarter: Rajasthan Launches Mandatory API-Based Calculator For All Digital Document Executions",
    "description": "<p>The Government of Rajasthan has launched a mandatory automated Stamp Duty Calculator API for all digitally executed documents within the state's Digital Document Execution (DDE) platform, effective May 30, 2025. This initiative, developed in collaboration with Stock Holding Corporation of India Limited (SHCIL) and National E-Governance Services Ltd. (NeSL), aims to standardize stamp duty assessment and eliminate errors associated with manual calculations.</p>\n\n<p>This new system enhances the DDE workflow by ensuring uniformity and accuracy in stamp duty calculation for transactions executed in Rajasthan, and it is intended to ensure accuracy by removing the possibility of manual entry errors.</p>\n\n<p>The introduction of the Rajasthan Stamp Duty Calculator API represents a significant advancement in e-governance for digital legal documentation. By enforcing standardized, automated duty computation, the initiative strengthens regulatory compliance, reduces human error, and enhances operational efficiency for financial institutions. Stakeholders are advised to adapt quickly to ensure full compliance.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/stamp-duty-rajasthan-api-calculator-digital-document.jpg"
  },
  {
    "title": "Calcutta High Court Upholds Scientific Merit Over Moral Speculation in Patent Law",
    "description": "<p>The Calcutta High Court recently ruled in favor of ITC Limited regarding their patent application for a \"Heater Assembly to Generate Aerosol,\" overturning the Controller of Patents' initial rejection. The Controller had cited Section 3(b) of the Patents Act, 1970, expressing concerns about public health and morality related to the device's potential use, particularly given the Prohibition of Electronic Cigarettes Act, 2019.</p>\n\n<p>The Court emphasized that patent denials based solely on moral or public health grounds require independent scientific or technical evidence, and subjective notions are insufficient justification. The Controller's assumption that the invention was exclusively intended for tobacco products was incorrect, as the device could be used with various substrates.</p>\n\n<p>Justice Ravi Krishnan Kapur clarified that the e-cigarette ban addresses commercial activities, not the inherent patentability of an invention. Furthermore, the Controller's reliance on undisclosed documents violated principles of natural justice, denying ITC an opportunity to respond and rendering the decision procedurally flawed. The court has reaffirmed that bans on sale or distribution of products do not automatically equate to a ban on innovation and that health regulations should not unduly influence patent decisions.</p>\n\n<p>In conclusion, the High Court set aside the Controller's order and remanded the matter for a fresh decision, stressing the need for a hearing and adherence to scientific and technical grounds. This ruling underscores the importance of relying on evidence-based assessments in patent law and establishes a narrower interpretation of Section 3(b), reinforcing the separation between health regulations and patent eligibility.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/calcutta-hc-favors-science-in-itc-aerosol-patent-ruling.jpg"
  },
  {
    "title": "Breaking the Mold: Can Courts Now Rewrite Arbitral Awards?",
    "description": "<p>In *Gayatri Balasamy v. ISG Novasoft Technologies Ltd.*, a Supreme Court Constitution Bench addressed the power of Indian courts to modify arbitral awards under Sections 34 and 37 of the Arbitration and Conciliation Act, 1996. The 4:1 majority held that limited judicial modification is permissible in specific circumstances, including clerical errors, severable portions, post-award interest, and under Article 142. This departs from the earlier decision in *NHAI v. Hakeem*, raising concerns about judicial overreach and its impact on the finality and autonomy of arbitration.</p>\n\n<p>The case arose from conflicting judicial opinions regarding the power of Indian courts to modify arbitral awards, with some allowing it and others ruling against it. The Supreme Court aimed to resolve whether courts can modify awards or only set them aside. The Arbitration Act, modeled on the UNCITRAL Model Law, emphasizes limited court intervention, primarily allowing courts to set aside awards on specific grounds. However, the *Balasamy* ruling permits modifications in limited cases, sparking debate.</p>\n\n<p>Supporters argue that limited judicial modifications promote judicial economy and prevent delays. Opponents maintain that such powers conflict with the legislative intent of the Arbitration Act, potentially undermining arbitration's core principles and inviting further litigation. The ruling endorses judicial modifications under narrow circumstances and constitutional powers under Article 142. This interpretation has raised concerns about the integrity and indivisibility of arbitral awards, as well as potentially breaching the separation of powers.</p>\n\n<p>The majority's expansive view of Section 34 risks tactical litigation, weakens tribunal authority, and erodes arbitration’s finality. Arbitral awards are generally unified instruments, and selectively modifying them compromises their coherence. Justice K.V. Viswanathan's dissent underscores that Article 142 cannot override clear statutory provisions, stressing judicial restraint and respect for legislative boundaries. Ultimately, the *Balasamy* decision introduces a nuanced approach, allowing limited court modifications, including severing invalid portions, correcting errors, modifying post-award interest, and invoking Article 142 to ensure complete justice.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/mold-courts-rewrite-arbitral-awards.jpg"
  },
  {
    "title": "Supreme Court Rules on Retirement Age for Disabled Employees: A Summary of *Kashmiri Lal Sharma v. Himachal Pradesh State Electricity Board*",
    "description": "<p>The Supreme Court of India, in the case of *Kashmiri Lal Sharma v. Himachal Pradesh State Electricity Board*, addressed the issue of retirement age disparities among employees with disabilities. The appellant, a 60% locomotor-disabled electrician, challenged his retirement at age 58, arguing it violated Article 14 of the Constitution due to an earlier Office Memorandum (OM) that allowed visually impaired employees to work until 60. The State later withdrew this OM, reverting the retirement age to 58 for all categories.</p>\n\n<p>The Court reaffirmed that setting the retirement age is a policy decision within the executive's purview, subject to the principles of equality. The appellant contended that the disparity violated Article 14 and that he had a legitimate expectation to work until 60 due to the OM's earlier existence. Conversely, the State argued that the OM's withdrawal negated any claims for extended retirement.</p>\n\n<p>Referencing the Persons with Disabilities (PWD) Act, 1995, and the Rights of Persons with Disabilities (RPWD) Act, 2016, the Court emphasized the need for equal treatment regarding employment benefits for individuals with benchmark disabilities. While partially allowing the appeal, the Court ruled that the appellant was entitled to full wages and benefits until the OM's withdrawal date (November 4, 2019) and that his pension should be calculated accordingly. The Court firmly stated that employees do not have a vested right to continue employment beyond the date of the OM's withdrawal, reinforcing the executive's right to determine retirement age through policy decisions, while still adhering to constitutional principles of fairness and equality.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/no-absolute-right-retirement-timing.jpg"
  },
  {
    "title": "Admission of CIRP Under Section 7 of the IBC, 2016, is Liable to Be Recalled Upon Establishment of Fraud or Malicious Intent Under Section 65 of the Code",
    "description": "<p>The National Company Law Appellate Tribunal (NCLAT) upheld the Adjudicating Authority's decision to terminate the Corporate Insolvency Resolution Process (CIRP) against a corporate debtor, based on findings that the insolvency proceedings were initiated fraudulently and with malicious intent. This ruling underscores the importance of Section 65 of the Insolvency and Bankruptcy Code (IBC), 2016, which safeguards against the abuse of the Code's process.</p>\n\n<p>The case involved a dispute where the Appellants initiated CIRP under Section 7, claiming to be financial creditors. The Respondent argued that the CIRP was a fraudulent attempt to defeat ongoing litigation related to the illegal dilution of their shareholding. The Adjudicating Authority terminated the CIRP, citing collusion, document fabrication, and misuse of the insolvency process.</p>\n\n<p>The NCLAT affirmed the NCLT’s findings, emphasizing that the existence of debt and default does not shield a Section 7 application from scrutiny under Section 65 when collusion or abuse is proven. The Tribunal found significant documentary inconsistencies, violations of corporate law, manipulation of timing, and corroborative evidence of fraud. The Court clarified that terminating the CIRP was an adjudication on fraud and not a review of the admission order.</p>\n\n<p>This decision reinforces the judiciary's commitment to preventing the strategic abuse of the IBC, 2016. While Section 7 allows creditors to initiate CIRP based on financial debt and default, this mechanism is subject to scrutiny. Section 65 empowers the Adjudicating Authority to annul proceedings tainted by fraud or bad faith, thereby protecting the integrity of the Code.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/admission-cirp-under-section-7-ibc-2016.jpg"
  },
  {
    "title": "Government Cracks Down On E-Commerce Dark Patterns",
    "description": "<p>The Indian government, through the Ministry of Consumer Affairs, has initiated enforcement action against eleven leading e-commerce and technology platforms for violating the \"Guidelines for Prevention and Regulation of Dark Patterns, 2023.\" Notices were issued on May 28, 2025, citing deceptive user interface practices that mislead consumers.</p>\n\n<p>These guidelines, effective since November 30, 2023, define dark patterns as manipulative design techniques that exploit cognitive biases to influence consumers into unintended actions, such as unwanted purchases or data sharing. Common examples include drip pricing, basket sneaking, and subscription traps, prevalent across various digital platforms.</p>\n\n<p>The 2023 guidelines, legally binding under the Consumer Protection Act, 2019, identify thirteen specific types of dark patterns and encourage consumers to report violations. Despite this, several companies persisted in using these practices, prompting the government's action, which centered around deceptive advertising, forced actions, and subscription traps.</p>\n\n<p>This enforcement aims to enhance transparency and fairness in online transactions, ensuring consumer consent and control. Businesses must now prioritize ethical design and compliance, facing potential penalties for non-compliance. This initiative marks a significant stride towards ethical digital engagement, safeguarding consumer rights and fostering responsible innovation in the digital economy.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/misled-shopping-online-govt-e-commerce.jpg"
  },
  {
    "title": "PESO Introduces Online Module for Licensing Compressed Hydrogen Dispensing Stations in India",
    "description": "<p>The Petroleum and Explosives Safety Organisation (PESO), under the Government of India, launched an online module on May 14, 2025, to streamline the application process for licenses for Compressed Hydrogen Dispensing Stations under the Gas Cylinder Rules 2016. This initiative aims to enhance safety, promote efficiency, and modernize the regulatory framework within the petroleum and explosives industry.</p>\n\n<p>The new online module mandates that all new applications be submitted through the PESO website, eliminating manual submissions. Existing operators with trial permissions are also directed to use the online module to obtain necessary approval licenses.</p>\n\n<p>The application process involves logging in to the PESO website, completing the online form with details such as site address, capacity, and validity, uploading required documents and drawings, and making the required payment online. This standardization reduces the risk of errors, enhances transparency, and improves the overall efficiency of the licensing process. The initiative also supports the government's broader efforts to promote digital transformation and regulatory modernization.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/pesos-module-hydrogen-stations-in-india.jpg"
  },
  {
    "title": "Streamlining Insolvency Professional Appointments: The IBBI’s 2025 Guidelines for Insolvency Professionals",
    "description": "<p>The Insolvency and Bankruptcy Board of India (IBBI) has released the “Insolvency Professionals to act as Interim Resolution Professionals, Liquidators, Resolution Professionals and Bankruptcy Trustees (Recommendation) Guidelines, 2025,” effective from July 1, 2025, to December 31, 2025. These guidelines aim to streamline the appointment process of Insolvency Professionals (IPs) by the National Company Law Tribunal (NCLT) and Debt Recovery Tribunal (DRT), enhancing transparency and efficiency in corporate and individual insolvency cases under the Insolvency and Bankruptcy Code, 2016 (IBC).</p>\n\n<p>The guidelines, issued under various sections of the IBC and related rules, specify eligibility criteria for IPs seeking inclusion in the panel. These criteria include the absence of pending disciplinary proceedings, no convictions in the last three years, submission of an expression of interest in Form A by June 22, 2025, and holding a valid Authorization for Assignment (AFA). The expression of interest constitutes an unconditional consent to act in any specified role.</p>\n\n<p>The IBBI will create a zone-wise and bench-wise common panel of IPs valid for six months, which will be shared with the Adjudicating Authority. The sorting criteria will be based on the volume of ongoing assignments related to liquidation and corporate insolvency resolution processes, with the registration date with the Board serving as a tie-breaker. IPs included in the panel are expected to accept appointments unless otherwise permitted by the NCLT, DRT, or IBBI, with unjustified refusals resulting in removal from the panel for six months.</p>\n\n<p>These guidelines also stipulate that IPs must not surrender their registration or membership during the panel's validity. While the Adjudicating Authority retains the discretion to appoint any IP from the panel, the overarching goal of the new guidelines is to ensure a streamlined and efficient IP appointment process, thereby improving the effectiveness of the IBC. The 2024 guidelines have been repealed.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/ibbi-2025-guidelines-insolvency-professional.jpg"
  },
  {
    "title": "FSSAI Issues Guidelines for Acceptance of Recycled PET as Food Contact Material",
    "description": "<p>On May 23, 2025, the Food Safety and Standards Authority of India (FSSAI) issued a notification outlining guidelines for the acceptance of recycled Polyethylene Terephthalate (PET) as Food Contact Material (FCM-rPET). These guidelines, under the Food Safety and Standards (Packaging) Regulations, 2018, aim to ensure the safety and quality of recycled PET used in food packaging.</p>\n\n<p>The guidelines cover the recycling process of post-consumer PET used in food applications, specifying acceptance criteria for FCM-rPET resin, and apply only to recycling technologies approved by FSSAI. Key definitions include the Food Authority (FSSAI), manufacturer (recycling process operator), Virgin PET (vPET), Post-Consumer Food Grade PET, PET Resin, and Recycled Polyethylene Terephthalate (FCM-rPET).</p>\n\n<p>Stringent testing procedures are mandated, including the Challenge Test, Extraction Test, and Migration Test, all conducted in NABL/ILAC accredited labs. Process requirements ensure the purity and safety of recycled PET, with input meeting minimum quality standards and validation criteria using the challenge test. The level of decontamination must be below 220 µg/kg in the resin or below 10 µg/kg in the food for each surrogate contaminant.</p>\n\n<p>The acceptance criteria for FCM-rPET resin require conformity to specifications, including decontamination levels and validation tests. Food contact materials made from FCM-rPET resin must carry a specific symbol, FCM-rPET-X (X representing the percentage of recycled resin used), and indicate that the packaging material is made with recycled PET.</p>\n\n<p>Manufacturers, converters, beverage bottlers, food packers, and Food Business Operators (FBOs) must maintain and provide documentation, including a Declaration of Compliance, a Regulatory Opinion, and supply chain records. Manufacturers must apply for authorization using Form I, subject to an annual audit, with the FSSAI either authorizing or rejecting applications based on assessment (Form II). Conditions for authorization include the right to inspect records and facilities, compliance with FSSAI criteria, and maintenance of specified documents.</p>\n\n<p>The FSSAI's notification is a significant step towards ensuring the safety and quality of food packaging materials by outlining guidelines for testing, process requirements, acceptance criteria, marking, documentation, and authorization to safeguard public health and promote sustainable practices.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/fssai-recycle-pet-food-contact-material.jpg"
  },
  {
    "title": "India Imposes Ban on Import and Transit of Goods from Pakistan",
    "description": "<p>On May 2, 2025, India's Directorate General of Foreign Trade (DGFT), under the Ministry of Commerce and Industry, issued Notification 06/2025-26, effectively banning the import and transit of all goods originating in or exported from Pakistan. This action, taken under the Foreign Trade Policy (FTP) 2023 through the insertion of Paragraph 2.20A, is aimed at safeguarding national security and public policy.</p>\n\n<p>The legal basis for the ban is rooted in Section 3 read with Section 5 of the Foreign Trade (Development & Regulation) Act, 1992, as well as Paragraphs 1.02 and 2.01 of the FTP 2023. These provisions grant the Central Government the authority to regulate trade activities that could pose a threat to national interests. The prohibition covers all goods, regardless of existing trade regulations.</p>\n\n<p>While the ban is comprehensive, the notification allows for potential exceptions with prior approval from the Government of India. This measure reflects a significant shift in India-Pakistan trade relations and is likely to impact businesses and industries dependent on imports from Pakistan, potentially leading to a re-evaluation of trade policies. The ban remains in effect until further notice, underscoring the government's commitment to national security and public policy.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/india-ban-import-transit-goods-pakistan.jpg"
  },
  {
    "title": "High Court of Punjab and Haryana: Proportionality in Punishment is Key in Disciplinary Actions",
    "description": "<p>The High Court of Punjab and Haryana has reduced the punishment of a police officer penalized for a single day's absence, underscoring the importance of proportionality in disciplinary actions. The case, *Satyaveer Singh vs State of Haryana and others*, highlights the court's commitment to ensuring punishments are commensurate with the offenses committed.</p>\n\n<p>Satyaveer Singh, a Constable in the Haryana Police Force, was initially dismissed for being absent from duty for 24 hours and 20 minutes. This dismissal was later reduced to forfeiture of 10 annual increments. Singh then challenged this decision, arguing the punishment was disproportionate. The respondent argued that being part of a disciplined force, Singh was expected to maintain high standards.</p>\n\n<p>The High Court, referencing Rule 16.2 of the Punjab Police Rules, 1934, and Supreme Court judgments like *Om Kumar v. Union of India* and *Bhagat Ram v. State of Himachal Pradesh*, emphasized the principle of proportionality and its basis in Article 14 of the Constitution of India. It concluded that forfeiting 10 annual increments for a single day's absence was excessive. To avoid further litigation, the court reduced the punishment to forfeiture of one increment with cumulative effect, emphasizing the need for proportionate punishments.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/high-court-of-punjab-and-haryana-proportionality-in-punishment-is-key-in-disciplinary-actions.jpg"
  },
  {
    "title": "Karnataka Enacts Groundbreaking Ordinance For Gig Worker Welfare",
    "description": "<p>The Government of Karnataka has introduced the Karnataka Platform Based Gig Workers (Social Security and Welfare) Ordinance, 2025, a pioneering policy initiative designed to protect the rights and welfare of gig workers within the state's growing gig economy. This ordinance establishes a legal framework that defines the obligations of aggregators and digital platforms, ensuring the provision of social security and welfare benefits for gig workers.</p>\n\n<p>The ordinance applies to all aggregators and platforms operating in Karnataka that offer services listed in the Schedule. It provides a legal basis for social security, occupational health and safety, transparency in automated monitoring systems, and effective dispute resolution mechanisms. A \"gig worker\" is defined as an individual performing work based on a contract with a specified rate of payment, typically through a digital platform. Platforms are digital arrangements that assign tasks, while aggregators are digital intermediaries. A welfare fee, ranging from 1% to 5% of a worker's payout, will be levied on platforms to fund these entitlements.</p>\n\n<p>To administer the ordinance, a dedicated Karnataka Platform Based Gig Workers Welfare Board will be established, comprising government officials, worker and aggregator representatives, civil society members, and technical experts. This statutory body, headquartered in Bengaluru, will have the power to acquire assets, enter into contracts, and initiate legal action. Platforms are required to register with the Board, provide fair contracts, and ensure transparency in algorithmic management.</p>\n\n<p>A Karnataka Gig Workers Social Security and Welfare Fund will be created, financed by welfare fees, voluntary contributions, government grants, and other permitted sources. Financial transactions will be audited annually, and a Payment and Welfare Fee Verification System (PWFVS) will monitor payouts. Non-compliance will result in penalties, and the State Government is authorized to issue rules for enforcement.</p>\n\n<p>This ordinance marks a significant development in India's digital economy, establishing a comprehensive legal framework to protect gig workers' rights, regulate platform responsibilities, and ensure access to social security. By recognizing gig workers as a distinct labor category entitled to social protection, Karnataka sets a national precedent and establishes a model for other states and the central government.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/karnataka-groundbreaking-gig-worker.jpg"
  },
  {
    "title": "CDSCO Clarifies Permissions for Overprinting, Stickering, and Stamping of Imported Drugs",
    "description": "<p>The Central Drugs Standard Control Organization (CDSCO), under the Directorate General of Health Services, issued an Office Memorandum on May 26, 2025, to clarify comprehensive permission for importing drugs for labelling, overprinting, and stickering under Rule 104A of the Drugs and Cosmetics Rules, 1945. This clarification builds upon a previous directive from January 29, 2020, and addresses specific requirements for these activities.</p>\n\n<p>Rule 104A generally prohibits alterations to drug labels, but allows for exceptions with Licensing Authority permission. The memorandum specifies conditions for permissible alterations, especially for imported drugs. The key provision outlines that labelling, overprinting, or stickering is allowed only for imported drugs, and importers must possess a valid manufacturing license to undertake these activities.</p>\n\n<p>Licensees are required to have adequate storage, ancillary areas, and labelling facilities. They must also appoint at least one qualified manufacturing and QA personnel, as determined by the State Licensing Authority (SLA). While a QC laboratory and personnel may not be mandatory, qualified personnel must ensure adherence to regulatory standards. The labelling process must comply with existing Drugs and Cosmetics Rules, ensuring the original label remains visible and the License number and activity performed are clearly indicated. For instance, drugs intended for CGHS supply should be labelled with \"CGHS Supply Overprint\" to clearly denote their intended use.</p>\n\n<p>In conclusion, the CDSCO's memorandum provides essential guidance on importing drugs for labelling and overprinting under Rule 104A. It specifies requirements for importers, facilities, personnel, and compliance, ensuring regulatory adherence while facilitating the import of necessary drugs.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/cdsco-104a-drugs-cosmetics-rules-1945.jpg"
  },
  {
    "title": "Navigating the Roadmap for DPDP Compliance: What Companies Need to Start On",
    "description": "<p>The impending Digital Personal Data Protection (DPDP) Rules 2025 in India necessitate that organizations proactively adapt their data governance to comply and demonstrate a commitment to data protection. This shift can foster customer trust and differentiate businesses in a privacy-conscious market. The DPDP Act emphasizes key principles such as accountability, transparency, data minimization, and proactive risk management, requiring a reevaluation of existing strategies.</p>\n\n<p>To prepare for compliance, organizations should begin by performing a gap assessment of their current data handling practices against the DPDP Act requirements. This includes determining applicability and specific obligations as data fiduciaries or processors. Priority should be given to tasks with external implications, such as implementing compliant consent management, ensuring clear communication with data principals, and retaining consent logs.</p>\n\n<p>Enhancing data security through advanced data governance measures is also crucial. This includes implementing encryption, access controls, and regular security audits. Furthermore, internal tasks such as data mapping, establishing data lifecycle management practices, and appointing a Data Protection Officer (DPO) are essential for comprehensive compliance. Significant Data Fiduciaries (SDFs) will also need to conduct Data Protection Impact Assessments (DPIAs) and audits.</p>\n\n<p>Additional strategic recommendations include establishing a robust incident response plan with assigned roles and periodic simulations, developing customizable breach notification templates, fostering cross-departmental collaboration and staff training, and strengthening data security infrastructure through state-of-the-art verification technologies. By taking these steps, organizations can proactively address compliance requirements, mitigate data privacy risks, and foster trust in the digital economy.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/dpdp-compliance-companies-need-start-on.jpg"
  },
  {
    "title": "CCPA Issues New Guidelines for E-Commerce Sale of Radio Equipment",
    "description": "<p>The Central Consumer Protection Authority (CCPA) has introduced \"Guidelines for the Prevention and Regulation of Illegal Listing and Sale of Radio Equipment including Walkie-Talkies on E-Commerce Platforms, 2025,\" under Section 18 of the Consumer Protection Act, 2019. These guidelines aim to regulate the sale of radio equipment, including walkie-talkies, on e-commerce platforms to ensure compliance with national telecommunications and security standards. They apply to all e-commerce platforms catering to Indian consumers, as well as manufacturers, importers, and sellers of radio equipment, defining key terms like \"Radio Equipment\" and \"Unauthorized Devices.\"</p>\n\n<p>The guidelines mandate that no radio equipment requiring frequency assignment from the Department of Telecommunications (DOT) can be listed or sold unless purchased from an authorized dealer. Platforms are prohibited from listing mobile signal boosters and wireless jammers. Product listings must specify frequency ranges, technical parameters, and regulatory approval proof like Equipment Type Approval (ETA). Platforms must implement automated scanning systems to detect non-compliant listings and provide a user-friendly reporting mechanism for the public.</p>\n\n<p>E-commerce platforms must ensure sellers certify the authenticity of test reports and remove non-compliant listings within 24 hours of receiving directions from the Department of Consumer Affairs (DoCA) or DOT. They are also required to cooperate with regulators for real-time takedowns, enforcement actions, and submit regular audits and compliance reports. Non-compliance can lead to penalties under the Consumer Protection Act, 2019, and other applicable laws, including blacklisting of sellers and platform liability.</p>\n\n<p>The guidelines also emphasize collaboration with regulatory authorities for enforcement actions and public awareness. Platforms must display notices about the risks of purchasing unauthorized devices and educate users on frequency compliance to promote informed consumer behavior. These measures aim to protect consumers, maintain security standards, and ensure adherence to legal and technical standards.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/ccpa-radio-equipment-ecommerce-platform.jpg"
  },
  {
    "title": "FSSAI Advisory: Discontinuation of the Term “100%” on Food Product Labels and Promotional Materials",
    "description": "<p>The Food Safety and Standards Authority of India (FSSAI) issued an advisory on May 28, 2025, addressing the potentially misleading use of the term “100%” on food product labels and promotional materials. The FSSAI has observed an increase in the use of this term, which, although seemingly straightforward, is ambiguous and can convey a false sense of absolute purity or superiority, potentially misleading consumers.</p>\n\n<p>Issued under the authority of the Food Safety and Standards Act, 2006, and referencing the Food Safety and Standards (Advertising and Claims) Regulations, 2018, the advisory highlights that claims must be truthful, unambiguous, and not misleading. Sub-regulation 10(7) of these regulations strictly prohibits any advertisement or claim that undermines other manufacturers or influences consumer perception in a misleading manner.</p>\n\n<p>The advisory directs all Food Business Operators (FBOs) to discontinue the use of the term “100%” on food product labels, packaging, and promotional content, whether used alone or with other descriptors. The FSSAI emphasizes that the term is undefined in the FSS Act, 2006, or its related regulations, and its use can lead to consumer confusion and misinterpretation. This measure is intended to prevent misleading claims, ensure transparency and accuracy in marketing practices, and maintain high standards of food safety and consumer protection within the food industry.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/discontinuation-100-food-product-labels.jpg"
  },
  {
    "title": "Delhi High Court Terminates Arbitrator's Mandate Due to Unexplained Delay",
    "description": "<p>The Delhi High Court has terminated the mandate of a sole arbitrator in the case of *Great Eastern Energy Corporation Limited vs Sopan Projects*, citing an unacceptable delay of over eight years in delivering the arbitral award. This decision underscores the judiciary's dedication to the timely resolution of disputes through arbitration, as mandated by the Arbitration and Conciliation Act, 1996.</p>\n\n<p>The case originated from a 2010 Work Order between Great Eastern Energy Corporation Limited (Petitioner) and Sopan Projects (Respondent) for the construction of an underground MDPE pipeline. Disputes arose when the Respondent allegedly abandoned the project before completion, leading to the invocation of arbitration in October 2015. A sole arbitrator was nominated, and final arguments concluded in March 2020. However, with no award issued after three years, the Petitioner sought termination of the arbitrator's mandate under Section 14 of the Arbitration and Conciliation Act, 1996.</p>\n\n<p>The Petitioner argued that the delay contravened public policy, while the Respondent contended that unpaid fees and periods covered by a Supreme Court order justified the delay. The Respondent also claimed the Petitioner did not attempt to follow up with the arbitrator.</p>\n\n<p>The Delhi High Court, referencing Section 14 of the Arbitration and Conciliation Act, 1996, and previous Supreme Court rulings, emphasized the importance of expeditious arbitration proceedings. The court concluded that the arbitrator's unexplained three-year delay warranted termination of their mandate, reinforcing the necessity for efficient dispute resolution in accordance with the Arbitration and Conciliation Act, 1996.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/delhi-hc-terminate-arbitrators-mandate-delay.jpg"
  },
  {
    "title": "Environmental Impact of Pharmaceutical Waste: A Review of The Recent Guidance Document On Disposal Of Expired/ Unused Drugs Issued By CDSCO",
    "description": "<p>The Director General of Health Services, CDSCO, issued a guidance document on May 26, 2025, providing detailed instructions for the safe and responsible disposal of expired and unused medicines. Prompted by concerns raised by researchers and discussions within the Drugs Consultative Committee (DCC), the document aims to mitigate ecological and public health risks associated with improper pharmaceutical waste management.</p>\n\n<p>The guidance document addresses the severe consequences of improper disposal, including water contamination, potential misuse of expired drugs, and the emergence of adverse drug reactions. Its primary objective is to provide clear instructions for the safe disposal of expired and unused drugs, aligning with the Drugs and Cosmetics Act and Rules while minimizing environmental impact, especially in relation to antimicrobial resistance (AMR).</p>\n\n<p>The document outlines several disposal methods, including landfill in engineered sites, waste immobilization via encapsulation and inertization, and sewer disposal for certain liquid pharmaceuticals. It discourages open burning and recommends medium to high-temperature incineration for specific waste types, with chemical decomposition as an alternative when incineration is not feasible. Existing regulations for imported drugs, retail/wholesale outlets, and manufacturing waste are referenced, aligning with the Bio-Medical Waste (Management and Handling) Rules, 2016.</p>\n\n<p>The guidance document details the procedures for various stakeholders, including retailers, wholesalers, manufacturers, hospitals, and government agencies, emphasizing the return of expired/unused drugs to manufacturers or proper disposal according to the outlined guidelines. It also specifies requirements for maintaining detailed records for regulatory verification and the handling and transportation of expired/unused drugs, including cytotoxic, radioactive, and controlled substances, using yellow non-chlorinated plastic bags or containers.</p>\n\n<p>For the general public, the document suggests establishing \"Drug take back\" sites and provides guidance on medicines that can be flushed down the sink or toilet to prevent accidental ingestion and misuse, aiming to minimize risks to people and pets. Adherence to these guidelines is essential for all stakeholders to protect human health and the environment by significantly reducing the environmental impact and public health risks associated with improper disposal practices.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/environment-impact-pharmaceutical-waste.jpg"
  },
  {
    "title": "IBBI Notifies Fourth Amendment Regulations to Insolvency Resolution Process for Corporate Persons",
    "description": "<p>The Insolvency and Bankruptcy Board of India (IBBI) has announced the Fourth Amendment Regulations to the Insolvency Resolution Process for Corporate Persons, effective May 26, 2025. These amendments aim to enhance the efficiency, transparency, and fairness of the corporate insolvency resolution process, aligning with the goals of the Insolvency and Bankruptcy Code, 2016 (IBC).</p>\n\n<p>Key changes include the insertion of a new sub-regulation allowing the committee of creditors to invite interim finance providers as observers to meetings, fostering better financial management. Furthermore, resolution professionals, with committee approval, can now solicit expressions of interest for resolution plans covering the entire corporate debtor or individual assets, broadening potential solutions.</p>\n\n<p>Additional amendments focus on creditor equity and regulatory clarity. A new provision ensures financial creditors who did not support the resolution plan receive proportional and prioritized payments. Revisions to Regulation 39 enhance compliance by explicitly including non-compliant plans in the review process, reinforcing adherence to the IBC and its regulations.</p>\n\n<p>Overall, the Fourth Amendment Regulations represent a significant effort by the IBBI to refine the insolvency resolution framework. By increasing flexibility, ensuring fair treatment of creditors, and clarifying regulatory language, these amendments aim to benefit all stakeholders, including corporate debtors, creditors, and the overall economy through a more robust and transparent insolvency resolution process.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/ibbi-fourth-amendment-regulations-2025.jpg"
  },
  {
    "title": "Bail is the Rule, Jail is the Exception — State of Rajasthan v. Balchand alias Baliay (1977)",
    "description": "<p>In <b>State of Rajasthan v. Balchand alias Baliay (1977)</b>, the Supreme Court of India, led by Justice <b>V.R. Krishna Iyer</b>, affirmed the principle that <b>bail is the rule and jail is the exception</b>.</p>\n\n<p>The accused, <b>Balchand alias Baliay</b>, was convicted of housebreaking and theft under <b>Sections 457</b> and <b>380</b> of the <b>Indian Penal Code</b>. During his appeal against the conviction, he was granted interim bail, which the <b>State of Rajasthan</b> challenged on the grounds that a conviction extinguishes the presumption of innocence.</p>\n\n<p>The Court considered whether a conviction automatically deprives an accused of the right to bail pending appeal, and how to balance <b>societal security</b> with an individual’s <b>fundamental liberty</b>. The prosecution contended that conviction nullifies the presumption of innocence and mandates bail cancellation, while the defense argued that the appeal process is an extension of the trial and preserves the accused’s right to liberty until final judgment.</p>\n\n<p>Justice Krishna Iyer’s judgment emphasized that the <b>presumption of innocence</b> endures until all appellate remedies are exhausted. He underscored that under <b>Article 21</b> of the Constitution, personal liberty must be deprived only through a process that is just, fair, and reasonable. The Court held that “<b>bail is the rule</b>” and that bail may be denied only in exceptional circumstances such as flight risk, tampering with evidence, or threat to public order. It ruled that bail cannot be revoked automatically upon conviction, but must be assessed on a case-by-case basis, ensuring the justice system protects both liberty and public interest.</p>\n\n<p>This ruling established the foundation of modern <b>bail jurisprudence</b> in India, affirming that even a convicted person retains dignity and the right to judicial review. It has guided subsequent judgments to resist mechanical denials of bail and reinforced that restrictions on liberty must be grounded in substantial reasons.</p>\n\n<p>In simple terms, the decision balances <b>personal freedom</b> and <b>public safety</b>, favoring release unless compelling reasons demand custody. As Justice Krishna Iyer eloquently stated: “<b>Bail is the rule and jail is the exception.</b>”</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/Bail is the Rule, Jail is the Exception.jpg"
  },
  {
    "title": "Commander K.M. Nanavati vs. State of Maharashtra (1959) — A Landmark Case in Indian Legal History",
    "description": "<p>The case of <b>Commander K.M. Nanavati v. State of Maharashtra</b> (1959) remains one of the most significant criminal trials in Indian jurisprudence, fundamentally altering perceptions of jury trials and the defense of provocation.</p>\n\n<p>Commander Kawas Manekshaw Nanavati, a distinguished officer of the Indian Navy, lived in Mumbai with his wife Sylvia and their children. When Sylvia’s extramarital affair with Prem Ahuja, a wealthy businessman, came to light, Nanavati confronted them. In an emotionally charged encounter, he took his service revolver and went to Prem Ahuja’s residence, where he fatally shot him.</p>\n\n<p>Key legal questions arose: whether Nanavati’s act amounted to murder under <b>Section 302 of the Indian Penal Code (IPC)</b>, and whether it could be reduced to culpable homicide not amounting to murder under <b>Exception 1 to Section 300 IPC</b> for grave and sudden provocation.</p>\n\n<p>At the Bombay Sessions Court, a jury trial returned a “Not Guilty” verdict by 8:1. The Sessions Judge, deeming the jury’s decision perverse and influenced by media sympathy, referred the case to the Bombay High Court under <b>Section 307 of the Code of Criminal Procedure</b>. The High Court reversed the jury’s verdict, finding Nanavati guilty of murder—a conviction later upheld by the Supreme Court of India.</p>\n\n<p>The courts examined whether provocation was truly sudden and overwhelming. Finding that Nanavati had time to plan—retrieving his revolver and traveling to Ahuja’s home—the defense of sudden provocation was rejected. The case also exposed media influence on juries, leading to the abolition of jury trials in Indian criminal law during the 1960s.</p>\n\n<p>Nanavati served his sentence but was subsequently pardoned by the Governor of Maharashtra after significant public and political support. His story inspired numerous films, books, and debates, most famously the Bollywood movie <b>Rustom</b>.</p>\n\n<p>The <b>Nanavati case</b> stands as a milestone in Indian criminal law, clarifying the limits of the provocation defense, highlighting the vulnerabilities of jury-based trials, and prompting the end of the jury system in India.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/Commander K.M. Nanavati vs. State of Maharashtra (1959).jpg"
  },
  {
    "title": "Cheque Bounce Recovery in India: Your Legal Options Explained",
    "description": "<p>In India, a <b>cheque bounce</b>, technically known as <b>dishonor of cheque</b>, is a criminal offense punishable under Section 138 of the <b>Negotiable Instruments Act, 1881</b>. This happens when a bank refuses to honor a cheque due to insufficient funds in the drawer's account, or for other reasons like signature mismatch. For an ordinary citizen, receiving a bounced cheque can be a frustrating experience, but it's crucial to understand the legal options available to recover the owed amount.</p>\n\n<p>The process for <b>cheque bounce recovery</b> begins with sending a legal notice to the issuer of the cheque. This notice must be sent within 30 days from the date the bank informs you about the dishonor of the cheque. The notice should demand payment of the cheque amount within 15 days. If the issuer fails to make the payment within this period, you have the right to file a criminal complaint in the court of a Metropolitan Magistrate or a Judicial Magistrate of the First Class, within one month from the date of expiry of the 15-day notice period. This initiates legal proceedings under Section 138 of the <b>Negotiable Instruments Act</b>.</p>\n\n<p>A critical aspect of the <b>Section 138</b> case is establishing that the debt or liability exists. The onus is on the complainant to prove that the cheque was issued in discharge of a legally enforceable debt or other liability. The drawer of the cheque has the opportunity to defend themselves, and the court will consider both sides before delivering a judgment. If the court finds the accused guilty, they can be sentenced to imprisonment for a term which may extend to two years, or with a fine which may extend to twice the amount of the cheque, or with both.</p>\n\n<p>Beyond the criminal proceedings under Section 138, it's also possible to initiate a civil suit for recovery of money. While the criminal case aims to penalize the defaulter, a civil suit aims to recover the outstanding amount along with interest and other costs. Filing a civil suit doesn't preclude initiating criminal proceedings, and both can proceed simultaneously. The legal recourse available to an individual who receives a <b>bounced cheque</b> provides substantial protection, ensuring that financial transactions are honored and that remedies are available when defaults occur.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/Cheque-Bounce-Recovery-in-India-Your-Legal-Options-Explained.jpg"
  },
  {
    "title": "Indian Landlord Rights: Eviction Rules You Need to Know",
    "description": "<p>In India, landlords have specific rights when it comes to evicting a tenant, governed primarily by the respective state's <b>Rent Control Act</b>. These Acts vary across states, but generally, a landlord cannot evict a tenant at will. A valid and legal ground for eviction must exist, such as non-payment of rent, causing nuisance, subletting without permission, or using the property for illegal activities. It's crucial for landlords to understand the specific provisions of the Rent Control Act applicable in their state to ensure any eviction process complies with the law.</p>\n\n<p>The process of eviction typically involves serving a legal notice to the tenant, clearly stating the reason for eviction and giving them a reasonable timeframe to vacate the premises. If the tenant fails to comply, the landlord can then file an eviction suit in the appropriate court. The court will then hear both sides of the argument, examining the evidence presented by both the landlord and the tenant. The burden of proof usually lies with the landlord to demonstrate that a valid ground for eviction exists under the relevant <b>Rent Control Act</b>. Landlords must keep accurate records of rent payments, communication with the tenant, and any violations of the rental agreement to support their case.</p>\n\n<p>It's important to note that even with a valid reason for eviction, a landlord cannot use force or illegal means to evict a tenant. Such actions can result in legal repercussions for the landlord, including penalties and damages. The eviction process must be carried out through the court, obtaining a court order for eviction if necessary. The Supreme Court has repeatedly emphasized the importance of following due process of law in eviction matters. For example, the landmark case of *Raghunath G. Panhale (Dead) By Lrs. v. M/S. Chaganlal Sundarji And Co* highlighted the need for strict adherence to procedural laws in eviction proceedings.</p>\n\n<p>For ordinary citizens who are landlords, understanding these <b>eviction rules</b> is crucial for protecting their property rights while also acting within the bounds of the law. Seeking legal advice from a lawyer specializing in property law is highly recommended before initiating any eviction proceedings. This ensures compliance with the state's specific Rent Control Act and minimizes the risk of legal complications. Moreover, familiarizing oneself with relevant case laws can provide a better understanding of how courts interpret and apply these laws in practice. Remember that a fair and legal eviction process protects both the landlord's rights and the tenant's rights, promoting a more equitable rental relationship.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/Indian-Landlord-Rights-Eviction-Rules-You-Need-to-Know.jpg"
  },
  {
    "title": "Online Fraud Refund: Your Rights Under Indian Law",
    "description": "<p>If you've fallen victim to <b>online fraud</b> in India, knowing your rights concerning a <b>refund</b> is crucial. Indian law provides avenues for recovering lost funds, though the process can sometimes be complex. The primary legislation governing such issues is the <b>Information Technology Act, 2000</b>, which addresses cybercrimes and provides a framework for holding fraudsters accountable. Banks and payment service providers also have a responsibility to ensure secure transactions, and their negligence can lead to liability.</p>\n\n<p>The liability of banks in cases of <b>unauthorized electronic transactions</b> is often governed by the Reserve Bank of India (RBI) guidelines. These guidelines typically differentiate liability based on customer reporting timelines. If the customer reports the fraudulent transaction promptly (usually within 3 days), the liability is often limited or even zero. Delay in reporting can increase the customer's potential liability. Banks are required to have a robust dispute resolution mechanism to handle customer complaints regarding fraudulent transactions and provide a refund, if warranted. It is important to document all communications with the bank and file a formal complaint with evidence of the <b>fraudulent transaction</b>.</p>\n\n<p>Beyond banking regulations, Section 43 of the <b>IT Act</b> deals with compensation for damages caused to computer systems and networks due to unauthorized access or disruption. While it may not directly guarantee a <b>refund</b>, it allows for claiming damages. Furthermore, depending on the nature of the <b>online fraud</b>, the Indian Penal Code (IPC) provisions related to cheating, forgery, and criminal breach of trust can also be invoked. Registering a First Information Report (FIR) with the police is a crucial step in initiating a criminal investigation and strengthens your case for seeking legal remedies.</p>\n\n<p>For ordinary citizens, the practical implication is to be vigilant and proactive. Immediately report any <b>online fraud</b> to your bank and the cybercrime cell. Keep records of all transactions and communication. File a police complaint to initiate formal investigation. Familiarizing yourself with RBI guidelines on limiting liability in fraudulent transactions can greatly help navigate the process of claiming a <b>refund</b>. Remember, acting quickly and diligently is essential to maximizing your chances of recovering your funds.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/Online-Fraud-Refund-Your-Rights-Under-Indian-Law.jpg"
  },
  {
    "title": "Live-in Relationships in India: Know Your Legal Rights",
    "description": "<p>In India, a <b>live-in relationship</b> refers to an arrangement where two individuals choose to cohabit and share their lives together without being legally married. This form of relationship has gained increasing social acceptance, and the Indian legal system has gradually recognized certain rights and protections for couples in such arrangements. However, it's crucial to understand that live-in relationships don't automatically grant the same rights as a marriage. Proof of a relationship resembling marriage, including factors like duration, shared household, pooling of resources, and intent to marry, is often essential for claiming legal entitlements.</p>\n\n<p>Several landmark court judgments have shaped the legal landscape surrounding live-in relationships. The Supreme Court, in cases like D. Patchaiammal v. D. Velusamy, has laid down guidelines for determining the validity and nature of a live-in relationship. To be considered a valid relationship warranting legal protection, the couple must hold themselves out to society as being akin to spouses. Importantly, not all cohabitation qualifies as a live-in relationship entitled to legal rights. The court has emphasized the necessity of a long-standing and genuine relationship similar to marriage. These judicial pronouncements primarily aim to prevent exploitation and protect vulnerable partners within such arrangements.</p>\n\n<p>The legal implications for women in <b>live-in relationships</b> are particularly significant. While not explicitly covered under the Hindu Marriage Act, certain legislations like the Protection of Women from Domestic Violence Act, 2005, provide some recourse. This Act recognizes women in live-in relationships as being in a relationship \"in the nature of marriage,\" thereby entitling them to protection from domestic violence, including physical, emotional, and economic abuse. They can seek remedies such as residence orders, monetary relief, and protection orders under this Act. Further, children born out of live-in relationships are considered legitimate and have inheritance rights in their parents’ property, as established by various court decisions.</p>\n\n<p>It’s important to note that establishing legal rights within a <b>live-in relationship</b> can often be challenging. Unlike a formal marriage certificate, there's no single document that automatically proves the existence of the relationship or its nature. Individuals need to gather evidence, such as joint bank accounts, utility bills with both names, photographs, and testimonies of friends and family, to demonstrate the validity and characteristics of their relationship to the court. Seeking legal advice from a qualified lawyer is highly recommended for individuals in live-in relationships to understand their rights and obligations and to navigate the legal complexities effectively. This is especially crucial in cases involving property disputes, maintenance claims, or inheritance matters.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/Live-in-Relationships-in-India-Know-Your-Legal-Rights.jpg"
  },
  {
    "title": "Supreme Court Imposes Year-Long Firecracker Ban in Delhi-NCR",
    "description": "<p>The Supreme Court has imposed a comprehensive, year-long ban on the use, manufacture, sale, and storage of firecrackers in the Delhi-National Capital Region (NCR). This decision extends beyond the previous 3-4 month restrictions, aiming to address the region's persistent air quality issues.</p><p>The Court emphasized that the prevailing air pollution levels in Delhi-NCR necessitate stringent measures. Consequently, no exceptions will be made, including for 'green crackers,' which are only marginally less polluting than traditional ones. The ban also encompasses online sales of firecrackers.</p><p>In its ruling, the Court underscored the fundamental right to health under Article 21 of the Constitution, highlighting the adverse effects of air pollution on citizens' well-being. The bench stated that no religious practices advocate for activities that harm the environment or public health.</p><p>This landmark judgment reflects the judiciary's commitment to ensuring a cleaner environment and safeguarding public health in the face of escalating pollution concerns in the capital region.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/Supreme%20Court%20Imposes%20Year-Long%20Firecracker%20Ban%20in%20Delhi-NCR.jpg"
  },
  {
    "title": "Supreme Court Affirms State Commissions' Authority Over Inter-State Power Supply Affecting State Grids",
    "description": "<p>The Supreme Court has clarified that State Electricity Regulatory Commissions (SERCs) retain the authority to regulate open access to electricity transmission within their states, even when it involves inter-state power supply, if such transactions impact the state's grid.</p><p>While the Central Electricity Regulatory Commission (CERC) oversees inter-state electricity transmission under Section 79(1)(c) of the Electricity Act, 2003, this does not preclude SERCs from exercising jurisdiction over intra-state aspects of open access. Specifically, Section 42(2) empowers SERCs to ensure fair and non-discriminatory access to transmission and distribution networks within their respective states.</p><p>This ruling underscores the collaborative regulatory framework envisioned by the Electricity Act, 2003, balancing the roles of both central and state commissions in managing the nation's electricity infrastructure.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/Supreme-Court-Affirms-State-Commissions-Authority-Over-Inter-State-Power-Supply-Affecting-State-Grid.jpg"
  },
  {
    "title": "Supreme Court: S-138 NI Act Complainant Not Required to Prove Financial Capacity at Threshold",
    "description": "<p>The Supreme Court has clarified that under Section 138 of the Negotiable Instruments Act, a complainant is not required to prove their financial capacity at the initial stage of the proceedings. This decision emphasizes that the focus should be on the alleged offense rather than the economic standing of the complainant.</p><p>In its ruling, the Court noted that the procedural threshold is meant to ensure that valid complaints are heard without undue burden on the complainant, thereby upholding the principles of accessible justice. This approach reinforces the idea that the legitimacy of the complaint does not hinge on the complainant’s ability to demonstrate financial robustness.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/Supreme-Court-S-138-NI-Act-Complainant-Not-Required-to-Prove-Financial-Capacity-at-Threshold.jpg"
  },
  {
    "title": "Supreme Court Upholds Cancellation of 25,753 West Bengal SSC Appointments",
    "description": "<p>The Supreme Court has upheld the Calcutta High Court's decision to invalidate approximately 25,753 teaching and non-teaching staff appointments made by the West Bengal School Service Commission (SSC) in 2016.</p><p>The Court found that the selection process was marred by widespread fraud and manipulation, rendering it irreparably tainted. Consequently, the services of the affected candidates are to be terminated, and they are required to refund any salaries received.</p><p>This ruling underscores the judiciary's commitment to maintaining integrity and transparency in public recruitment processes.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/Supreme-Court-Upholds-Cancellation-of-25-753-West-Bengal-SSC-Appointments.jpg"
  },
  {
    "title": "Supreme Court Rejects Partition Suit Filed 45 Years After Property Sale",
    "description": "<p>The Supreme Court recently dismissed a partition suit that was initiated a staggering 45 years after the property's sale deed was registered.</p>  <p>The Court emphasized that the registration of a sale deed serves as a public notice, implying that any party with an interest in the property is presumed to be aware of such transactions from the date of registration. This means that the limitation period for filing claims starts from that moment.</p>  <p>In this particular case, the plaintiffs' prolonged inaction—spanning over four decades—was deemed unacceptable. The Court reiterated that, according to the law, any claims or disputes regarding property transactions should be raised within the prescribed limitation period, which, in this context, had long expired.</p>  <p>This ruling serves as a stark reminder of the importance of timely legal action in property disputes and the weight that registered documents carry as public notices.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/Supreme-Court-Rejects-Partition-Suit-Filed-45-Years-After-Property-Sale.jpg"
  }
]