[
  {
    "title": "Food Safety or Competition Issue? CCI Draws the Line in Maggi Sauce Case",
    "description": "<p>The Competition Commission of India (CCI) dismissed a complaint against Nestle India Limited concerning alleged use of contaminated water in the production of Maggi Sauce at its Goa factory. The complaint, filed by Sarvesh M. Kolumbkar, accused Nestle of violating the Food Safety and Standards Act, 2006, and abusing its dominant position under Section 4 of the Competition Act. The informant sought an investigation into a purported \"Maggi Sauce scam\" and requested interim relief.</p>\n\n<p>The CCI found no prima facie contravention of the Competition Act, clarifying that the allegations centered on food safety, hygiene, and product labelling, issues under the jurisdiction of the Food Safety and Standards Authority of India (FSSAI). The Commission emphasized that the alleged use of dirty water and mislabelling did not constitute anti-competitive practices or demonstrate that Nestle exploited its market position to restrict competitors or harm consumers.</p>\n\n<p>The decision reinforces that unethical business practices do not automatically equate to abuse of dominance unless they directly impact market competition. The CCI underscored its role in ensuring market fairness and efficiency, distinct from addressing general consumer grievances or regulatory non-compliance related to food safety. The order clarifies the boundary between competition law and sectoral regulation, directing concerns regarding public health, product contamination, or deceptive labelling to appropriate authorities like the FSSAI.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/cci-clarifies-limits-in-maggi-sauce-dirty-water-case.jpg"
  },
  {
    "title": "Fake Licence Not Enough to Deny Insurance: Supreme Court",
    "description": "<p>The Supreme Court of India, in *Hind Samachar Ltd. (Delhi Unit) v. National Insurance Company Ltd. & Ors.*, has clarified that a vehicle owner cannot be held liable solely based on the subsequent discovery of a fake driver's license. The court emphasized that an insurer must demonstrate a deliberate violation of policy conditions or substantial evidence of collusion to deny indemnification. This decision bolsters the legal framework surrounding \"pay and recover\" cases under the Motor Vehicles Act, reinforcing the principle that an insured owner's good faith is presumed unless proven otherwise.</p>\n\n<p>The case stemmed from a fatal road accident involving a truck owned by Hind Samachar Ltd. and a Matador van. The Motor Accident Claims Tribunal (MACT) initially ruled both vehicles negligent and directed the truck's insurer to indemnify the owner, despite allegations of a fake driver's license. The Delhi High Court reversed this, finding collusion and granting the insurer the right to recover compensation from the owner.</p>\n\n<p>The Supreme Court overturned the High Court's decision, emphasizing that the insurer failed to provide sufficient evidence of collusion or negligence on the owner's part. The court reiterated that the insurer bears the burden of proving the insured knowingly entrusted the vehicle to an unqualified driver or willfully breached policy conditions. The court found that the owner acted with reasonable diligence by verifying the driver's license and producing renewal records from the licensing authority.</p>\n\n<p>The Supreme Court concluded that without proof of willful breach or collusion, the High Court's direction allowing the insurer to recover compensation from the vehicle owner was legally unsound. The ruling reaffirms that vehicle owners are not expected to conduct exhaustive license verification unless there are specific reasons for suspicion. The decision reinforces the welfare intent of the Motor Vehicles Act to ensure victim compensation without unjustly burdening owners acting in good faith.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/fake-licence-no-ground-to-deny-insurance-supreme-court.jpg"
  },
  {
    "title": "Minors’ Rights Protected – Court Rules Suit Not Mandatory to Undo Guardian’s Unauthorized Sale",
    "description": "<p>The Supreme Court of India, in *K.S. Shivappa v. Smt. K. Neelamma*, clarified that a minor's repudiation of an unauthorized property sale by their guardian, without prior court permission under Section 8(2) of the Hindu Minority and Guardianship Act, 1956, does not necessarily require a formal lawsuit. Such a sale is voidable, not void, and repudiation can be effectively demonstrated through clear and unequivocal conduct, such as the subsequent sale of the property after attaining majority.</p>\n\n<p>The case involved a dispute over land originally purchased in the names of three minor sons and later sold by their father/guardian without the required court permission. After attaining majority, the sons sold the land to a different party, thus repudiating the original sale. The Supreme Court examined the legal implications of Section 8(2) and 8(3) of the Hindu Minority and Guardianship Act, 1956 and ultimately ruled in favor of the sons' right to repudiate the sale through their conduct, emphasizing that the Act does not explicitly mandate a civil suit for setting aside such transactions.</p>\n\n<p>The Court underscored that once a voidable transaction is avoided by the minor, it becomes void *ab initio*. The Supreme Court's decision highlights the importance of protecting minors' property rights while promoting fairness and clarity in property law and strengthens both substantive justice and transactional integrity.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/supreme-court-protects-minors-rights-in-property-sales.jpg"
  },
  {
    "title": "Husband Cannot Use Child as a Pawn to Prove Wife’s Adultery – DNA Test Plea Dismissed",
    "description": "<p>The Madurai Bench of the Madras High Court dismissed a husband's petition seeking a DNA test on his child to prove his estranged wife's alleged adultery. The court emphasized the importance of protecting the child's rights, privacy, and dignity, reinforcing constitutional safeguards under Articles 20(3) and 21. The ruling highlights that DNA testing should not be used intrusively in litigation without strong justification.</p>\n\n<p>The case arose from a maintenance petition filed by the wife after a divorce. The husband sought a DNA test, claiming his ex-wife had previously admitted the child was not his. The court ruled against this, citing the lack of a prima facie case, an inordinate delay since the divorce, and the potential harm to the child. The court referenced Section 116 of the Bharatiya Sakshya Adhiniyam, 2023, which presumes a child's legitimacy unless non-access is proven, a legal safeguard.</p>\n\n<p>Justice Shamim Ahmed underscored that forensic methods should not infringe upon fundamental rights or be misused. The court stated that ordering a DNA test in this situation would violate the child's right to privacy and potentially cause lifelong stigma. The court concluded that the husband’s plea lacked merit and appeared to be an attempt to humiliate the wife and prolong the litigation. The judgment reaffirms the judiciary's commitment to the best interests of the child, privacy, and human dignity, preventing the weaponization of technology for emotional harm in family disputes.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/husband-denied-dna-test-to-prove-wifes-alleged-adultery.jpg"
  },
  {
    "title": "Supreme Court Clarifies Limitation and Validity of Arbitration Clauses Post-Amendment",
    "description": "<p>In *Offshore Infrastructures Ltd. v. Bharat Petroleum Corporation Ltd.*, the Supreme Court of India addressed the validity of arbitration clauses impacted by statutory amendments and the computation of limitation for applications seeking arbitrator appointments under Section 11(6) of the Arbitration and Conciliation Act, 1996. The ruling underscores the pro-arbitration stance of Indian courts and provides clarity on interpreting arbitration clauses in light of the 2015 Amendment.</p>\n\n<p>The dispute stemmed from a contract between Offshore Infrastructures and Bharat Petroleum, where Offshore Infrastructures sought arbitration due to outstanding dues. The original arbitration clause designated the Managing Director of Bharat Petroleum as the sole arbitrator, a provision rendered inconsistent with the 2015 Amendment to the Arbitration Act, which aims to ensure arbitrator neutrality. The High Court dismissed Offshore Infrastructures' application for arbitrator appointment as time-barred, calculating the limitation period from the date of the No Claim Certificate.</p>\n\n<p>The Supreme Court overturned the High Court's decision, holding that the ineligibility of a named arbitrator does not invalidate the entire arbitration clause. It affirmed that the parties' intent to arbitrate remains valid and that courts retain the power under Section 11(6) to appoint an independent arbitrator. The Court further clarified the limitation period, considering the Supreme Court’s COVID-19-related extension orders. It ruled that the application was within the prescribed limitation period when accounting for the exclusion of time between March 15, 2020, and February 28, 2022.</p>\n\n<p>The Supreme Court directed the matter to the Delhi International Arbitration Centre (DIAC) for the appointment of an independent arbitrator. This decision reinforces the principles of party autonomy, fairness, and the legislative intent behind the 2015 amendment, ensuring that technicalities do not undermine the fundamental goal of alternative dispute resolution.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/supreme-court-upholds-arbitration-clause-clarifies-limitation.jpg"
  },
  {
    "title": "Judicial Clarity on Environmental Impact Assessments: The Vanshakti Judgment",
    "description": "<p>The Supreme Court, in *Vanshakti v. Union of India*, upheld the Ministry of Environment, Forest and Climate Change’s (MoEF&CC) 2025 notification clarifying the application of general conditions to building and township projects under the 2006 Environmental Impact Assessment (EIA) Notification. The Court found that the 2006 notification never applied these conditions to projects under Entries 8(a) and 8(b), thus the 2025 clarification did not dilute environmental safeguards.</p>\n\n<p>However, the Court struck down Note 1 in Entry 8(a), which exempted industrial sheds, schools, colleges, and hostels from EIA requirements. The Court deemed this exemption arbitrary and contrary to the Environment (Protection) Act, 1986, arguing that large-scale construction, regardless of its purpose, has an environmental impact and cannot be shielded from assessment.</p>\n\n<p>The ruling reinforces the doctrine of sustainable development and provides interpretive clarity on the EIA regime. By upholding the 2025 notification (excluding Note 1), the Court balances effective environmental regulation with legitimate development, recognizing the role of State Environment Impact Assessment Authorities (SEIAAs) while preventing arbitrary exemptions. The judgment is likely to serve as a key precedent for future disputes regarding delegated environmental legislation and the limits of administrative clarification.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/supreme-court-clarifies-eia-rules-in-vanshakti-case.jpg"
  },
  {
    "title": "Artificial Intelligence and Competition Law: CCI’s Analysis of the Market Study on AI and Competition Report",
    "description": "<p>The Competition Commission of India (CCI) acknowledges the transformative influence of Artificial Intelligence (AI) on modern markets, highlighting its impact on pricing, consumer targeting, and digital ecosystems. The CCI's market study recognizes AI's potential to promote efficiency and innovation, but also its capacity to distort markets through opaque and exclusionary practices. The report serves as a foundation for aligning competition law, consumer protection, and data regulation in India's AI economy.</p>\n\n<p>The study identifies AI's growing influence in sectors like banking, e-commerce, and healthcare, leading to cost efficiency and predictive analytics. However, it also notes an imbalance, with a few large players dominating critical layers of the AI infrastructure, creating entry barriers for smaller competitors. This market concentration allows dominant firms to engage in \"ecosystem lock-in,\" challenging the goal of fair competition.</p>\n\n<p>The CCI recognizes that AI's self-learning abilities test traditional enforcement tools. AI can enable tacit collusion without explicit agreements, while dynamic pricing risks consumer harm through personalized pricing. Data-driven network effects also favor incumbents, raising barriers for smaller businesses. The study cautions that mergers and acquisitions in the AI industry require closer scrutiny by competition authorities.</p>\n\n<p>The CCI proposes a shift towards proactive ecosystem monitoring, encouraging AI deploying enterprises to conduct competition compliance audits. The report recommends disclosing key aspects of AI functioning to foster trust and contestability. It also plans to establish a Digital Markets and AI Think Tank and calls for inter-regulatory coordination to harmonize AI, data privacy, and consumer protection regulations. The CCI sets ethical boundaries for algorithmic conduct and emphasizes that AI must serve as a tool for competition, not a substitute. The CCI's report mirrors global trends and adapts them to the Indian digital ecosystem, balancing innovation incentives with legal oversight. It marks a turning point in India's regulatory evolution, emphasizing responsible innovation, algorithmic transparency, and regulatory coordination to ensure fair and competitive AI markets.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/cci-report-examines-ais-impact-on-competition-law.jpg"
  },
  {
    "title": "CCI Dismisses Allegations Against BSNL: Tender Disqualification Not Anti-Competitive",
    "description": "<p>The Competition Commission of India (CCI) addressed a case filed by M/s C.C.L. Optoelectronics Private Ltd. against Bharat Sanchar Nigam Ltd. (BSNL), alleging abuse of dominant position under Section 4 of the Competition Act, 2002. The informant contested BSNL's disqualification of its bid for a tender concerning Splice Closures for Optical Fiber Cables, arguing that the tender conditions were discriminatory and favored certain bidders.</p>\n\n<p>The CCI, upon examination, defined the relevant market as Telecommunication Services in India. It found that BSNL's market share (approximately 2.09%) was significantly smaller than those of its major competitors, such as Reliance Jio, Bharti Airtel and Vodafone Idea. The commission concluded that BSNL did not hold a dominant position. It also noted that the disqualification was based on past performance criteria, not turnover.</p>\n\n<p>Ultimately, the CCI determined that no prima facie case of contravention of Section 4 of the Act was established against BSNL. The Commission closed the matter under Section 26(2) of the Competition Act, 2002, dismissing the application for interim relief and concluding that BSNL's actions did not constitute abuse of dominance or restrictive trade practices.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/cci-clears-bsnl-tender-rejection-not-anti-competitive.jpg"
  },
  {
    "title": "Arbitral Award Must Be Within the Parameters of the Agreement Between the Parties",
    "description": "<p>Arbitration is rooted in party autonomy, where consent forms the basis of the tribunal's jurisdiction, scope, and authority. An arbitral award must adhere to the contract's parameters; deviations, either by disregarding terms or granting inconsistent relief, undermine the agreement's sanctity and the tribunal's jurisdiction, making the award vulnerable under the Arbitration and Conciliation Act, 1996.</p>\n\n<p>The Indian arbitration framework, particularly Section 28(3) of the Act, emphasizes contractual sanctity, mandating tribunals to decide per the contract's terms. Arbitrators interpret, but do not rewrite, contracts based on equity or fairness. The Supreme Court of India has consistently reinforced that tribunals are creations of the contract, unable to exceed their mandate. Awards violating express terms are deemed patently illegal and against public policy.</p>\n\n<p>Evidentiary discipline and procedural adherence are crucial, especially concerning contractual preconditions like notices or written approvals. Tribunals cannot waive these stipulations unless permitted by the contract. The Supreme Court has reinforced that commercial fairness cannot override contractual discipline, as seen in SEPCO Electric Power Construction Corporation vs. GMR Kamalanga Energy Ltd., where the court set aside a tribunal's decision for wrongly invoking equitable estoppel to overlook mandatory contractual notices.</p>\n\n<p>Judicial review under Sections 34 and 37 serves as a safeguard against arbitral excess, intervening when awards exhibit patent illegality or violate public policy, ensuring arbitration remains true to party consent. Contracting parties must draft precisely and adhere to performance requirements. Courts assess whether awards respect the agreement's boundaries, exercising restraint when faithful interpretations exist and correcting departures.</p>\n\n<p>Arbitration's strength lies in predictability and respect for autonomy. Tribunals upholding the agreement's integrity reinforce commercial certainty. Conversely, exceeding mandates undermines the process. Awards must be rooted in the contract, ensuring arbitration remains an extension of party autonomy governed by the rule of contract.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/arbitral-awards-must-adhere-to-contract-terms.jpg"
  },
  {
    "title": "CCI's Google Play Ruling: Key Insights On Competition Law And Digital Platforms",
    "description": "<p>The Competition Commission of India (CCI) dismissed allegations against Google related to the termination of Liberty Infospace Pvt. Ltd.'s developer account on the Google Play Store. The CCI, acting under Section 26(2) of the Competition Act, 2002, found no prima facie case of contravention. The case arose after Google terminated Liberty Infospace's account, citing violations of Developer Program Policies and association with previously banned accounts. Liberty Infospace alleged abuse of dominant position by Google, claiming unilateral termination and lack of due process.</p>\n\n<p>Liberty Infospace sought investigation, penalties, and structural changes to ensure transparent enforcement of Play Store policies. Google argued that the issue was an individual grievance related to policy enforcement, relying on prior CCI decisions that upheld the legitimacy of Play Store enforcement mechanisms. Google asserted that the enforcement was proportionate and consistent with global standards.</p>\n\n<p>The CCI framed issues to determine if Google abused its dominant position by terminating the account, if the termination had an appreciable adverse effect on competition (AAEC), and if interim relief should be granted. Ultimately, the CCI's order reinforces that competition law intervenes in digital platforms only when market-wide harm, exclusionary conduct, or unfair leveraging is evident. The Commission deemed Google's policy enforcement as reasonable, proportionate, and consistent with global standards, emphasizing that compliance with platform policies is necessary.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/cci-clears-google-in-play-store-dominance-case.jpg"
  },
  {
    "title": "Limits on Title Transfer: Supreme Court Clarifies Legal Effect of Agreement to Sell, General Power of Attorney, and Will",
    "description": "<p>In Ramesh Chand v. Suresh Chand, the Supreme Court addressed whether an agreement to sell, a general power of attorney (GPA), or a registered will can independently transfer title to immovable property. The Court reinforced that these instruments, particularly a will under suspicious circumstances, cannot establish title without strict legal proof. This decision solidifies existing jurisprudence against informal property transfers.</p>\n\n<p>The dispute arose between brothers over inherited property. One brother claimed ownership based on an agreement to sell, GPA, affidavit, and registered will, while the other contested the documents' validity. The Supreme Court, referencing prior rulings like Suraj Lamp, reiterated that under Section 54 of the Transfer of Property Act, an agreement to sell only grants a right to enforce specific performance, not ownership. A GPA is an agency instrument, not a conveyance, and requires explicit transfer language to pass title.</p>\n\n<p>The Court emphasized that a registered will is not self-proving and requires rigorous proof under the Indian Succession Act and Evidence Act. This includes attestation by two witnesses, with at least one testifying. In this case, the will, favoring one son without explanation and lacking examined attesting witnesses, was deemed unproven. The Supreme Court affirmed that while this ruling introduces no new doctrine, it underscores the need for proper conveyancing and heightened legal awareness in familial property matters where informal documents are often used to effect property transfers.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/supreme-court-clarifies-limits-on-property-title-transfer.jpg"
  },
  {
    "title": "Devolution of Self-Acquired Property under Pre-1956 Mitakshara Law: Exclusive Succession of Male Issue Affirmed",
    "description": "<p>The High Court of Kerala addressed the devolution of a Hindu male's self-acquired property under the Mitakshara School of Hindu Law before the Hindu Succession Act, 1956. The ruling affirms the principle that male issue exclusively succeeded to the separate property of the father if the death occurred prior to the Act's commencement, prioritizing the male line in succession and excluding daughters when a son was present.</p>\n\n<p>The case originated from a dismissed partition suit where the appellants, legal heirs of Rama Pai's daughter, contested a 1965 sale of Rama Pai's self-acquired property by his son, Hari Pai. The appellants argued that the property should have devolved jointly upon Hari Pai and Rama Pai's daughter. The respondents countered that Rama Pai died before 1956, making his son the sole heir. The court upheld the trial court’s finding that Rama Pai had died before 17.06.1956 based on the unchallenged oral testimony of a witness stating the death occurred in 1950.</p>\n\n<p>The court rejected the appellant's reliance on the Hindu Law of Inheritance (Amendment) Act, 1929, noting that it only introduced a limited set of female heirs and did not confer on a daughter the same status as a son when a son was present. Under the Mitakshara law applicable before 1956, the self-acquired property of a male devolved exclusively upon his male issue. This principle was supported by authoritative precedents.</p>\n\n<p>The Court concluded that since Rama Pai died before 1956, his self-acquired property devolved entirely upon his son, Hari Pai, who validly conveyed his rights to the defendants. Consequently, the court dismissed the appeal, upholding the judgment that the property was not partible. The decision restates the legal position concerning inheritance rights under the Mitakshara law before the Hindu Succession Act, 1956.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/kerala-hc-on-pre-1956-mitakshara-law-sons-sole-rights.jpg"
  },
  {
    "title": "Bombay High Court Upholds Mother’s Right To Custody After Father’s Death",
    "description": "<p>The Bombay High Court, Aurangabad Bench, in Parvati Swati v. Vyankat & Anr., reaffirmed a mother's right to custody following the father's death, emphasizing the paramount importance of the child's welfare under the Hindu Minority and Guardianship Act, 1956. The ruling underscores that while grandparents can provide love, the mother, as the natural guardian, holds the inherent right and responsibility unless proven unfit.</p>\n\n<p>The case arose after the father's death, where the paternal grandparents sought guardianship of the minor child, whose custody had been granted to the father in a prior divorce decree. The mother filed a counter-application seeking custody, which was initially rejected. The High Court addressed whether the grandparents could claim custody in preference to the mother, citing Section 6(a) of the Act, which favors the mother as the natural guardian after the father's death, especially for children below five.</p>\n\n<p>The Court considered arguments from both sides, including the mother's improved financial stability and the child's established relationship with the grandparents. Justice Chapalgaonkar, reiterating the child's welfare as paramount, ruled in favor of the mother, citing precedents that a natural parent's custody should only be denied if they are demonstrably unfit. The Court granted custody to the mother while providing visitation rights to the grandparents, balancing the child's legal right to maternal care with the importance of maintaining family bonds. This judgment reaffirms the principle that a mother's care is irreplaceable while emphasizing the need for compassion and justice in guardianship law.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/bombay-hc-upholds-mothers-right-to-child-custody.jpg"
  },
  {
    "title": "RBI's Draft Directions on Lending to Related Parties: A Summary",
    "description": "<p>The Reserve Bank of India (RBI) has released the Draft Reserve Bank of India (Lending to Related Parties) Directions, 2025, seeking public input by October 31, 2025. This draft aims to establish a unified, principle-based framework for transactions between regulated entities (REs) and their related parties, an area of long-standing concern regarding governance and prudential oversight.</p>\n\n<p>Currently, regulations on lending to related parties are fragmented across various regulatory frameworks, leading to potential arbitrage and ambiguity. The new draft directions intend to harmonize governance standards, enhance transparency in related-party exposures, and strengthen market discipline across all REs, including banks, NBFCs, and cooperative banks.</p>\n\n<p>Key provisions include a broad definition of \"related parties\" aligned with Indian Accounting Standards (Ind AS 24), materiality-based thresholds for Board or committee approval of transactions, and a principle-based exemption to Section 20(1)(b) of the Banking Regulation Act, 1949. The draft also mandates comprehensive reporting and disclosure obligations to align with international best practices.</p>\n\n<p>The proposed framework emphasizes ethical governance and conflict of interest management, requiring financial institutions to embed robust governance and risk management practices. Non-compliance may lead to regulatory action and reputational consequences. This initiative, part of broader reforms promoting uniformity and sound corporate governance, follows the Final Co-Lending Framework. The RBI invites stakeholder feedback before finalizing the directions, which will supersede existing circulars.</p>\n\n<p>Ultimately, the Draft Lending to Related Parties Directions, 2025, represent a crucial step toward promoting integrity, transparency, and uniform governance in India's financial system, balancing operational flexibility with prudential discipline to enhance resilience and credibility.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/rbis-draft-lending-rules-redefine-governance-standards.jpg"
  },
  {
    "title": "Allahabad High Court Clarifies Bank Liability in Cases of Alleged Unauthorized Electronic Transactions",
    "description": "<p>The Allahabad High Court, in Suresh Chandra Singh Negi and Another v. Bank of Baroda and Others, addressed the liability of banks in cases of alleged unauthorized electronic transactions, specifically when the customer's credentials and devices were used. The court examined the Reserve Bank of India’s 2017 Circular on customer protection and clarified the extent of customer and bank liability in digital banking operations.</p>\n\n<p>The case involved petitioners claiming unauthorized transfers from their accounts despite using internet banking facilities. They argued cyber fraud, citing a blocked SIM card preventing OTP receipt, and relied on the RBI circular mandating banks to restore debited amounts if notified within three days. The Bank of Baroda, however, presented evidence showing the transactions were initiated by the petitioners themselves using their login credentials, registered devices, and OTPs, with a password change following the transfers.</p>\n\n<p>The Allahabad High Court found that the evidence indicated the transactions were carried out by the petitioners, noting the use of their login, OTPs, and the addition of beneficiaries. The court also highlighted the delay in reporting the issue as inconsistent with genuine cyber fraud victims. Analysis of the RBI circular revealed that while the bank bears the burden of proof, the Bank of Baroda successfully demonstrated customer liability. The court also distinguished precedents cited by the petitioners, noting that those cases involved third-party fraud and prompt reporting, unlike the present case.</p>\n\n<p>Ultimately, the court ruled there was no unauthorized withdrawal and dismissed the petition, emphasizing that the RBI circular protects genuine cyber fraud victims, not those attempting to escape consequences of their own negligence. The decision reinforces that digital vigilance is a shared responsibility, and liability cannot be shifted to the bank when transactions are executed using the customer’s own credentials.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/allahabad-hc-clarifies-bank-liability-in-online-frauds.jpg"
  },
  {
    "title": "Driving E-Mobility Forward: India’s Big Move to Localize EV Component Manufacturing",
    "description": "<p>The Ministry of Heavy Industries in India has amended the Phased Manufacturing Programme (PMP) under the PM E-DRIVE Scheme, targeting e-buses and N2 category e-trucks. Published on September 30, 2025, in The Gazette of India, these modifications aim to bolster domestic manufacturing of critical electric vehicle components, specifically the Traction Motor. The amendments introduce aggressive timelines, beginning September 1, 2025, and continuing into 2026, to ensure local production of these vital EV components.</p>\n\n<p>The changes for e-buses primarily focus on upgrading the requirements for the Traction Motor. New mandates are also detailed for N2 category e-trucks, covering both stand-alone Traction Motors and integrated systems.</p>\n\n<p>These amendments reflect a strong push towards deep localization, requiring manufacturers to establish robust domestic supply chains for advanced EV components. By setting mandatory deadlines for local manufacturing of the Traction Motor and its integrated systems, the Ministry of Heavy Industries reinforces its commitment to the ‘Make in India’ initiative within the electric mobility sector.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/india-pushes-local-ev-component-manufacturing-ahead.jpg"
  },
  {
    "title": "Consumer Commission Fines Builder for Deficiency in Service, Directs Flat Possession",
    "description": "<p>The Delhi State Consumer Disputes Redressal Commission ruled in favor of homebuyers, holding E-Homes Infrastructure Pvt. Ltd. guilty of deficiency in service for demanding additional, unjustified payments for Service Tax and GST and wrongfully canceling a flat allotment of Mr. Rajeev Menon and others. The Commission directed the builder to hand over possession of the flat within two months and provide compensation for mental agony and litigation expenses.</p>\n\n<p>The case originated when the complainants, having paid 95% of the total sale consideration for a flat in “The Jewel of Noida,” received a demand for an additional ₹15,25,120 towards Service Tax and GST, which was not indicated in the original agreement. When they objected, the builder canceled the allotment. The Commission examined whether the complainants were consumers and whether the builder's actions constituted a deficiency in service.</p>\n\n<p>The Commission determined that the complainants were indeed consumers, as the builder failed to prove any commercial intent behind their purchase. It also found the builder's demand for additional taxes to be without legal or contractual basis, constituting a deficiency in service and an unfair trade practice. The order reaffirms that builders cannot impose arbitrary financial demands retroactively, especially when not stipulated in the initial agreement and that contractual terms must be upheld in fairness to the buyer.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/delhi-consumer-commission-orders-flat-possession-fines-builder.jpg"
  },
  {
    "title": "Understanding TRAI’s UCC Rules: Compliance Insights For Corporates",
    "description": "<p>The National Commodity Clearing Limited (NCCL) has issued a circular directing members to comply with the amended Telecom Commercial Communications Customer Preference Regulations (TCCCPR), 2018, issued by the Telecom Regulatory Authority of India (TRAI). This underscores the importance of protecting consumers from Unsolicited Commercial Communications (UCC) and the responsibilities of corporations in managing mass communications.</p>\n\n<p>The TCCCPR, grounded in the Telecom Regulatory Authority of India Act, 1997, aims to regulate commercial communications and empower consumers to control the messages they receive. Recent amendments prohibit the use of standard 10-digit mobile numbers for commercial communications, mandating the use of designated 1600-series numbers for transactional and service-related messages to enhance traceability and oversight.</p>\n\n<p>NCCL's circular emphasizes the need for corporates to whitelist URLs, mobile applications, and digital assets used in communications, as well as ensuring that SIP/PRI connections comply with TCCCPR standards. Cooperation with the Indian Cybercrime Coordination Centre (I4C) and TRAI is also crucial, requiring companies to report and respond to advisories, integrating cybersecurity, consumer protection, and regulatory compliance.</p>\n\n<p>Non-compliance can lead to monetary penalties, blocked communication channels, and restrictions on services, as well as potential liabilities under the Information Technology Act, 2000, related to unauthorized access and cyber fraud. Reputational risks and loss of customer trust are also significant concerns. Therefore, corporate legal and compliance teams must integrate TCCCPR compliance into standard operating procedures, including regular audits, whitelisting tools, adherence to 1600-series numbers, and comprehensive staff training.</p>\n\n<p>The NCCL circular indicates a broader regulatory trend in India towards stricter consumer protection and digital security in corporate communications. By proactively aligning systems with TRAI's amendments, businesses can mitigate legal and operational risks, while strengthening consumer trust. Compliance must be a core component of operational strategy to protect consumers, uphold corporate integrity, and avoid regulatory and reputational fallout.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/trai-tightens-ucc-rules-compliance-mandate-for-corporates.jpg"
  },
  {
    "title": "Unravelling the Conflict: Insolvency Proceedings and Dishonoured Cheques",
    "description": "<p>This case summary details a criminal writ petition filed by Ortho Relief Hospital and Research Centre against M/s. Anand Distilleries and its Directors, following the dishonoring of a cheque issued as security for a loan. The hospital had extended a loan to the company, receiving a post-dated cheque as security. After periodic interest payments ceased, the hospital learned of insolvency proceedings initiated against M/s. Anand Distilleries under the Insolvency and Bankruptcy Code, 2016 (IB Code).</p>\n\n<p>Despite the insolvency proceedings, the respondents requested that the cheque be presented, which was subsequently dishonored due to insufficient funds. A legal notice was issued, followed by a complaint under Section 138 of the Negotiable Instruments Act, 1881 (NI Act), and Sections 406 and 420 of the Indian Penal Code. The trial court discharged the respondents from the Section 138 NI Act offense, citing the ongoing insolvency proceedings, leading to the hospital challenging this discharge order in the Bombay High Court.</p>\n\n<p>The central issue before the High Court was whether the initiation of insolvency proceedings under the IB Code prior to the filing of a complaint under Section 138 of the NI Act nullifies the latter proceedings. The Bombay High Court, referencing relevant Supreme Court judgments, ruled that the trial court had erred in discharging the respondents. The court emphasized that the moratorium for corporate debtors under the IB Code does not extend to the personal criminal liability of directors and individuals under the NI Act. Consequently, the High Court allowed the Criminal Writ Petition, quashing the trial court's orders and reinstating the complaint, reinforcing the principle that personal penal liability persists despite corporate insolvency proceedings.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/insolvency-vs-cheque-bounce-bombay-hc-clarifies-liability.jpg"
  },
  {
    "title": "Foreign Currency Settlement System Framework Notified by IFSCA for GIFT IFSC",
    "description": "<p>On October 3, 2025, the International Financial Services Centres Authority (IFSCA) formalized the rules, bye-laws, and regulations for the Foreign Currency Settlement System (FCSS) in Gujarat International Finance Tec-City (GIFT IFSC). This notification provides a clear legal and operational framework for settling foreign currency transactions within the IFSC. This enhancement provides regulatory clarity, risk management, and operational efficiency for market participants.</p>\n\n<p>The FCSS is established under the Payment and Settlement Systems Act, 2007, with IFSCA authorizing CCIL IFSC Limited (CIL) to operate the payment system. IFSCA also notified CIL's bye-laws, rules, and regulations, making them legally binding. The framework aligns with the International Financial Services Centres Authority Act, 2019, empowering IFSCA to regulate payment systems within IFSCs. The International Financial Services Centres Authority (Payment and Settlement Systems) Regulations, 2024, provide specific operational guidance, solidifying the FCSS as a regulated settlement system in GIFT IFSC.</p>\n\n<p>The formalization of FCSS strengthens GIFT IFSC's infrastructure, enhancing its attractiveness to international financial institutions. By providing a domestic, regulated foreign currency settlement platform, the FCSS reduces dependence on offshore systems, enhancing operational efficiency and cost-effectiveness. This will provide international banks, corporates, and financial institutions operating in GIFT IFSC with regulatory certainty, improved risk mitigation, and compliance clarity.</p>\n\n<p>In conclusion, the IFSCA's notification codifies the legal and operational framework for foreign currency settlements in GIFT IFSC, laying a foundation for secure, efficient, and compliant cross-border transactions. This further enhances GIFT IFSC’s position as a globally competitive financial hub.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/ifsca-notifies-foreign-currency-settlement-rules.jpg"
  },
  {
    "title": "Gujarat Urja Vikas Nigam Wins In Supreme Court; Essar Power Liable To Reimburse Fixed Electricity Charges",
    "description": "<p>The Supreme Court ruled in favor of Gujarat Urja Vikas Nigam Limited (GUVNL) in its dispute with Essar Power Limited (EPL) regarding the diversion of electricity to Essar Steel Limited (ESL) under a Power Purchase Agreement (PPA). The case, stemming from a 1996 agreement for EPL to supply electricity to both GUVNL and ESL, centered on EPL's alleged breach of proportionate allocation by supplying more power to ESL than agreed, leading to claims of wrongful diversion.</p>\n\n<p>The dispute moved through multiple adjudicative bodies, including the Gujarat Electricity Regulatory Commission (GERC) and the Appellate Tribunal for Electricity (APTEL). Previous rulings had addressed issues such as capacity declaration, compensation for diversion, and the appropriate methodology for computing the diverted electricity. The Supreme Court's intervention became necessary to settle the matter.</p>\n\n<p>The Supreme Court emphasized the importance of adhering to its 2016 decision, which established the proportionate allocation obligation and capacity declaration requirement under the PPA. A key aspect of the judgment was the entitlement of GUVNL to reimbursement of fixed charges for electricity diverted to ESL, distinct from compensation for diversion. The court also upheld the GERC's methodology for computing electricity diversion, using hourly periods until February 23, 2005, and half-hourly periods thereafter, acknowledging a subsequent consensual change implemented by both parties. Additionally, the court affirmed the method of calculating compensation for wrongful diversion, which is based on the HTP-1 Tariff Energy Charge rate reduced by variable costs. The Supreme Court upheld APTEL's decision to remand specific issues, such as discrepancies in Deemed Generation Incentive amounts, to GERC for further factual examination and determination. The ruling directed GUVNL to receive reimbursement of fixed charges and compensation for wrongful diversion, following the specified computation methodologies, and instructed each party to bear its own costs.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/supreme-court-rules-in-favour-of-gujarat-urja-vikas-nigam.jpg"
  },
  {
    "title": "Project Financing in India: A Comprehensive Overview",
    "description": "<p>Project financing is a critical mechanism for funding large-scale infrastructure and industrial projects in India, relying on projected cash flows rather than sponsor balance sheets. It has become increasingly important for India's economic growth as the country develops essential infrastructure. The project financing ecosystem in India consists of equity, debt, and government support mechanisms and is underpinned by both public and private sector investment, as well as growing institutional support.</p>\n\n<p>Project finance is widely used across multiple infrastructure sectors in India. However, despite its growth, this ecosystem faces several persistent and emerging challenges, including those related to the legal and regulatory framework.</p>\n\n<p>Recent trends emphasize the need to strengthen project preparation, enhance risk-sharing mechanisms, deepen bond markets, promote dispute resolution reforms, and leverage innovative financing tools like InvITs, ESG bonds, and blended finance. As India aims for a $5 trillion economy, robust project finance mechanisms will be vital for mobilizing the necessary capital for sustainable infrastructure development.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/project-financing-in-india-key-insights-and-trends.jpg"
  },
  {
    "title": "Music Legend Asha Bhosle Sues AI Firm and E-Commerce Sites Over Voice and Image Misuse",
    "description": "<p>The Bombay High Court has granted ad-interim protection to playback singer Asha Bhosle, recognizing her personality rights against unauthorized use of her voice, image, and likeness by AI platforms and online marketplaces. This ruling sets a precedent in India's jurisprudence on deepfakes, AI exploitation, and publicity rights by acknowledging the legal protection of a celebrity's persona, extending to voice cloning, AI-generated content, and digital merchandise.</p>\n\n<p>The case arose from the misappropriation of Asha Bhosle's voice, name, image, and likeness without her consent. AI platforms were developing tools to clone her voice, allowing users to generate songs in her style, which were then circulated on platforms like YouTube. Additionally, online marketplaces like Amazon and Flipkart were selling unauthorized merchandise featuring her image. Bhosle argued these actions violated her personality rights and moral rights under Section 38-B of the Copyright Act, 1957.</p>\n\n<p>The Bombay High Court concluded that Bhosle had established a strong prima facie case, emphasizing the unauthorized technological exploitation of her identity and reputation. The court issued ad-interim injunctions, restraining the defendants from misusing her personality attributes.</p>\n\n<p>This judgment significantly shapes India's response to AI, deepfakes, and personality rights. It affirms that a celebrity's voice, name, and likeness are protectable attributes, and AI voice cloning without consent constitutes infringement. The ruling also places a duty on intermediaries like Amazon, Flipkart, and YouTube to remove infringing content and share violator details, strengthening accountability in the digital ecosystem. While this judgment provides immediate relief, it also exposes the regulatory vacuum in India regarding AI-generated content and digital impersonation, highlighting the need for comprehensive legislation on digital identity and AI misuse.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/asha-bhosle-wins-case-against-ai-voice-and-image-misuse.jpg"
  },
  {
    "title": "Samsung Liable for Faulty Handset and Unfair Trade Practice: Delhi Consumer Commission Ruling",
    "description": "<p>The District Consumer Disputes Redressal Commission-I, Delhi, has held Samsung India Electronics and its authorized service center jointly liable for deficiency in service and unfair trade practice. The ruling stems from a case where a consumer's Samsung A35 smartphone developed defects shortly after purchase, and Samsung refused replacement or refund, despite its own \"Dead on Arrival\" (DOA) policy.</p>\n\n<p>The complainant, Mr. Doneshwar Arya, purchased the phone for ₹30,999, and a defect appeared on the display within three days. The company denied relief based on a missing IMEI sticker, although the IMEI was verifiable. The Commission, referencing the Consumer Protection Act, 2019, particularly Section 2(47) and Section 2(11), found Samsung guilty of unfair trade practices and deficiency in service for failing to honor its DOA policy and creating arbitrary procedural requirements.</p>\n\n<p>As a result, the Commission directed Samsung to refund the cost of the handset (₹30,999), pay ₹10,000 as compensation for mental agony and harassment, and cover ₹5,000 in litigation costs. The judgment reinforces consumer rights, emphasizing that companies must respect warranty commitments and provide fair and prompt redressal mechanisms. It sets a precedent that companies cannot evade liability through arbitrary hurdles and must act in good faith.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/samsung-held-liable-for-faulty-phone-and-unfair-trade.jpg"
  },
  {
    "title": "Fraudulent Portal Masquerading as IRDAI Targets Indian Policyholders",
    "description": "<p>The Insurance Regulatory and Development Authority of India (IRDAI) has issued a public notice alerting policyholders to a fraudulent website mimicking its consumer education portal. This fake site is designed to steal money and data by misleading users into believing it is the official IRDAI resource.</p>\n\n<p>The deceptive website, using the address `https://policyholdergov.org`, closely resembles the legitimate IRDAI portal, `https://policyholder.gov.in`, employing copied logos and seals to appear credible. Victims are urged to pay renewal premiums and are sometimes promised faster claim settlements in exchange for fees, which are fraudulent requests. IRDAI has clearly stated that it never collects premiums, charges for claim settlements, or offers payment gateways.</p>\n\n<p>IRDAI has reported the fraudulent site to cyber-crime authorities and CERT-In, but the site continues to reappear with new sub-links. Policyholders are advised to only use the official websites (`https://policyholder.gov.in` and `https://irdai.gov.in`) and to treat any other variations, WhatsApp links, or SMS short-codes with suspicion. A three-step safety checklist includes carefully verifying the URL, ensuring the presence of the padlock symbol and \"gov.in\" suffix, and avoiding entering sensitive data on sites accessed through search ads or unsolicited calls.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/fake-irdai-portal-dupes-policyholders-across-india.jpg"
  },
  {
    "title": "The Minor Husband Maintenance Ruling: Allahabad High Court's Judgement Summary",
    "description": "<p>This case summary details a recent ruling by the Allahabad High Court regarding maintenance claims under Section 125 of the Criminal Procedure Code (Cr.P.C.). The central issue concerned a wife and minor daughter seeking maintenance from a husband who was a minor at the time of the application but attained majority during the proceedings.</p>\n\n<p>The Family Court initially granted the maintenance, but the husband challenged the order, citing his minority at the time of filing. The High Court, however, clarified that while maintenance liability could not arise before the husband's majority, it became applicable upon attaining majority. The court considered evidence of cruelty and neglect by the husband, justifying the wife's refusal to cohabit. Assessing the husband's income based on his labor capacity within a joint Hindu family, the court deemed the initial maintenance amount excessive, referencing Supreme Court precedents such as Rajnesh vs. Neha.</p>\n\n<p>Ultimately, the High Court partly allowed the revision, reducing the maintenance amount to Rs. 2,500 for the wife and Rs. 2,000 for the daughter, effective from the date the husband attained majority, aligning the allowance with approximately 25% of the assessed income. This judgment underscores that maintenance claims can be sustained despite the husband's initial minority, emphasizing substantive justice, responsibility, and the protection of vulnerable spouses and children. It clarifies that minority does not permanently exempt individuals from future liability when cruelty and neglect are established.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/the-minor-husband-maintenance-ruling.jpg"
  },
  {
    "title": "FCRA Alert: Renew Early or Risk Losing Foreign Funding",
    "description": "<p>The Ministry of Home Affairs has issued a notice urging all associations registered under the Foreign Contribution (Regulation) Act (FCRA) to submit renewal applications well in advance of their expiration dates. This advisory addresses growing concerns about delayed submissions that disrupt the flow of foreign contributions to registered entities.</p>\n\n<p>According to FCRA regulations, renewal applications must be submitted electronically using Form FC-3C within six months before the registration certificate's expiry. However, many associations are submitting applications with insufficient time for scrutiny and security clearance, often less than 90 days before expiry.</p>\n\n<p>The consequences of delayed renewal are significant: an association's certificate expires before the renewal is approved, it will be barred from receiving or utilizing foreign funds. To mitigate these risks, the Ministry strongly advises associations to submit renewal applications at least four months before the expiry date, allowing adequate time for administrative review and security clearance. Failure to comply could result in a lapse of registration and a halt to foreign funding.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/fcra-renewal-alert-submit-early-to-avoid-funding-disruption.jpg"
  },
  {
    "title": "Kerala High Court Restores Fair Play in Co-operative Elections: No ‘Implied’ Disqualifications Allowed",
    "description": "<p>The Kerala High Court recently ruled in R. Suresh Babu v. State Co-operative Election Commission that election officials cannot impose disqualifications beyond those explicitly stated in the Kerala Co-operative Societies Act, 1969 and the Kerala Co-operative Societies Rules, 1969. The case involved the rejection of a nomination for the Neyyattinkara Circle Co-operative Union election based on the rationale that a proposer could not also be a candidate in the same constituency.</p>\n\n<p>Justice K. Babu overturned the Returning Officer's decision, emphasizing that Rule 129(4) contains no such prohibition and that the right to contest is a statutory right restrictable only by express statutory provisions. The court distinguished between permissible judicial intervention to correct manifest illegality and impermissible disruption of the election process. Referencing Supreme Court precedents like Election Commission v. Ashok Kumar, the court affirmed that intervention is justified when a nomination rejection is patently illegal and requires no detailed evidence.</p>\n\n<p>The ruling reinforces electoral fairness within co-operative institutions by preventing unwarranted assumptions of power by election officials and ensuring that individuals are not denied their statutory right to contest elections based on extraneous grounds. The Kerala High Court underscored that while courts generally avoid mid-election interference, they can intervene when violations are obvious and unfair, thus balancing respect for the electoral process with the need to correct clear wrongdoing and protect democratic rights.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/kerala-hc-upholds-fairness-in-co-operative-elections.jpg"
  },
  {
    "title": "Bombay High Court Flags “Usual Way to Siphon Off Public Land”: Strong Remarks on 33-Acre Slum Allotment in South Mumbai",
    "description": "<p>The Bombay High Court has raised serious concerns regarding the proposed redevelopment of a 33-acre government-owned land parcel in Cuffe Parade, Mumbai, intended for the rehabilitation of approximately 65,000 slum dwellers. The court's scrutiny stems from allegations that the project, facilitated through the Slum Rehabilitation Authority (SRA), effectively transfers public land for private benefit under the guise of welfare.</p>\n\n<p>The Division Bench emphasized the scarcity of public land in Mumbai and the State's fiduciary duty to preserve it as a community resource, citing the doctrine of public trust. The court cautioned against welfare schemes being exploited for private enrichment, labeling the practice a \"usual modus operandi to siphon off valuable public lands.\"</p>\n\n<p>The judgment carries significant implications for governance, urban policy, and constitutional accountability, reinforcing that the State functions as a trustee of public land and must ensure that any transfer demonstrably serves public interest. The court underscored the necessity of obtaining high-level sanction, maintaining transparency, and ensuring public consultation before implementing such large-scale redevelopment schemes. The absence of transparency or due process, the Court cautioned, makes such projects vulnerable to judicial invalidation. The decision calls for a balanced approach between welfare and public interest.</p>\n\n<p>In conclusion, the Bombay High Court's remarks serve as a reminder that public assets cannot be disposed of without clear justification, transparency, and constitutional compliance, reinforcing the need for procedural integrity, executive accountability, and transparent governance.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/bombay-hc-flags-misuse-of-public-land-in-33-acre-sra-case.jpg"
  },
  {
    "title": "Maharashtra Shops Act Update: Clarification on 24x7 Continuous Operations",
    "description": "<p>The Maharashtra government, through a notification dated October 1, 2025, has provided clarity regarding continuous operations for shops and commercial establishments. This notification clarifies the existing provision in the Maharashtra Shops and Establishments (Regulation of Employment and Conditions of Service) Act, 2017, Section 16(1)(b), that allows businesses to operate seven days a week, provided each employee receives a continuous 24-hour weekly rest period. Establishments serving alcohol are excluded.</p>\n\n<p>Previously, while technically permitted, businesses hesitated due to ambiguity and concerns regarding compliance checks. The notification explicitly allows continuous operations under the condition of mandatory weekly rest, balancing commercial interests with employee protection. This clarity removes legal uncertainty, enabling businesses to confidently plan seven-day operations while adhering to labor laws, minimum wage regulations, and occupational safety standards.</p>\n\n<p>This progressive step by the Maharashtra government modernizes business operations while safeguarding worker rights. It confirms the permissibility of continuous operations with statutory safeguards, aligning the state with global business practices and reinforcing the importance of employee welfare. This landmark development creates a flexible, responsible commercial ecosystem, empowering businesses to extend hours, improve service, and strategically plan operations, provided they remain vigilant about compliance.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/maharashtra-shops-act-update-24x7-operations-allowed.jpg"
  },
  {
    "title": "Joint Names, Joint Pain: Delhi High Court’s 2025 Verdict on Maintenance, Joint Assets and Denial of Divorce",
    "description": "<p>In September 2025, the Delhi High Court concluded a protracted matrimonial dispute originating from a 2006 divorce petition filed in Mumbai. The central issues revolved around the wife's entitlement to half of a ₹1.09 crore surplus from an auctioned flat, the appropriateness of ₹2 lakh monthly interim maintenance, and the husband's plea for divorce based on cruelty and desertion. The court's 35-page judgment upheld established family law principles and underscored the continued relevance of fault in Hindu matrimonial law.</p>\n\n<p>The couple married in 1999 and lived in Mumbai due to the husband's job. After the husband left in 2006, the wife moved to Delhi. The husband filed for divorce, which was transferred to Delhi, triggering parallel litigation over maintenance and property rights. A flat purchased jointly during the marriage was auctioned due to default, resulting in the surplus now in dispute. The wife claimed entitlement to half the surplus and contested the interim maintenance amount, while the husband sought to overturn both.</p>\n\n<p>The High Court addressed four appeals collectively. The husband alleged cruelty and desertion based on various incidents, while the wife countered with claims of the husband's relationship with a colleague. The court considered several legal precedents regarding maintenance, cruelty, desertion, and the bar created by Section 23(1)(a) of the Hindu Marriage Act (HMA). It also invoked the Prohibition of Benami Property Transactions Act.</p>\n\n<p>The court affirmed the ₹2 lakh monthly maintenance, citing the wife's lack of independent income and the husband's financial capacity. It ruled that the wife was entitled to 50% of the flat's surplus, emphasizing that jointly-owned property is presumed to be held equally unless proven otherwise, and that the Benami Act prevents the husband from claiming sole ownership based on EMI payments. On the divorce petition, the court concurred with the Family Court that the husband did not demonstrate adequate cause for divorce, and the husband's own misconduct barred him from obtaining a decree. The court directed the release of ₹54.5 lakh to the wife, maintained the maintenance amount, and dismissed the divorce appeal, highlighting the importance of fault and clean hands in Indian matrimonial law and reminding litigants that conduct during and after filing for divorce is relevant.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/delhi-hc-2025-divorce-denied-50-joint-property-awarded.jpg"
  },
  {
    "title": "NCLAT Holds ESI Contributions Outside Liquidation Estate",
    "description": "<p>The National Company Law Appellate Tribunal (NCLAT) has ruled that Employees' State Insurance Corporation (ESIC) contributions collected by an employer do not become the property of the corporate debtor and must be excluded from the liquidation estate. This decision, delivered on September 24, 2025, in Company Appeal (AT)(Ins) No. 301 of 2024, overturns a prior NCLT order and directs that Rs 1,20,80,940 of ESI dues belonging to Gupta Dyeing & Printing Mills Pvt. Ltd. be kept separate from the assets available to other creditors during liquidation.</p>\n\n<p>The dispute arose when the Regional Director of ESIC claimed that unpaid ESI contributions, deducted from workers' wages, should be excluded from the company's assets due to a statutory trust under Section 40(4) of the ESI Act, 1948. This claim was challenged by the liquidator and other creditors who would benefit from including the amount in the liquidation estate. The NCLT initially dismissed the ESIC plea, deeming the Corporation an operational creditor without priority under Section 53(1)(b) of the Insolvency and Bankruptcy Code (IBC).</p>\n\n<p>On appeal, the NCLAT emphasized that employers hold employee ESI contributions as trustees for the ESIC, making non-payment a breach of trust. The tribunal aligned with a previous ruling in Nurani Subramanian Suryanarayanan, Liquidator of M/s Care IT Solutions Pvt. Ltd. v. ESIC, which resolved a similar issue in favor of the Corporation. The NCLAT clarified that Section 36(4)(a)(i) of the IBC carves out \"assets in trust for any third party\" from the liquidation estate, and Section 40(4) of the ESI Act creates precisely such a trust.</p>\n\n<p>The NCLAT set aside the NCLT order, directing that the ESI dues of Rs 1,20,80,940 be remitted to the ESIC and not treated as part of the liquidation estate. The ruling affirms that social security deductions are distinct and do not merge into the corporate debtor's assets. This decision serves as a reminder to liquidators and reinforces the right of statutory authorities to insist on exclusion rather than mere priority of such deductions. This precedent may influence similar claims related to other wage-related statutes like provident fund and gratuity.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/nclat-esi-contributions-excluded-from-liquidation-estate.jpg"
  },
  {
    "title": "RBI Issues Directions on Settlement of Claims for Deceased Customers",
    "description": "<p>The Reserve Bank of India (RBI) released the Reserve Bank of India (Settlement of Claims in respect of Deceased Customers of Banks) Directions, 2025, effective March 31, 2026. These directions consolidate and standardize procedures for settling claims related to deposit accounts, safe deposit lockers, and articles in safe custody for deceased bank customers, aiming to minimize delays and ensure uniform practices across commercial and cooperative banks. They do not apply to government-administered savings schemes like PPF or SCSS.</p>\n\n<p>The legal basis for these directions rests on provisions intended to expedite claim settlements. The RBI observed inconsistent bank practices regarding nomination, often requiring succession certificates even with existing nominations. These directions repeal prior circulars, establishing a uniform and enforceable system.</p>\n\n<p>For claims exceeding a specified threshold, settlement necessitates succession certificates, legal heir certificates, or affidavits, potentially with sureties. Banks retain discretion to act on uncontested Wills without requiring probate but require court orders for disputed claims. In the absence of a nomination, a simplified procedure involves claim forms, death certificates, identity proof, and a legal heir certificate or affidavit with no-objection statements from other heirs. Disputed cases without nomination require probate, succession certificate, or a court order for resolution.</p>\n\n<p>These Directions represent a significant reform in banking consumer protection law, establishing uniform procedures, timelines, and penalties for delays. They address long-standing grievances by depositor families, ensuring efficient access to funds and belongings while balancing ease of settlement with safeguards against wrongful claims. The harmonized framework enhances operational clarity for banks and strengthens customer trust in the banking system.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/rbi-issues-directions-on-settlement-of-deceased-claims.jpg"
  },
  {
    "title": "PVR Wins Consumer Case: Restriction on Outside Snacks Upheld, Free Water Mandated",
    "description": "<p>The District Consumer Disputes Redressal Commission, Ernakulam, dismissed a consumer complaint against PVR Cinemas regarding its policy of prohibiting outside food and beverages. The complainant argued that this restriction constituted an unfair trade practice, forcing consumers to purchase overpriced in-house items.</p>\n\n<p>The Commission ruled that cinema theaters have the legal right to regulate entry conditions, including restricting outside food, referencing the Supreme Court precedent set in K.C. Cinema v. State of J&K. This right is contingent upon ensuring free access to drinking water and accommodating special needs. The complainant failed to prove a deficiency in service, as the ban on outside food was consistent with established legal precedent.</p>\n\n<p>While dismissing the complaint, the Commission issued a binding directive, ordering PVR Cinemas to strictly comply with its undertaking to provide uninterrupted access to free RO-filtered drinking water for all customers. This includes maintaining the facility hygienically and displaying prominent signage. This decision balances the operational rights of the multiplex with the fundamental health and welfare of consumers, mitigating potential exploitative practices.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/pvr-wins-case-outside-food-ban-upheld-free-water-mandated.jpg"
  },
  {
    "title": "Reshaping Professional Services: MCA Issues Consultation on Multi-Disciplinary Partnerships",
    "description": "<p>The Ministry of Corporate Affairs (MCA) launched a public consultation on September 17, 2025, regarding the proposed establishment of Multi-Disciplinary Partnership (MDP) firms in India. This initiative seeks to create a regulatory framework that enables domestic professional services firms (e.g., law, accounting, consulting) to compete effectively with larger international networks by allowing collaboration across disciplines while maintaining professional independence. Stakeholders are invited to submit their feedback by September 30, 2025, via the MCA’s e-Consultation Module or email.</p>\n\n<p>Currently, Indian professional services firms operate within a fragmented regulatory environment, constrained by multiple professional statutes and licensing requirements that restrict cross-disciplinary collaboration. Recognizing that these structural challenges impede growth and competitiveness, the MCA is exploring MDPs as a solution, drawing on global best practices.</p>\n\n<p>The consultation, initiated through Notification No. 01/5/2025-PI/MCA, invites stakeholder views on various aspects of MDPs, including governance models, accountability, and transitional arrangements. This consultation presents an opportunity to shape the future of the professional services sector in India. If implemented effectively, MDPs could enhance efficiency, foster competition, and elevate Indian firms on the global stage. Stakeholder feedback is crucial in shaping a robust and forward-looking framework for multidisciplinary firms in India.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/mca-seeks-views-on-multi-disciplinary-partnership-firms.jpg"
  },
  {
    "title": "Judicial Rationale in Sharad Singh v. H. D. Narang: A Significant Refinement in Compensation for a Paraplegic Victim",
    "description": "<p>In Sharad Singh v. H. D. Narang, the Supreme Court of India delivered a landmark judgment enhancing the compensation awarded to the legal representative of a deceased accident victim, Sharad Singh, who suffered paraplegia due to a motor vehicle accident. The ruling, authored by Justice K. Vinod Chandran and Justice N.V. Anjaria, refines motor accident compensation jurisprudence, particularly concerning students with demonstrated academic potential.</p>\n\n<p>The victim, a 20-year-old B. Com student and ICAI enrollee, sustained severe injuries in 2001 when a negligently driven car struck the motorcycle he was riding, resulting in complete paraplegia. He remained bedridden until his death in 2021. The Supreme Court addressed the High Court's inadequate assessment of income and future medical expenses. It dismissed the insurance company's objections to medical bills from hospitals outside the victim's hometown, emphasizing the company's national presence and the legitimate need for specialized care in different locations.  The Court upheld medical expenses amounting to Rs. 20 lakhs, recognizing the necessity of the treatments for sustaining the victim's life.</p>\n\n<p>Critically, the Court rejected the lower courts' reliance on minimum wage as the basis for calculating loss of income. The Supreme Court deemed the use of minimum wage inappropriate for a graduate student pursuing a Chartered Accountancy qualification. Instead, it estimated a notional monthly income of Rs. 5,000 in 2001, considering his potential as an accountant, and applied a 40% increase for future prospects, consistent with National Insurance Company Limited vs. Pranay Sethi and Others. This led to a revised loss of income calculation of Rs. 15,12,000.</p>\n\n<p>The Supreme Court's judgment resulted in a significantly enhanced total compensation award of Rs. 40,34,356. The Court underscored the importance of considering a student's potential when determining compensation and reiterated that insurance companies cannot evade liability on unsubstantiated grounds, especially when life-saving medical care is involved. The ruling serves as a precedent for equitable compensation, acknowledging both the victim's potential and the substantial costs associated with life-sustaining care.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/sc-enhances-compensation-in-sharad-singh-paraplegia-case.jpg"
  },
  {
    "title": "Lok Adalat vs. Employees’ Compensation Act: Kerala High Court Upholds Settlement Finality",
    "description": "<p>The Kerala High Court, in a judgment delivered on September 22, 2025, addressed the issue of whether a settlement reached at a Lok Adalat precludes a subsequent claim for compensation under the Employees’ Compensation Act, 1923, and whether Section 8(1) of the Act prohibits payments not deposited with the Commissioner. The case involved parents who, after their son's death in a workplace accident, received Rs 10 lakh through a Lok Adalat settlement and later sought additional compensation from the Employees’ Compensation Commissioner.</p>\n\n<p>The Commissioner denied the claim, citing the prior Lok Adalat award as a final discharge of liability. The parents appealed this decision, leading the High Court to formulate two substantial questions of law: whether the Employees’ Compensation Act claim can be settled through a Pre-Litigation Petition despite Section 8(1) of the EC Act, and whether receipt of money from the Lok Adalat bars a subsequent claim for the statutory amount before the Commissioner.</p>\n\n<p>The Court, referencing the supremacy clause in Section 25 of the Legal Services Authorities Act, ruled that the Lok Adalat settlement was final. It reasoned that when a dispute is taken to a Permanent Lok Adalat, the restrictions of Section 8(1) are relaxed, given the Adalat's role in protecting weaker parties. The court also invoked the doctrine of election of remedies, stating that the parents, having chosen to settle at the Lok Adalat, were bound by that choice. Thus, the appeal was dismissed, affirming that the Rs 10 lakh already received constituted a full and conclusive settlement, preventing the family from pursuing further compensation through the Employees’ Compensation Commissioner.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/kerala-hc-lok-adalat-settlements-are-final-in-ec-claims.jpg"
  }
]